[{"date":"2019-11-07T21:05:00+00:00","title":"Kimball Electronics, Inc. Announces Election of Directors","content":"JASPER, Ind., Nov.  07, 2019  (GLOBE NEWSWIRE) -- Kimball Electronics, Inc. (NASDAQ: KE), (the “Company”), today announced the election of two new directors at its Annual Meeting of Share Owners held on November 7, 2019.\n\nHolly A. Van Deursen and Michele M. Holcomb, PhD, were elected to the Company’s Board of Directors (the “Board”), effective as of the annual meeting. Dr. Holcomb will serve on the Audit Committee of the Board and Ms. Van Deursen will serve on the Compensation and Governance Committee.\n\nMs. Van Deursen and Dr. Holcomb will fill vacancies left by the retirement of former Board members Thomas J. Tischhauser and Christine M. Vujovich.\n\nMs. Van Deursen currently serves as an independent director on public-company boards, Actuant Corporation (NYSE: ATU), Capstone Turbine Corporation (NASDAQ: CPST), Albemarle Corporation (NYSE: ALB), and Synthomer, plc. (LON: SYNT). She joined BP Amoco in 1998, a $250 billion oil, gas, and energy company operating in North America, Asia, and Europe. She served in various senior executive management roles for BP, plc., retiring in 2005 as a member of the top-forty executive management team.\n\nDr. Holcomb currently serves as Executive Vice President of Strategy and Corporate Development at Cardinal Health, a global integrated healthcare services and products company. She previously held positions as Chief Operating Officer of Global R&D and Senior Vice President of Strategy, Portfolio, Search and Partnerships at Teva Pharmaceuticals, a global manufacturer of generic medicines, and as a partner in the Global Pharmaceutical Practice at consulting firm McKinsey & Company.\n\n“Speaking on behalf of our Board, we are honored to have Holly and Michele join us to add their knowledge, experience, and counsel, especially given their diverse operational backgrounds. It was extremely important to us that we recruit new Board members who have distinct and valuable skill sets that we believe will help Kimball Electronics maximize its long-term potential. We would also like to thank Tom and Tina for their years of valuable service to the Board,” said Don Charron, Chairman of the Board and Chief Executive Officer.\n\nAbout Kimball Electronics, Inc.\r\nKimball Electronics is a multifaceted manufacturing solutions provider of electronics and diversified contract manufacturing services to customers around the world. From our operations in the United States, China, India, Japan, Mexico, Poland, Romania, Thailand, and Vietnam, our teams are proud to provide manufacturing services for a variety of industries. Recognized for a reputation of excellence, we are committed to a high-performance culture that values personal and organizational commitment to quality, reliability, value, speed, and ethical behavior. Kimball Electronics, Inc. (NASDAQ: KE) is headquartered in Jasper, Indiana.\n\nTo learn more about Kimball Electronics, visit: www.kimballelectronics.com.\n\nLasting relationships. Global success.\n\nCONTACT:\r\nAdam W. Smith\r\nTreasurer\r\nTelephone: 812.634.4000\r\nE-mail: Investor.Relations@kimballelectronics.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/11\/07\/1943549\/33277\/en\/Kimball-Electronics-Inc-Announces-Election-of-Directors.html","symbols":["ALB.US","ATU.US","CPST.US","KE.US"],"tags":["INC","KIMBALL ELECTRONICS","NASDAQ:KE"],"sentiment":{"polarity":0.995,"neg":0,"neu":0.875,"pos":0.125}},{"date":"2019-06-04T11:02:00+00:00","title":"Sparkhound Helps Albemarle® With Complete Digital Transformation To Cloud-Based Communications","content":"BATON ROUGE, La., June  04, 2019  (GLOBE NEWSWIRE) -- Sparkhound, a leading digital solutions firm providing trusted implementation of cloud services, custom applications, advanced analytics, and managed enterprise services, today announced Albemarle Corporation’s (NYSE: ALB) company-wide transition from Lotus Notes and WebEx platforms to Microsoft’s Office 365 cloud-based services. The cloud conversion ushers in a new era of seamless collaboration across the globe. Read the full Albemarle case study here: http:\/\/bit.ly\/2WhMduC.\n\nAlbemarle maintains leading positions in lithium, bromine, refining catalysts, and powers the potential of companies in many of the world's largest and most critical industries, from energy and communications to transportation and electronics. Seeking to unify global communications and transition to a more agile cloud-based solution—with no productivity disruptions— Albemarle partnered with Sparkhound to perform a full Office 365 conversion.\n\n“We needed a new company-wide collaboration platform—continuing to use Lotus Notes and WebEx applications were proving difficult and costly. To achieve our goals, we needed help with the email system migration, data loss protection as well as IMR assistance,” said Patrick Thompson, Chief Information Officer, Albemarle.\n\nAugmenting Albemarle's skilled IT team, Sparkhound implemented Office 365’s email, SharePoint and Skype across their global locations. In total, the teams converted 6,000 users and 40 Domino servers to Office 365 in only 30 days while also meeting the EU’s General Data Protection Regulation (GDPR) requirements by identifying the data, where it's going and how it's being managed.\n\nWorking with Sparkhound, Albemarle experienced a smooth migration to the cloud, which was “flawless with no technical difficulties,” Thompson added.  “This is how projects should run, taking into account all IT changes and business challenges.”\n\n“Many large organizations have talented staff, but lack the time and experience to fully dedicate themselves to large cloud conversions,” said Shawn Usher, Sparkhound’s President, and Chief Executive Officer. “Sparkhound’s experts become a seamless extension of our customers’ IT team to ensure a digital transformation that yields better productivity, greater cost savings, and a more secure network—with no productivity disruptions.”\n\nAbout Sparkhound\r\nWith multiple locations throughout the United States, Sparkhound is dedicated to enabling its clients’ business through leadership and digital transformation. For 20 years, our consultants have provided experience, insights, and digital capabilities to ensure impactful business outcomes. Sparkhound’s technology experts join your team to plan, build and run lasting business solutions. Are you ready for a better digital consultant? Visit: www.sparkhound.com\n\nFor more information, contact:\r\nBetsey Rogers\r\nPublic Relations\r\nBridgeView Marketing\r\n603-821-0809\r\nbetsey@bridgeviewmarketing.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/04\/1863820\/0\/en\/Sparkhound-Helps-Albemarle-With-Complete-Digital-Transformation-To-Cloud-Based-Communications.html","symbols":["ALB.US"],"tags":["SPARKHOUND"],"sentiment":{"polarity":0.986,"neg":0.036,"neu":0.85,"pos":0.113}},{"date":"2019-04-10T12:00:00+00:00","title":"Report: Developing Opportunities within Albemarle, Stratasys, Pure Storage, Tenaris S.A, GNC, and The Providence Service — Future Expectations, Projections Moving into 2019","content":"NEW YORK, April  10, 2019  (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Market Source Research released its latest key findings for all current investors, traders, and shareholders of Albemarle Corporation (NYSE:ALB), Stratasys, Ltd. (NASDAQ:SSYS), Pure Storage, Inc. (NYSE:PSTG), Tenaris S.A. (NYSE:TS), GNC Holdings, Inc. (NYSE:GNC), and The Providence Service Corporation (NASDAQ:PRSC), including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.\n\nComplimentary Access: Research Reports\n\nFull copies of recently published reports are available to readers at the links below.\n\nALB DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=ALB\r\n SSYS DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=SSYS\r\n PSTG DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=PSTG\r\n TS DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=TS\r\n GNC DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=GNC\r\n PRSC DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=PRSC\n\n(You may have to copy and paste the link into your browser and hit the [ENTER] key)\n\nThe new research reports from Market Source Research, available for free download at the links above, examine Albemarle Corporation (NYSE:ALB), Stratasys, Ltd. (NASDAQ:SSYS), Pure Storage, Inc. (NYSE:PSTG), Tenaris S.A. (NYSE:TS), GNC Holdings, Inc. (NYSE:GNC), and The Providence Service Corporation (NASDAQ:PRSC) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today's readers below.\n\n-----------------------------------------\n\nImportant Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. Percentage calculations are performed after rounding. All amounts in millions (MM), except per share amounts.\n\n-----------------------------------------\n\nALBEMARLE CORPORATION (ALB) REPORT OVERVIEW\n\nAlbemarle's Recent Financial Performance\n\nFor the three months ended December 31st, 2018 vs December 31st, 2017, Albemarle reported revenue of $921.70MM vs $857.79MM (up 7.45%) and analysts estimated basic earnings per share $1.24 vs -$1.97. For the twelve months ended December 31st, 2018 vs December 31st, 2017, Albemarle reported revenue of $3,374.95MM vs $3,071.98MM (up 9.86%) and analysts estimated basic earnings per share $6.40 vs $0.49 (up 1,206.12%). Analysts expect earnings to be released on May 8th, 2019. The report will be for the fiscal period ending March 31st, 2019. The reported EPS for the same quarter last year was $1.30. The estimated EPS forecast for the next fiscal year is $6.74 and is expected to report on February 19th, 2020.\n\nTo read the full Albemarle Corporation (ALB) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=ALB\n\n-----------------------------------------\n\nSTRATASYS, LTD. (SSYS) REPORT OVERVIEW\n\nStratasys' Recent Financial Performance\n\nFor the three months ended December 31st, 2018 vs December 31st, 2017, Stratasys reported revenue of $177.12MM vs $179.34MM (down 1.24%) and analysts estimated basic earnings per share $0.11 vs -$0.19. For the twelve months ended December 31st, 2018 vs December 31st, 2017, Stratasys reported revenue of $663.24MM vs $668.36MM (down 0.77%) and analysts estimated basic earnings per share -$0.22 vs -$0.75. Analysts expect earnings to be released on May 1st, 2019. The report will be for the fiscal period ending March 31st, 2019. Reported EPS for the same quarter last year was $0.00. The estimated EPS forecast for the next fiscal year is $0.41 and is expected to report on March 5th, 2020.\n\nTo read the full Stratasys, Ltd. (SSYS) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=SSYS\n\n-----------------------------------------\n\nPURE STORAGE, INC. (PSTG) REPORT OVERVIEW\n\nPure Storage's Recent Financial Performance\n\nFor the three months ended January 31st, 2019 vs January 31st, 2018, Pure Storage reported revenue of $422.22MM vs $339.86MM (up 24.23%) and analysts estimated basic earnings per share -$0.10 vs -$0.06. For the twelve months ended January 31st, 2019 vs January 31st, 2018, Pure Storage reported revenue of $1,359.82MM vs $1,024.76MM (up 32.70%) and analysts estimated basic earnings per share -$0.77 vs -$0.76. Analysts expect earnings to be released on May 20th, 2019. The report will be for the fiscal period ending April 30th, 2019. Reported EPS for the same quarter last year was -$0.28. The estimated EPS forecast for the next fiscal year is -$0.30 and is expected to report on February 27th, 2020.\n\nTo read the full Pure Storage, Inc. (PSTG) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=PSTG\n\n-----------------------------------------\n\nTENARIS S.A. (TS) REPORT OVERVIEW\n\nTenaris S.A's Recent Financial Performance\n\nFor the three months ended December 31st, 2018 vs December 31st, 2017, Tenaris S.A reported revenue of $2,104.98MM vs $1,588.92MM (up 32.48%) and basic earnings per share $0.37 vs $0.11 (up 236.36%). For the twelve months ended December 31st, 2018 vs December 31st, 2017, Tenaris S.A reported revenue of $7,658.59MM vs $5,288.50MM (up 44.82%) and analysts estimated basic earnings per share $1.48 vs $0.77 (up 92.21%). Analysts expect earnings to be released on April 25th, 2019. The report will be for the fiscal period ending March 31st, 2019. The reported EPS for the same quarter last year was $0.40. The estimated EPS forecast for the next fiscal year is $1.96 and is expected to report on February 19th, 2020.\n\nTo read the full Tenaris S.A. (TS) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=TS\n\n-----------------------------------------\n\nGNC HOLDINGS, INC. (GNC) REPORT OVERVIEW\n\nGNC's Recent Financial Performance\n\nFor the three months ended December 31st, 2018 vs December 31st, 2017, GNC reported revenue of $547.86MM vs $562.82MM (down 2.66%) and analysts estimated basic earnings per share $0.70 vs -$3.09. For the twelve months ended December 31st, 2018 vs December 31st, 2017, GNC reported revenue of $2,353.52MM vs $2,480.96MM (down 5.14%) and analysts estimated basic earnings per share $0.83 vs -$2.18. Analysts expect earnings to be released on April 25th, 2019. The report will be for the fiscal period ending March 31st, 2019. The reported EPS for the same quarter last year was $0.24. The estimated EPS forecast for the next fiscal year is $0.55 and is expected to report on March 3rd, 2020.\n\nTo read the full GNC Holdings, Inc. (GNC) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=GNC\n\n-----------------------------------------\n\nTHE PROVIDENCE SERVICE CORPORATION (PRSC) REPORT OVERVIEW\n\nThe Providence Service's Recent Financial Performance\n\nFor the three months ended December 31st, 2018 vs December 31st, 2017, The Providence Service reported revenue of $145.81MM vs $101.23MM (up 44.04%) and analysts estimated basic earnings per share -$1.70 vs $2.48. For the twelve months ended December 31st, 2018 vs December 31st, 2017, The Providence Service reported revenue of $1,384.97MM vs $1,318.22MM (up 5.06%) and analysts estimated basic earnings per share -$1.95 vs $3.14. Analysts expect earnings to be released on May 8th, 2019. The report will be for the fiscal period ending March 31st, 2019.\n\nTo read the full The Providence Service Corporation (PRSC) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=PRSC\n\n-----------------------------------------\n\nABOUT MARKET SOURCE RESEARCH\n\nMarket Source Research delivers the key research reports that helps serious investors, registered brokers, professional traders, and personal investment advisers find reliable information in today's markets. Market Source Research's team is comprised of financial professionals, many of which hold Chartered Financial Analyst® (CFA®) designations and FINRA® BrokerCheck® certifications. Whether identifying emerging trends, or discovering new opportunity, the team at Market Source Research is dedicated to providing accurate, informative, and objective content that's ahead of the curve. With insights on individual companies as well as sectors, readers get the industry's best available combination of big-picture perspective as well as granular detail.\n\nREGISTERED MEMBER STATUS\n\nMarket Source Research's oversight and audit staff are registered analysts, brokers, and\/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Market Source Research's roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Market Source Research have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Market Source Research's Compliance department by Phone, at +1 (704) 343-6361, or by E-mail at compliance@MarketSourceResearch.com.\n\nLEGAL NOTICES\n\nInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Market Source Research, Market Source Research members, and\/or Market Source Research affiliates are not responsible for any gains or losses that result from the opinions expressed. Market Source Research makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Market Source Research has not been compensated for the publication of this press release by any of the above mentioned companies. Market Source Research is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.\n\nMedia Contact:\r\n Jim Patterson, Media Department\r\n Office: +1 (704) 343-6361\r\n E-mail: media@MarketSourceResearch.com\n\n© 2019 Market Source Research. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@MarketSourceResearch.com.\n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n\nFINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/04\/10\/1801941\/0\/en\/Report-Developing-Opportunities-within-Albemarle-Stratasys-Pure-Storage-Tenaris-S-A-GNC-and-The-Providence-Service-Future-Expectations-Projections-Moving-into-2019.html","symbols":["ALB.US","GNC.US","PRSC.US","PSTG.US","SSYS.US","TS.US"],"tags":["INVESTMENT OPINION","MARKET SOURCE RESEARCH"],"sentiment":{"polarity":0.995,"neg":0.009,"neu":0.939,"pos":0.052}},{"date":"2019-02-27T13:00:00+00:00","title":"Smart Money in the Lithium Sector Betting on Future Global Demand","content":"POINT ROBERTS, Wash. and DELTA, British Columbia, Feb.  27, 2019  (GLOBE NEWSWIRE) -- Investorideas.com, a leading investor news resource covering AI and lithium stocks issues the first article in a two-part series looking at the increased global demand for lithium and how smart money is betting on its long-term growth.\n\nLeading the bullish sentiment is the world’s largest producer of lithium, Albemarle Corp. (NYSE: ALB), reporting fourth quarter results on February 20th, with a headline of ‘ALBEMARLE ENDS 2018 STRONG; PROJECTING CONTINUED GROWTH IN 2019’.\n\nFourth quarter net sales were $921.7 million, an increase of 7% over the prior year; earnings were $129.6 million, or $1.21 per diluted share, an increase of 162% over the prior year. Fourth quarter adjusted EBITDA was $264.3 million, an increase of 8% over the prior year; adjusted diluted earnings per share was $1.53, an increase of 14% over the prior year.\n\nThe long term investment potential of lithium is not being missed by Standard Lithium Ltd. (TSXV: SLL.V) (OTCQX:STLHF), a specialty chemical company focused on unlocking the value of existing large-scale US based lithium-brine resources, who recently announced it has entered into a funding equity agreement with a syndicate of underwriters led by Canaccord Genuity Corp., for gross proceeds of $10,500,000 (CAD).\n\nThe net proceeds from the Offering are expected to be used by the Company for advancing its existing asset portfolio and for general working capital purposes. The Company's flagship project is located in southern Arkansas, where it is engaged in the testing and proving of the commercial viability of lithium extraction from over 150,000 acres of permitted brine operations utilizing the Company's proprietary selective extraction technology based on AI (artificial intelligence) technology.\n\nLooking at the outlook for the sector, Zacks Research reported following Albemarle’s fourth quarter numbers, with the headline ‘Lithium ETF at One-Month High: Here's Why’, “Such upbeat guidance and facts boosted investors’ confidence about lithium demand. Albemarle’s results acted as a cornerstone for the industry. Shares of other key lithium producers also gained on Feb 22.”\n\nAlbemarle is part of the top 10 holdings of the Global X Lithium & Battery Tech ETF, a fund that invests in the full lithium cycle, from mining and refining the metal, through battery production. Other companies in their top ten include FMC Corp., LG Chem Ltd., Byd Co., Samsung, GS Yuasa Corp., Enersys, Panasonic and Tesla Inc. (NASDAQ: TSLA).\n\nLooking at supply and demand, Tesla says, “To ramp production to 500,000 cars per year, Tesla alone will require today’s entire worldwide supply of lithium-ion batteries.”\n\nSo, Tesla bet big money and in 2014 began construction on the Tesla Gigafactory to supply enough batteries to support Tesla’s projected vehicle demand.\n\nBYD Company Limited, the Chinese leader in the EV game is following suit, albeit a few years later, and just announced it has broken ground on a new 20 GWh battery gigafactory for electric cars, investing $1.49 billion USD in the facility.\n\nThe lithium market has not been without its setbacks though, as Nemaska Lithium Inc. (TSX: NMX.TO) (OTC: NMKEF) recently announced that it has terminated its multi-year supply agreement with Livent Corporation. The Supply Agreement pertains to the provision of up to 8,000 tonnes per year (28,000 tonnes in total during the term of the contract) of lithium carbonate starting April 1, 2019.\n\nWhile some see this a major issue, one news article stated that, “Growing evidence points toward a supply-side which will continue to struggle to deliver as Nemaska Lithium Inc. move to terminate a multi-year agreement to provide lithium carbonate to Livent Corp. The deal with Livent, spun out of major US lithium producer FMC Corp., saw Nemaska provide up to 8,000 tpa of lithium carbonate starting in April 2019. However these examples only serve to highlight supply instabilities across an infant industry.”\n\nLooking at the recent volatility in the sector, while seeing a bullish future, Metalbulletin.com reported, “While the supply side is weighing on sentiment, the demand side of the equation remains extremely bullish - and increasingly so.”\n\nDemand for lithium is without question on the rise in the near and far reaching future, and while the industry has suffered minor blips and supply instabilities, smart money is betting on a bullish future for lithium and the stocks in the sector, with a leader Albemarle and juniors like Standard Lithium doubling down on what is looking like a sure thing.\n\nAbout Investorideas.com \r\nhttps:\/\/www.investorideas.com\/About\/\n\nFollow us on Social Media \r\nFollow us on Twitter https:\/\/twitter.com\/Investorideas\r\nFollow us on Facebook https:\/\/www.facebook.com\/Investorideas\r\nFollow us on YouTube https:\/\/www.youtube.com\/c\/Investorideas\n\nDisclaimer\/Disclosure: Investorideas.com is a digital publisher of third party sourced news, articles and equity research as well as creates original content, including video, interviews and articles. Original content created by investorideas is protected by copyright laws other than syndication rights. Our site does not make recommendations for purchases or sale of stocks, services or products. Nothing on our sites should be construed as an offer or solicitation to buy or sell products or securities. All investment involves risk and possible loss of investment. This site is currently compensated for news publication and distribution, social media and marketing, content creation and more. Contact each company directly regarding content and press release questions. Disclosure is posted for each compensated news release, content published \/created if required but otherwise the news was not compensated for and was published for the sole interest of our readers and followers. More disclaimer info: https:\/\/www.investorideas.com\/About\/Disclaimer.asp. Disclosure: this article featuring Standard Lithium is a paid for service on Investorideas.com – third party. Learn more about costs and our services https:\/\/www.investorideas.com\/News-Upload\/\r\nAdditional info regarding BC Residents and global Investors: https:\/\/www.bcsc.bc.ca\/release.aspx?id=6894. \r\nInvestorideas.com privacy policy: https:\/\/www.investorideas.com\/About\/Private_Policy.asp\n\nContact Investorideas.com \r\n800-665-0411","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/02\/27\/1743380\/0\/en\/Smart-Money-in-the-Lithium-Sector-Betting-on-Future-Global-Demand.html","symbols":["ALB.US","NMX-TO.TO","TSLA.US"],"tags":["INVESTORIDEAS.COM"],"sentiment":{"polarity":0.992,"neg":0.022,"neu":0.893,"pos":0.085}},{"date":"2019-02-26T15:30:00+00:00","title":"Charging Ahead with EV Growth Beyond Cars; Lithium-ion Batteries will Continue to Dominate","content":"POINT ROBERTS, Wash. and DELTA, B.C., Feb.  26, 2019  (GLOBE NEWSWIRE) -- Investorideas.com, a global investor news source covering lithium and cleantech stocks issues a snapshot looking at how the EV market is on an exponential growth curve, fuelled by both policy and consumer demand.\n\n“China is charging full speed ahead into electric vehicles, on track to sell over 2 million electric vehicles this year, from 1.1 million in 2018,” says Cleantechnia.\n\nIDTechEX says the demand for EV trucks and buses has only just started, especially in China. Lithium-ion batteries will continue to dominate according to the report. “In a series of waves, the storage demand is powering upwards to over $200 billion in 2029 with buses and delivery vans already well into electrification.”\n\nWhen discussing EV’s and lithium demand, one company “driving” the conversation is Tesla Inc. (NASDAQ:TSLA). Tesla has been on an upward push the last two years; for the three months ended September 30th, 2018 vs September 30th, 2017 Tesla reported revenue of $6.8MM vs $2.9MM, up 128.65%, with the estimated EPS forecast for the next fiscal year being $6.13 and is expected to report on January 29th, 2020.\n\nThe success of Tesla has allowed lithium extractors and producers to ride the same wave of success, but will there be enough lithium fast enough to meet market demands, and if so which company will take the lead?\n\nAlbemarle Corporation (NYSE: ALB) reported very positive results just last week for Q4 and the 2018 financial year. Fourth quarter net sales were $921.7 million, an increase of 7% over the prior year; earnings were $129.6 million, or $1.21 per diluted share, an increase of 162% over the prior year.\n\n\"2018 was a successful year for Albemarle on many fronts. Excluding divested businesses, we delivered full year, total company adjusted EBITDA growth of 17%, adjusted diluted EPS growth of 23% and we finished the year strong as all of our reportable segments delivered growth in the fourth quarter. In addition, we returned significant value to shareholders through increased dividends of $145 million and $500 million in share repurchases, while continuing significant growth investment in our Lithium platform,\" said Luke Kissam, Albemarle's CEO. \"Lithium contributed just over 50% of our adjusted EBITDA, driven by 10% volume growth and 9% pricing compared to 2017.\"\n\nLess than 1.5 miles from Albemarle’s Silver Peak Project, Enertopia Corporation (OTCQB: ENRT) (CSE: TOP) recently announced an update on their synthetic solution testing.\n\nSince Fall 2018, Enertopia has been running tests to recover lithium in the most cost-effective manner from synthetic brine solutions produced by leaching surface, lithium bearing claystones.  To date, 32 solution tests have been run to create a database that forms the building block for upcoming solution tests.\n\nTheir 3rd phase of solution testing is expected to be in full swing by early March 2019 and will use drill core material from the diamond drill holes from their recently completed drilling program and will consist of 49 different sample intervals covering 397 feet of core.\n\nPre-pH adjustments have demonstrated positive outcomes as contaminant minerals are greatly reduced allowing for a cleaner synthetic lithium brine to be processed using off the shelf technologies and variants developed by Entertopia.\n\nThe company's technical advisors believe the positive testing to date may warrant patent protection and thus the Company is keeping all internal data strictly confidential at this time. The Company has signed several NDA’s with industry partners as it works to reaching its goal of a low capex solution to battery grade lithium production.\n\n“With our positive drill program completed, our focus and energy can turn to our solution testing of the drilled lithium horizons. We continue to strive for a low-cost mining and processing solution to unlock the potential value of the Lithium enriched claystones,” stated CEO, Robert McAllister.\n\nBig and small investors are taking note of the traction the lithium market is gaining, including Warren Buffet and Berkshire  Hathaway who recently disclosed a 0.7% stake on February 14th into Suncor Energy Inc. (NYSE: SU) . And why?  It fits into his EV strategy; one he started years ago with BYD, that has grown to become China’s biggest sellers of EV’s.\n\nSuncor just announced that Petro-Canada, a Suncor business, is building a network of electric vehicle (EV) fast charging stations across the country. “With more than 1,800 retail and wholesale locations across the country we have the network in place to build Canada’s first electric highway, providing coast-to-coast EV charging for our customers. We’re also investing in the fastest charging EV technology available today, which will be able to easily upgrade as technology advances.”\n\nWith more positive financial results and improved extraction technology like Enertopia is working on, EV’s and lithium are finally on point to replace the energy technology of the past; oil and gas.\n\nInvestor Ideas directory of lithium stocks:  mining stocks directory and cleantech stock directories, relating to batteries.\n\nAbout Investorideas.com \r\nhttps:\/\/www.investorideas.com\/About\/\n\nSocial Media \r\nTwitter https:\/\/twitter.com\/Investorideas\r\nFacebook https:\/\/www.facebook.com\/Investorideas\r\nYouTube https:\/\/www.youtube.com\/c\/Investorideas\n\nDisclaimer\/Disclosure: Investorideas.com: Our site does not make recommendations for purchases or sale of stocks, services or products. Nothing on our sites should be construed as an offer or solicitation to buy or sell products or securities. All investment involves risk and possible loss of investment. This site is currently compensated for news publication and distribution, social media and marketing, content creation and more. Contact each company directly regarding content and press release questions. Disclosure is posted for each compensated news release, content published \/created if required but otherwise the news was not compensated for and was published for the sole interest of our readers and followers. More disclaimer info: https:\/\/www.investorideas.com\/About\/Disclaimer.asp. Disclosure: this article featuring Enertopia Corporation is a paid for service on Investorideas.com . Learn more about costs and our services https:\/\/www.investorideas.com\/News-Upload\/\n\nAdditional info regarding BC Residents and global Investors:: https:\/\/www.bcsc.bc.ca\/release.aspx?id=6894.\n\nInvestorideas.com privacy policy: https:\/\/www.investorideas.com\/About\/Private_Policy.asp\n\nContact Investorideas.com \r\n800-665-0411","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/02\/26\/1742681\/0\/en\/Charging-Ahead-with-EV-Growth-Beyond-Cars-Lithium-ion-Batteries-will-Continue-to-Dominate.html","symbols":["ALB.US","SU.US","TSLA.US"],"tags":["INVESTORIDEAS.COM"],"sentiment":{"polarity":0.999,"neg":0.017,"neu":0.843,"pos":0.14}},{"date":"2019-02-26T13:00:00+00:00","title":"Investor Expectations to Drive Momentum within Newmont Mining, Albemarle, Abraxas Petroleum, Osisko Gold Royalties, Toro, and Dova Pharmaceuticals — Discovering Underlying Factors of Influence","content":"NEW YORK,, Feb.  26, 2019  (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Market Source Research released its latest key findings for all current investors, traders, and shareholders of Newmont Mining Corporation (NYSE:NEM), Albemarle Corporation (NYSE:ALB), Abraxas Petroleum Corporation (NASDAQ:AXAS), Osisko Gold Royalties Ltd (NYSE:OR), Toro Company (NYSE:TTC), and Dova Pharmaceuticals, Inc. (NASDAQ:DOVA), including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.\n\nComplimentary Access: Research Reports\n\nFull copies of recently published reports are available to readers at the links below.\n\nNEM DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=NEM\r\n ALB DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=ALB\r\n AXAS DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=AXAS\r\n OR DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=OR\r\n TTC DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=TTC\r\n DOVA DOWNLOAD: http:\/\/MarketSourceResearch.com\/register\/?so=DOVA\n\n(You may have to copy and paste the link into your browser and hit the [ENTER] key)\n\nThe new research reports from Market Source Research, available for free download at the links above, examine Newmont Mining Corporation (NYSE:NEM), Albemarle Corporation (NYSE:ALB), Abraxas Petroleum Corporation (NASDAQ:AXAS), Osisko Gold Royalties Ltd (NYSE:OR), Toro Company (NYSE:TTC), and Dova Pharmaceuticals, Inc. (NASDAQ:DOVA) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today's readers below.\n\n-----------------------------------------\n\nImportant Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. All information in this release was accessed February 22nd, 2019. Percentage calculations are performed after rounding. All amounts in millions (MM), except per share amounts.\n\n-----------------------------------------\n\nNEWMONT MINING CORPORATION (NEM) REPORT OVERVIEW\n\nNewmont Mining's Recent Financial Performance\n\nFor the three months ended December 31st, 2018 vs December 31st, 2017, Newmont Mining reported revenue of $2,048.00MM vs $1,935.00MM (up 5.84%) and analysts estimated basic earnings per share $0.00 vs -$1.01. For the twelve months ended December 31st, 2018 vs December 31st, 2017, Newmont Mining reported revenue of $7,253.00MM vs $7,379.00MM (down 1.71%) and analysts estimated basic earnings per share $0.64 vs -$0.21. Analysts expect earnings to be released on April 25th, 2019. The report will be for the fiscal period ending March 31st, 2019. The reported EPS for the same quarter last year was $0.35. The estimated EPS forecast for the next fiscal year is $1.17 and is expected to report on February 20th, 2020.\n\nTo read the full Newmont Mining Corporation (NEM) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=NEM\n\n-----------------------------------------\n\nALBEMARLE CORPORATION (ALB) REPORT OVERVIEW\n\nAlbemarle's Recent Financial Performance\n\nFor the three months ended December 31st, 2018 vs December 31st, 2017, Albemarle reported revenue of $921.70MM vs $857.79MM (up 7.45%) and analysts estimated basic earnings per share $1.22 vs -$1.97. For the twelve months ended December 31st, 2018 vs December 31st, 2017, Albemarle reported revenue of $3,374.95MM vs $3,071.98MM (up 9.86%) and analysts estimated basic earnings per share $6.40 vs $0.49 (up 1,206.12%). Analysts expect earnings to be released on May 8th, 2019. The report will be for the fiscal period ending March 31st, 2019. Reported EPS for the same quarter last year was $1.30. The estimated EPS forecast for the next fiscal year is $6.76 and is expected to report on February 19th, 2020.\n\nTo read the full Albemarle Corporation (ALB) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=ALB\n\n-----------------------------------------\n\nABRAXAS PETROLEUM CORPORATION (AXAS) REPORT OVERVIEW\n\nAbraxas Petroleum's Recent Financial Performance\n\nFor the three months ended September 30th, 2018 vs September 30th, 2017, Abraxas Petroleum reported revenue of $41.63MM vs $24.72MM (up 68.37%) and analysts estimated basic earnings per share $0.01 vs -$0.00. For the twelve months ended December 31st, 2017 vs December 31st, 2016, Abraxas Petroleum reported revenue of $86.26MM vs $56.56MM (up 52.53%) and analysts estimated basic earnings per share $0.10 vs -$0.79. Analysts expect earnings to be released on March 13th, 2019. The report will be for the fiscal period ending December 31st, 2018. Reported EPS for the same quarter last year was $0.04. The estimated EPS forecast for the next fiscal year is $0.28 and is expected to report on March 13th, 2019.\n\nTo read the full Abraxas Petroleum Corporation (AXAS) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=AXAS\n\n-----------------------------------------\n\nOSISKO GOLD ROYALTIES LTD (OR) REPORT OVERVIEW\n\nOsisko Gold Royalties' Recent Financial Performance\n\nFor the three months ended September 30th, 2018 vs September 30th, 2017, Osisko Gold Royalties reported revenue of $85.50MM vs $54.40MM (up 57.16%) and basic earnings per share $0.03 vs $0.04 (down 23.50%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Osisko Gold Royalties reported revenue of $164.47MM vs $47.33MM (up 247.48%) and analysts estimated basic earnings per share -$0.25 vs $0.30. Analysts expect earnings to be released on May 2nd, 2019. The report will be for the fiscal period ending March 31st, 2019. The reported EPS for the same quarter last year was $0.05. The estimated EPS forecast for the next fiscal year is $0.16 and is expected to report on February 19th, 2020.\n\nTo read the full Osisko Gold Royalties Ltd (OR) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=OR\n\n-----------------------------------------\n\nTORO COMPANY (TTC) REPORT OVERVIEW\n\nToro's Recent Financial Performance\n\nFor the three months ended October 31st, 2018 vs October 31st, 2017, Toro reported revenue of $539.30MM vs $488.63MM (up 10.37%) and analysts estimated basic earnings per share $0.37 vs $0.32 (up 15.63%). For the twelve months ended October 31st, 2018 vs October 31st, 2017, Toro reported revenue of $2,618.65MM vs $2,505.18MM (up 4.53%) and analysts estimated basic earnings per share $2.56 vs $2.47 (up 3.64%). Analysts expect earnings to be released on May 23rd, 2019. The report will be for the fiscal period ending April 30th, 2019. The reported EPS for the same quarter last year was $1.20. The estimated EPS forecast for the next fiscal year is $3.24 and is expected to report on December 5th, 2019.\n\nTo read the full Toro Company (TTC) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=TTC\n\n-----------------------------------------\n\nDOVA PHARMACEUTICALS, INC. (DOVA) REPORT OVERVIEW\n\nDova Pharmaceuticals' Recent Financial Performance\n\nAnalysts expect earnings to be released on March 5th, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was -$0.36. The estimated EPS forecast for the next fiscal year is -$2.50 and is expected to report on March 5th, 2019.\n\nTo read the full Dova Pharmaceuticals, Inc. (DOVA) report, download it here: http:\/\/MarketSourceResearch.com\/register\/?so=DOVA\n\n-----------------------------------------\n\nABOUT MARKET SOURCE RESEARCH\n\nMarket Source Research delivers the key research reports that helps serious investors, registered brokers, professional traders, and personal investment advisers find reliable information in today's markets. Market Source Research's team is comprised of financial professionals, many of which hold Chartered Financial Analyst® (CFA®) designations and FINRA® BrokerCheck® certifications. Whether identifying emerging trends, or discovering new opportunity, the team at Market Source Research is dedicated to providing accurate, informative, and objective content that's ahead of the curve. With insights on individual companies as well as sectors, readers get the industry's best available combination of big-picture perspective as well as granular detail.\n\nREGISTERED MEMBER STATUS\n\nMarket Source Research's oversight and audit staff are registered analysts, brokers, and\/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Market Source Research's roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Market Source Research have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Market Source Research's Compliance department by Phone, at +1 (704) 343-6361, or by E-mail at compliance@MarketSourceResearch.com.\n\nLEGAL NOTICES\n\nInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Market Source Research, Market Source Research members, and\/or Market Source Research affiliates are not responsible for any gains or losses that result from the opinions expressed. Market Source Research makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Market Source Research has not been compensated for the publication of this press release by any of the above mentioned companies. Market Source Research is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.\n\nMedia Contact:\r\n Hugo Moreau, Media Department\r\n Office: +1 (704) 343-6361\r\n E-mail: media@MarketSourceResearch.com\n\n© 2019 Market Source Research. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@MarketSourceResearch.com.\n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n\nFINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/02\/26\/1742366\/0\/en\/Investor-Expectations-to-Drive-Momentum-within-Newmont-Mining-Albemarle-Abraxas-Petroleum-Osisko-Gold-Royalties-Toro-and-Dova-Pharmaceuticals-Discovering-Underlying-Factors-of-Infl.html","symbols":["ALB.US","AXAS.US","DOVA.US","NEM.US","OR.US","TTC.US"],"tags":["INVESTMENT OPINION","MARKET SOURCE RESEARCH"],"sentiment":{"polarity":0.995,"neg":0.009,"neu":0.941,"pos":0.05}},{"date":"2019-02-06T13:00:00+00:00","title":"The Battery Race in the US and How Lithium Plays a Leading Role","content":"POINT ROBERTS, Wash. and DELTA, British Columbia, Feb.  06, 2019  (GLOBE NEWSWIRE) -- Investorideas.com, one of the first global investor news sources covering renewable energy with its Renewableenergystocks.com content, looks at the race for the best batteries as sustainability becomes a mandate and how lithium will play a leading role.\n\nOn Monday, February 4th, investors were charged up as Maxwell Technologies, Inc. (Nasdaq:MXWL), a developer and manufacturer of energy solutions announced it has entered into an agreement to be acquired at $4.75 per share by electric car company, Tesla, Inc. (Nasdaq:TSLA). The stock traded over 18 Million shares and was up over 49% for the day.\n\n\"We are very excited with today's announcement that Tesla has agreed to acquire Maxwell. Tesla is a well-respected and world-class innovator that shares a common goal of building a more sustainable future,\" said Dr. Franz Fink, President and Chief Executive Officer of Maxwell. \"We believe this transaction is in the best interests of Maxwell stockholders and offers investors the opportunity to participate in Tesla's mission of accelerating the advent of sustainable transport and energy.\"\n\nParamount to the future of the evolution of the auto industry is lithium. According to a report from Edinburgh Partners, “demand is expected to increase by a factor of 3-4 times by 2025 with the vast majority of the growth driven by pure Battery Electric Vehicles (BEV).”\n\nStandard Lithium (TSXV:SLL) (OTCQB:STLHF) is well positioned as a strategic US source of battery quality lithium materials and is currently focused on the immediate development of its flagship, 180,000 acre Smackover Lithium project located in southern Arkansas.\n\nStandard Lithium just reported a combined Arkansas lithium brine resource of 3,888,000 tonnes LCE. Robert Mintak, CEO said, “This combined project in Southern Arkansas positions us as the largest lithium brine resource in the US; a significantly expanding market that currently relies on imports of foreign lithium.”\n\nThe Company announced January 9th that it produced its first quantity of battery quality (>99.56% purity) lithium carbonate due to its AI-powered continuous crystallization technology.  Its breakthrough rapid lithium extraction process reduces the recovery time of extracting lithium from brine from the current industry method that takes years, to as little as a few hours.\n\nStandard Lithium’s recovery time may give them an edge on even some of the leaders, like Albemarle Corporation (NYSE:ALB), based in Charlotte, NC. Albemarle says in its presentation, “Obtaining capabilities to bring lithium from mine to market takes time.”\n\nHow important is lithium to the US economy?  Just recently, Energy Secretary Rick Perry launched a recycling initiative to recover the critical elements in lithium-ion batteries, calling it \"a matter of national security.\"\n\n\"We aim to reduce our dependence on foreign sources of this material by encouraging entrepreneurs to capture up to 90% of America's lithium-based battery technology,\" Perry said.\n\nThey also note, ”The lithium industry is still maturing from a technical and commercial perspective and does not behave like a commodity industry.”\n\nExamples of advanced lithium materials from Albemarle include: patented lithium-based materials to enable long cycle life; Li2S – a key ingredient in next frontier solid separators; and lithium metal foils for next frontier anodes.\n\nAlbemarle says it is their goal to provide material to this industry to support and increase the success of lithium-ion technology, not only in mobile communication and power tool (PWT) applications, but also in electric mobility.\n\nLooking to the future, Albemarle also states, “the next generation of lithium batteries is on the horizon already.”\n\nAnd the next generation of investors is betting on this sustainable technology. According to TD Ameritrade, looking at trading purchases over the last few months, Millennials bought Tesla (Nasdaq:TSLA), while the total population did not.\n\nSo the race is on; Simon Moores of Benchmark Minerals tweeted, “We are in the midst of a global battery arms race in which the US is a bystander. Since my last testimony only 14 months ago we have gone from 17 to 70 lithium ion battery megafactories in the pipeline.”\n\nCompanies like Standard Lithium (TSXV: SLL) (OTCQB: STLHF) are ready for the challenge to meet the demands of the future and keep the US in the race.\n\nFor investors covering the sector, Investor Ideas has created a directory of cleantech and renewable energy stocks including a lithium stock directory.\n\nAbout Investorideas.com \r\nhttps:\/\/www.investorideas.com\/About\/\n\nSocial Media \r\nFollow us on Twitter https:\/\/twitter.com\/Investorideas\r\nFollow us on Facebook https:\/\/www.facebook.com\/Investorideas\r\nFollow us on YouTube https:\/\/www.youtube.com\/c\/Investorideas\n\nDisclaimer\/Disclosure: Investorideas.com: Our site does not make recommendations for purchases or sale of stocks, services or products. Nothing on our sites should be construed as an offer or solicitation to buy or sell products or securities. All investment involves risk and possible loss of investment. This site is currently compensated for news publication and distribution, social media and marketing, content creation and more. Contact each company directly regarding content and press release questions. Disclosure is posted for each compensated news release, content published \/created if required but otherwise the news was not compensated for and was published for the sole interest of our readers and followers. More disclaimer info: https:\/\/www.investorideas.com\/About\/Disclaimer.asp. Disclosure: this article featuring Standard Lithium is a paid for service on Investorideas.com – third party. Learn more about costs and our services https:\/\/www.investorideas.com\/News-Upload\/\n\nAdditional info regarding BC Residents and global Investors:: https:\/\/www.bcsc.bc.ca\/release.aspx?id=6894. \r\nInvestorideas.com privacy policy: https:\/\/www.investorideas.com\/About\/Private_Policy.asp\n\nContact Investorideas.com \r\n800-665-0411","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/02\/06\/1711361\/0\/en\/The-Battery-Race-in-the-US-and-How-Lithium-Plays-a-Leading-Role.html","symbols":["ALB.US","MXWL.US","TSLA.US"],"tags":["INVESTORIDEAS.COM"],"sentiment":{"polarity":0.993,"neg":0.011,"neu":0.903,"pos":0.086}},{"date":"2019-02-01T13:00:00+00:00","title":"Advanced Technology for Rapid Extraction Will Be Key to Meeting Future Lithium Demand","content":"POINT ROBERTS, Wash. and DELTA, British Columbia, Feb.  01, 2019  (GLOBE NEWSWIRE) -- Investorideas.com, a leading investor news resource covering AI and lithium stocks issues a snapshot looking at lithium companies preparing to meet future demands in the market and how technology innovation may play a lead role.\n\nThe future of lithium shows a high demand, though there is uncertainty surrounding whether the market will be able to keep up with extraction demands.\n\nLooking at how this all plays out, Albemarle Corporation (NYSE:ALB) and Chile state development agency Corfo recently reached a deal to resolve a contract dispute centered around an amendment to the contract that requires Albemarle to provide as much as 25 percent of its annual production of lithium at a discount to companies seeking to produce battery metals within Chile.\n\nAlbemarle operates in Chile's Salar de Atacama, a salt flat in the country´s northern desert that supplies nearly 40 percent of the world´s lithium. Corfo, which leases mining rights in the Salar, had previously threatened to cancel its contract with Albemarle over the dispute, raising the spectre of potential supply disruptions amid booming demand.\n\nThe contract amendment that requires Albemarle to provide the ultralight battery metal at a reduced price is meant to spur a value-added lithium industry in Chile.\n\nAlbemarle produces most of its lithium from evaporation ponds. In November of 2018, the company’s claim to developing a unique process to more than triple its lithium production from Chile’s Atacama desert without using more water drew heavy scrutiny. Inside the US, Albemarle has already hinted at the potential of producing lithium to business owners operating near their Magnolia Arkansas operations, which is located nearby to Standard Lithium’s potential commercial lithium project.\n\nConflicting reports regarding Warren Buffett’s Berkshire Hathaway’s recent alleged interest in new US-based lithium extraction technologies has shone a spotlight on a rising need for innovation. Beyond Buffett’s group, there has already been a push from the lithium sector to innovate. Despite lingering doubts about the feasibility of the Berkshire Hathaway project to produce lithium from California geothermal wells, other projects are priming for lithium production from US brines.\n\nUnderstanding the need to innovate is Standard Lithium (TSX.V:SLL) (OTC:STLHF).Based in Southern Arkansas, with a planned joint venture involving a multi-billion-dollar global specialty chemical company, they are using innovative proprietary AI-powered rapid extraction technologies. This new high-tech approach may improve chances for success in this sector.\n\nAs international interests such as Germany and China jostle for position in other places like South America, securing North American lithium deposits is highly sought after domestically. The economic impact could be massive, as Chilean exports alone rose to $949 million in 2018.\n\nThrough its German partners, global chemical giant LANXESS and Standard Lithium have secured access to billions of gallons of lithium-rich brine; produced annually as a by-product of one of the world’s largest bromine producers every year at their flagship project in Southern Arkansas.\n\nStandard Lithium Ltd. (TSX.V:SLL) (OTC:STLHF) has the infrastructure and investment potential in place to move forward on a massive operating commercial brine-fueled lithium project in the USA. Should the next stages of the pilot and commercial feasibility testing be a success, LANXESS has announced a financial commitment to push the project into production.\n\nLivent Corporation (NYSE:LTHM), focused on South America as well as Australia, calls itself “a world leader in lithium technology.” The company also holds 50 product patents.\n\nThey also state, “Our control over the entire lithium operations chain-from pumping brine out of the ground to processing it into a range of performance products-enables us to lead the industry in lithium technology.”\n\nWhen discussing the lithium market in an interview, CEO Paul Graves said, “We think demand is going to grow almost five times larger in 2025 than it was in 2017. Our biggest challenge is producing enough to meet the demand - there’s a much greater risk that this market is consistently in a deficit in the near future.”\n\nOther companies like Nemaska Lithium Inc. (TSX:NMX) (OTC:NMKEF), forecasted to be North America’s next big lithium producer, is in the construction stage on its Whabouchi mine in the James Bay region of Quebec, Canada. According to the company’s feasibility study, the capex on the project is set at approximately $875 million, of which Nemaska has already spent $272.4 million.\n\nNemaska Lithium has developed proprietary processes that use electrolysis to produce high-purity lithium hydroxide and lithium carbonate for the lithium battery market. The technology virtually eliminates costly soda ash from the process.\n\nThe race to innovate in the lithium sector is on. According to Transparency Market Research,  “Key players are focused on the innovation of new technologies in order to gain market share and serve a diverse range of end-user industries.”\n\nAbout Investorideas.com \r\nhttps:\/\/www.investorideas.com\/About\/\n\nSocial Media \r\nFollow us on Twitter https:\/\/twitter.com\/Investorideas\r\nFollow us on Facebook https:\/\/www.facebook.com\/Investorideas\r\nFollow us on YouTube https:\/\/www.youtube.com\/c\/Investorideas\n\nDisclaimer\/Disclosure: Investorideas.com: Our site does not make recommendations for purchases or sale of stocks, services or products. Nothing on our sites should be construed as an offer or solicitation to buy or sell products or securities. All investment involves risk and possible loss of investment. This site is currently compensated for news publication and distribution, social media and marketing, content creation and more. Contact each company directly regarding content and press release questions. Disclosure is posted for each compensated news release, content published \/created if required but otherwise the news was not compensated for and was published for the sole interest of our readers and followers. More disclaimer info: https:\/\/www.investorideas.com\/About\/Disclaimer.asp. Disclosure: this article featuring Standard Lithium is a paid for service on Investorideas.com – third party. Learn more about costs and our  services https:\/\/www.investorideas.com\/News-Upload\/\n\nAdditional info regarding BC Residents and global Investors:: https:\/\/www.bcsc.bc.ca\/release.aspx?id=6894. \r\nInvestorideas.com privacy policy: https:\/\/www.investorideas.com\/About\/Private_Policy.asp\n\nContact Investorideas.com \r\n800-665-0411","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/02\/01\/1709151\/0\/en\/Advanced-Technology-for-Rapid-Extraction-Will-Be-Key-to-Meeting-Future-Lithium-Demand.html","symbols":["ALB.US","LTHM.US","NMX.TO"],"tags":["INVESTORIDEAS.COM"],"sentiment":{"polarity":0.981,"neg":0.029,"neu":0.904,"pos":0.067}},{"date":"2018-11-30T12:20:00+00:00","title":"Report: Developing Opportunities within Unifirst, Royal Caribbean Cruises, Albemarle, Tableau Software, Huami, and Johnson & Johnson — Future Expectations, Projections Moving into 2018","content":"NEW YORK, Nov.  30, 2018  (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Fundamental Markets released its latest key findings for all current investors, traders, and shareholders of Unifirst Corporation (NYSE:UNF), Royal Caribbean Cruises Ltd. (NYSE:RCL), Albemarle Corporation (NYSE:ALB), Tableau Software, Inc. (NYSE:DATA), Huami Corporation (NYSE:HMI), and Johnson & Johnson (NYSE:JNJ), including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.\n\nComplimentary Access: Research Reports\n\nFull copies of recently published reports are available to readers at the links below.\n\nUNF DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=UNF\r\n RCL DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=RCL\r\n ALB DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\r\n DATA DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=DATA\r\n HMI DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=HMI\r\n JNJ DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=JNJ\n\n(You may have to copy and paste the link into your browser and hit the [ENTER] key)\n\nThe new research reports from Fundamental Markets, available for free download at the links above, examine Unifirst Corporation (NYSE:UNF), Royal Caribbean Cruises Ltd. (NYSE:RCL), Albemarle Corporation (NYSE:ALB), Tableau Software, Inc. (NYSE:DATA), Huami Corporation (NYSE:HMI), and Johnson & Johnson (NYSE:JNJ) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today's readers below.\n\n-----------------------------------------\n\nImportant Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. All information in this release was accessed November 28th, 2018. Percentage calculations are performed after rounding. All amounts in millions (MM), except per share amounts.\n\n-----------------------------------------\n\nUNIFIRST CORPORATION (UNF) REPORT OVERVIEW\n\nUnifirst's Recent Financial Performance\n\nFor the three months ended August 31st, 2018 vs August 31st, 2017, Unifirst reported revenue of $434.06MM vs $403.59MM (up 7.55%) and analysts estimated basic earnings per share $1.84 vs -$0.25. For the twelve months ended August 31st, 2018 vs August 31st, 2017, Unifirst reported revenue of $1,696.49MM vs $1,590.96MM (up 6.63%) and analysts estimated basic earnings per share $8.27 vs $3.48 (up 137.64%). Analysts expect earnings to be released on January 2nd, 2019. The report will be for the fiscal period ending November 30th, 2018. The reported EPS for the same quarter last year was $1.60. The estimated EPS forecast for the next fiscal year is $7.47 and is expected to report on October 16th, 2019.\n\nTo read the full Unifirst Corporation (UNF) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=UNF\n\n-----------------------------------------\n\nROYAL CARIBBEAN CRUISES LTD. (RCL) REPORT OVERVIEW\n\nRoyal Caribbean Cruises' Recent Financial Performance\n\nFor the three months ended September 30th, 2018 vs September 30th, 2017, Royal Caribbean Cruises reported revenue of $2,796.19MM vs $2,569.54MM (up 8.82%) and analysts estimated basic earnings per share $3.88 vs $3.51 (up 10.54%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Royal Caribbean Cruises reported revenue of $8,777.85MM vs $8,496.40MM (up 3.31%) and analysts estimated basic earnings per share $7.57 vs $5.96 (up 27.01%). Analysts expect earnings to be released on January 23rd, 2019. The report will be for the fiscal period ending December 31st, 2018. Reported EPS for the same quarter last year was $1.34. The estimated EPS forecast for the next fiscal year is $9.85 and is expected to report on January 23rd, 2019.\n\nTo read the full Royal Caribbean Cruises Ltd. (RCL) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=RCL\n\n-----------------------------------------\n\nALBEMARLE CORPORATION (ALB) REPORT OVERVIEW\n\nAlbemarle's Recent Financial Performance\n\nFor the three months ended September 30th, 2018 vs September 30th, 2017, Albemarle reported revenue of $777.75MM vs $754.87MM (up 3.03%) and analysts estimated basic earnings per share $1.21 vs $1.07 (up 13.08%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Albemarle reported revenue of $3,071.98MM vs $2,677.20MM (up 14.75%) and analysts estimated basic earnings per share $0.49 vs $5.73 (down 91.45%). Analysts expect earnings to be released on February 26th, 2019. The report will be for the fiscal period ending December 31st, 2018. Reported EPS for the same quarter last year was $1.34. The estimated EPS forecast for the next fiscal year is $6.11 and is expected to report on February 26th, 2019.\n\nTo read the full Albemarle Corporation (ALB) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\n\n-----------------------------------------\n\nTABLEAU SOFTWARE, INC. (DATA) REPORT OVERVIEW\n\nTableau Software's Recent Financial Performance\n\nFor the three months ended September 30th, 2018 vs September 30th, 2017, Tableau Software reported revenue of $290.58MM vs $214.92MM (up 35.21%) and basic earnings per share -$0.26 vs -$0.59. For the twelve months ended December 31st, 2017 vs December 31st, 2016, Tableau Software reported revenue of $877.06MM vs $826.94MM (up 6.06%) and analysts estimated basic earnings per share -$2.35 vs -$1.92. Analysts expect earnings to be released on February 7th, 2019. The report will be for the fiscal period ending December 31st, 2018. The reported EPS for the same quarter last year was -$0.52. The estimated EPS forecast for the next fiscal year is -$1.18 and is expected to report on February 7th, 2019.\n\nTo read the full Tableau Software, Inc. (DATA) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=DATA\n\n-----------------------------------------\n\nHUAMI CORPORATION (HMI) REPORT OVERVIEW\n\nHuami's Recent Financial Performance\n\nFor the twelve months ended December 31st, 2017 vs December 31st, 2016, Huami reported revenue of $314.91MM vs $233.94MM (up 34.61%) and analysts estimated basic earnings per share $0.40 vs -$0.12. Analysts expect earnings to be released on March 25th, 2019. The report will be for the fiscal period ending December 31st, 2018.\n\nTo read the full Huami Corporation (HMI) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=HMI\n\n-----------------------------------------\n\nJOHNSON & JOHNSON (JNJ) REPORT OVERVIEW\n\nJohnson & Johnson's Recent Financial Performance\n\nFor the three months ended September 30th, 2018 vs September 30th, 2017, Johnson & Johnson reported revenue of $20,348.00MM vs $19,650.00MM (up 3.55%) and analysts estimated basic earnings per share $1.47 vs $1.40 (up 5.00%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Johnson & Johnson reported revenue of $76,450.00MM vs $71,890.00MM (up 6.34%) and analysts estimated basic earnings per share $0.48 vs $6.04 (down 92.05%). Analysts expect earnings to be released on January 22nd, 2019. The report will be for the fiscal period ending December 31st, 2018. Based on 8 analysts' forecasts, the consensus EPS forecast for the quarter is $2.03. The reported EPS for the same quarter last year was $1.74. The estimated EPS forecast for the next fiscal year is $8.66 and is expected to report on January 22nd, 2019.\n\nTo read the full Johnson & Johnson (JNJ) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=JNJ\n\n-----------------------------------------\n\nABOUT FUNDAMENTAL MARKETS\n\nFundamental Markets serves thousands of members and have provided research through some of the world's leading brokerages for over a decade–and continue to be one of the best information sources for investors and investment professionals worldwide. Fundamental Markets' roster boasts decades of financial experience and includes top financial writers, FINRA® BrokerCheck® certified professionals with current and valid CRD® number designations, as well as Chartered Financial Analyst® (CFA®) designation holders, to ensure up to date factual information for active readers on the topics they care about.\n\nREGISTERED MEMBER STATUS\n\nFundamental Markets' oversight and audit staff are registered analysts, brokers, and\/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Fundamental Markets' roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Fundamental Markets have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Fundamental Markets' Compliance department by Phone, at +1 667-401-0010, or by E-mail at compliance@Fundamental-Markets.com.\n\nLEGAL NOTICES\n\nInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Fundamental Markets, Fundamental Markets members, and\/or Fundamental Markets affiliates are not responsible for any gains or losses that result from the opinions expressed. Fundamental Markets makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Fundamental Markets has not been compensated for the publication of this press release by any of the above mentioned companies. Fundamental Markets is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.\n\nMedia Contact:\r\n Andrew Duffie, Media Department\r\n Office: +1 667-401-0010\r\n E-mail: media@Fundamental-Markets.com\n\n© 2018 Fundamental Markets. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@Fundamental-Markets.com.\n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n\nFINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.","link":"https:\/\/www.globenewswire.com\/news-release\/2018\/11\/30\/1659947\/0\/en\/Report-Developing-Opportunities-within-Unifirst-Royal-Caribbean-Cruises-Albemarle-Tableau-Software-Huami-and-Johnson-Johnson-Future-Expectations-Projections-Moving-into-2018.html","symbols":["ALB.US","DATA.US","HMI.US","JNJ.US","RCL.US","UNF.US"],"tags":["FUNDAMENTAL MARKETS"],"sentiment":{"polarity":0.995,"neg":0.009,"neu":0.939,"pos":0.053}},{"date":"2018-10-30T12:30:00+00:00","title":"Cameo Cobalt Completes Successful Chilean Site Visits","content":"VANCOUVER, British Columbia, Oct.  30, 2018  (GLOBE NEWSWIRE) -- Cameo Cobalt Corp. (TSX Venture: CRU) (OTC: CRUUF) (FWB: SY7N) (the “Company” or “Cameo Cobalt”) is pleased to announce that further to its news release dated October 4, 2018, the Company has completed site visits (the “site visits\") to its Carrizal and Montreal Cobalt projects. Site visits attendees included Cameo Cobalt’s Chilean geological team, Ridgeline Exploration Services (“Ridgeline”), as well as certain advisors and consultants of the Company.\n\nSuccessful completion of the site visits allows Cameo Cobalt to prioritize its Chilean cobalt assets, as well as expedite the planning of the upcoming exploration roadmap. In addition to the successful site visit, the Company secured meetings with key officials from the Chilean Ministry of Mines, as well as John Mitchell, President of Genlith Inc. (“Genlith”). Genlith is a Pennsylvania-based holding company focused on energy storage and critical battery materials. Cameo Cobalt regards Genlith as its regional peer within the Chilean battery metals exploration arena.\n\nDuring the site visits the Company concluded a comprehensive review of the Carrizal and Montreal projects; including preliminary geological investigations and rock sampling on both properties. Rock samples have been sent to MS Analytical Laboratories in Vancouver, BC, for assays. The Company expects to receive assay results in the coming weeks and will provide the market with an update in due course. High-resolution photos from the site visits will be available on the company web site in the coming weeks (https:\/\/cameocobalt.com\/). \r\n\r\n Cameo Cobalt is extremely encouraged following its initial site visits; bolstered by strong support from the Chilean Ministry of Mines pertaining to the development of the Company’s flagship energy metals assets. The Company is currently collaborating with Ridgeline, as well as its Chilean geological team to formulate a detailed year-round exploration program focusing on its Carrizal and Montreal Cobalt projects.\n\nAkash Patel, CEO of Cameo Cobalt stated: “The Company continues to remain bullish on the macro outlook for battery metal exploration. Cameo Cobalt believes that recent trends remain intact and are reinforced as global cobalt supply continues to be constrained. The majority of the World’s cobalt supply is produced in the Democratic Republic of the Congo, a jurisdiction where human rights issues continue to be a concern. The Company’s ultimate objective is to develop a portfolio of projects located in safe, ethical jurisdictions which can help to meet demand from the nascent EV revolution.”\n\nCarrizal Cobalt Project\n\nThe Company’s Carrizal Cobalt Project is situated adjacent to Genlith Inc.'s Carrizal Alto Project (see Genlith's news release dated April 11th). Genlith Inc. is a Pennsylvania-based holding company focused on energy storage and critical battery materials.\n\nGenlith has reported that cobalt production occurred on its Carrizal Alto projects from 1844 through 1944, mostly for military applications ceasing at the end of the Second World War. Genlith’s Carrizal Alto development plans include expedited drilling and dimensioning programs on high-grade past producing mines with the objective of providing a clear path to full-scale production.\n\nThe Company’s Carrizal Cobalt claims map can be found by following the below URL link:\n\nhttps:\/\/cameocobalt.com\/wp-content\/uploads\/2018\/09\/CRU-Carrizal-Map.pdf\n\nGenlith Inc. also recently announced the appointment of John Mitchell as the company’s new President. Mr. Mitchell will also assume the role of Chief Executive Officer of Chilean Cobalt Corp. (“C3”), a subsidiary of Genlith. Mr. Mitchell joins Genlith after serving as President of Lithium for Albemarle Corporation (NYSE: ALB). Mr. Mitchell guided Albemarle’s lithium division to a global market leading position (see Genlith’s news release dated July 25th, 2018).\n\nAbout the Montreal Cobalt Project\n\nThe Vendor reports that the Montreal Cobalt Project consists of 16 mineral claims and comprises a total of 4,500 hectares. The Company’s Montreal Cobalt Project is less than 2 kilometres away from the past producing Merceditas mine. The acquisition of the Montreal Cobalt Project has entrenched Cameo Cobalt in two of the three historic cobalt-producing regions of Chile.\n\nThe Montreal Cobalt Project claims map can be found by following the below URL link:\n\nhttps:\/\/cameocobalt.com\/wp-content\/uploads\/2018\/09\/CRU-Montreal-Map-.pdf\n\nCAMEO COBALT CORP.\r\n“Akash Patel”\n\nFor more information contact:\r\n(778) 549-6714\n\nOr Email: lucasbirdsall@gmail.com\r\nwww.cameocobalt.com\n\nReader Advisory This news release contains certain “forward-looking information” within the meaning of applicable securities law. Forward-looking information is frequently characterized by words such as “plan”, “expect”, “project”, “intend”, “believe”, “anticipate”, “estimate” and other similar words, or statements that certain events or conditions “may” or “will” occur. In particular, forward-looking information in this press release includes, but is not limited to, statements with respect to the Company’s proposed acquisition, exploration program and the expectations for the cobalt industry. Although we believe that the expectations reflected in the forward-looking information are reasonable, there can be no assurance that such expectations will prove to be correct. We cannot guarantee future results, performance or achievements. Consequently, there is no representation that the actual results achieved will be the same, in whole or in part, as those set out in the forward-looking information.\n\nForward-looking information is based on the opinions and estimates of management at the date the statements are made, and are subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those anticipated in the forward-looking information. Some of the risks and other factors that could cause the results to differ materially from those expressed in the forward-looking information include, but are not limited to: general economic conditions in Canada and globally; industry conditions, including governmental regulation and environmental regulation; failure to obtain industry partner and other third party consents and approvals, if and when required; the availability of capital on acceptable terms; the need to obtain required approvals from regulatory authorities; stock market volatility; liabilities inherent in water disposal facility operations; competition for, among other things, skilled personnel and supplies; incorrect assessments of the value of acquisitions; geological, technical, processing and transportation problems; changes in tax laws and incentive programs; failure to realize the anticipated benefits of acquisitions and dispositions; and the other factors. Readers are cautioned that this list of risk factors should not be construed as exhaustive.\n\nThe forward-looking information contained in this news release is expressly qualified by this cautionary statement. We undertake no duty to update any of the forward-looking information to conform such information to actual results or to changes in our expectations except as otherwise required by applicable securities legislation. Readers are cautioned not to place undue reliance on forward-looking information.\n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.","link":"https:\/\/www.globenewswire.com\/news-release\/2018\/10\/30\/1639096\/0\/en\/Cameo-Cobalt-Completes-Successful-Chilean-Site-Visits.html","symbols":["ALB.US","CRU.V","CRUUF.US","SY7N-F.F"],"tags":["CAMEO RESOURCES","OTHER OTC:CRUUF"],"sentiment":{"polarity":0.983,"neg":0.037,"neu":0.881,"pos":0.081}},{"date":"2018-10-22T11:30:00+00:00","title":"Market Trends Toward New Normal in CryoPort, The J. M. Smucker, Accenture, Albemarle, The Allstate, and Huami — Emerging Consolidated Expectations, Analyst Ratings","content":"NEW YORK, Oct.  22, 2018  (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Fundamental Markets released its latest key findings for all current investors, traders, and shareholders of CryoPort, Inc. (NASDAQ:CYRX), The J. M. Smucker Company (NYSE:SJM), Accenture PLC (NYSE:ACN), Albemarle Corporation (NYSE:ALB), The Allstate Corporation (NYSE:ALL), and Huami Corporation (NYSE:HMI), including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.\n\nComplimentary Access: Research Reports\n\nFull copies of recently published reports are available to readers at the links below.\n\nCYRX DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=CYRX\r\n SJM DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=SJM\r\n ACN DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ACN\r\n ALB DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\r\n ALL DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ALL\r\n HMI DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=HMI\n\n(You may have to copy and paste the link into your browser and hit the [ENTER] key)\n\nThe new research reports from Fundamental Markets, available for free download at the links above, examine CryoPort, Inc. (NASDAQ:CYRX), The J. M. Smucker Company (NYSE:SJM), Accenture PLC (NYSE:ACN), Albemarle Corporation (NYSE:ALB), The Allstate Corporation (NYSE:ALL), and Huami Corporation (NYSE:HMI) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today's readers below.\n\n-----------------------------------------\n\nImportant Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. All information in this release was accessed October 18th, 2018. Percentage calculations are performed after rounding. All amounts in millions (MM), except per share amounts.\n\n-----------------------------------------\n\nCRYOPORT, INC. (CYRX) REPORT OVERVIEW\n\nCryoPort's Recent Financial Performance\n\nFor the three months ended June 30th, 2018 vs June 30th, 2017, CryoPort reported revenue of $4.63MM vs $2.92MM (up 58.60%) and analysts estimated basic earnings per share -$0.09 vs -$0.08. For the twelve months ended December 31st, 2017 vs December 31st, 2016, CryoPort reported revenue of $11.95MM vs $7.68MM (up 55.68%) and analysts estimated basic earnings per share -$0.34 vs -$0.93. Analysts expect earnings to be released on November 7th, 2018. The report will be for the fiscal period ending September 30th, 2018. The reported EPS for the same quarter last year was -$0.08. The estimated EPS forecast for the next fiscal year is -$0.13 and is expected to report on March 5th, 2019.\n\nTo read the full CryoPort, Inc. (CYRX) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=CYRX\n\n-----------------------------------------\n\nTHE J. M. SMUCKER COMPANY (SJM) REPORT OVERVIEW\n\nThe J. M. Smucker's Recent Financial Performance\n\nFor the three months ended July 31st, 2018 vs July 31st, 2017, The J. M. Smucker reported revenue of $1,902.50MM vs $1,748.90MM (up 8.78%) and analysts estimated basic earnings per share $1.17 vs $1.12 (up 4.46%). For the twelve months ended April 30th, 2018 vs April 30th, 2017, The J. M. Smucker reported revenue of $7,357.10MM vs $7,392.30MM (down 0.48%) and analysts estimated basic earnings per share $11.79 vs $5.11 (up 130.72%). Analysts expect earnings to be released on November 15th, 2018. The report will be for the fiscal period ending October 31st, 2018. Reported EPS for the same quarter last year was $2.02. The estimated EPS forecast for the next fiscal year is $8.60 and is expected to report on June 6th, 2019.\n\nTo read the full The J. M. Smucker Company (SJM) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=SJM\n\n-----------------------------------------\n\nACCENTURE PLC (ACN) REPORT OVERVIEW\n\nAccenture's Recent Financial Performance\n\nFor the three months ended August 31st, 2018 vs August 31st, 2017, Accenture reported revenue of $10,642.25MM vs $9,640.91MM (up 10.39%) and analysts estimated basic earnings per share $1.61 vs $1.51 (up 6.62%). For the twelve months ended August 31st, 2018 vs August 31st, 2017, Accenture reported revenue of $41,603.43MM vs $36,765.48MM (up 13.16%) and analysts estimated basic earnings per share $6.46 vs $5.56 (up 16.19%). Analysts expect earnings to be released on December 20th, 2018. The report will be for the fiscal period ending November 30th, 2018. Reported EPS for the same quarter last year was $1.79. The estimated EPS forecast for the next fiscal year is $7.90 and is expected to report on September 26th, 2019.\n\nTo read the full Accenture PLC (ACN) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ACN\n\n-----------------------------------------\n\nALBEMARLE CORPORATION (ALB) REPORT OVERVIEW\n\nAlbemarle's Recent Financial Performance\n\nFor the three months ended June 30th, 2018 vs June 30th, 2017, Albemarle reported revenue of $853.87MM vs $737.26MM (up 15.82%) and basic earnings per share $2.76 vs $0.93 (up 196.77%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Albemarle reported revenue of $3,071.98MM vs $2,677.20MM (up 14.75%) and analysts estimated basic earnings per share $0.49 vs $5.73 (down 91.45%). Analysts expect earnings to be released on November 7th, 2018. The report will be for the fiscal period ending September 30th, 2018. The reported EPS for the same quarter last year was $1.08. The estimated EPS forecast for the next fiscal year is $6.10 and is expected to report on February 26th, 2019.\n\nTo read the full Albemarle Corporation (ALB) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\n\n-----------------------------------------\n\nTHE ALLSTATE CORPORATION (ALL) REPORT OVERVIEW\n\nThe Allstate's Recent Financial Performance\n\nFor the three months ended June 30th, 2018 vs June 30th, 2017, The Allstate reported revenue of $10,099.00MM vs $9,813.00MM (up 2.91%) and analysts estimated basic earnings per share $1.82 vs $1.51 (up 20.53%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, The Allstate reported revenue of $38,524.00MM vs $36,534.00MM (up 5.45%) and analysts estimated basic earnings per share $8.49 vs $4.72 (up 79.87%). Analysts expect earnings to be released on October 31st, 2018. The report will be for the fiscal period ending September 30th, 2018. The reported EPS for the same quarter last year was $1.60. The estimated EPS forecast for the next fiscal year is $9.22 and is expected to report on February 6th, 2019.\n\nTo read the full The Allstate Corporation (ALL) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ALL\n\n-----------------------------------------\n\nHUAMI CORPORATION (HMI) REPORT OVERVIEW\n\nHuami's Recent Financial Performance\n\nFor the twelve months ended December 31st, 2017 vs December 31st, 2016, Huami reported revenue of $314.91MM vs $233.94MM (up 34.61%) and analysts estimated basic earnings per share $0.40 vs -$0.12. Analysts expect earnings to be released on November 19th, 2018. The report will be for the fiscal period ending September 30th, 2018.\n\nTo read the full Huami Corporation (HMI) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=HMI\n\n-----------------------------------------\n\nABOUT FUNDAMENTAL MARKETS\n\nFundamental Markets serves thousands of members and have provided research through some of the world's leading brokerages for over a decade–and continue to be one of the best information sources for investors and investment professionals worldwide. Fundamental Markets' roster boasts decades of financial experience and includes top financial writers, FINRA® BrokerCheck® certified professionals with current and valid CRD® number designations, as well as Chartered Financial Analyst® (CFA®) designation holders, to ensure up to date factual information for active readers on the topics they care about.\n\nREGISTERED MEMBER STATUS\n\nFundamental Markets' oversight and audit staff are registered analysts, brokers, and\/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Fundamental Markets' roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Fundamental Markets have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Fundamental Markets' Compliance department by Phone, at +1 667-401-0010, or by E-mail at compliance@Fundamental-Markets.com.\n\nLEGAL NOTICES\n\nInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Fundamental Markets, Fundamental Markets members, and\/or Fundamental Markets affiliates are not responsible for any gains or losses that result from the opinions expressed. Fundamental Markets makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Fundamental Markets has not been compensated for the publication of this press release by any of the above mentioned companies. Fundamental Markets is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.\n\nMedia Contact:\r\n Andrew Duffie, Media Department\r\n Office: +1 667-401-0010\r\n E-mail: media@Fundamental-Markets.com\n\n© 2018 Fundamental Markets. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@Fundamental-Markets.com.\n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n\nFINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.","link":"https:\/\/www.globenewswire.com\/news-release\/2018\/10\/22\/1624605\/0\/en\/Market-Trends-Toward-New-Normal-in-CryoPort-The-J-M-Smucker-Accenture-Albemarle-The-Allstate-and-Huami-Emerging-Consolidated-Expectations-Analyst-Ratings.html","symbols":["ACN.US","ALB.US","ALL.US","CYRX.US","HMI.US","SJM.US"],"tags":["FUNDAMENTAL MARKETS"],"sentiment":{"polarity":0.995,"neg":0.009,"neu":0.939,"pos":0.053}},{"date":"2018-06-13T11:50:00+00:00","title":"Detailed Research: Economic Perspectives on Och-Ziff Capital Management Group, Axalta Coating, Trinity Industries, Match Group, Eversource Energy, and Albemarle — What Drives Growth in Today's Competitive Landscape","content":"NEW YORK, June  13, 2018  (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Fundamental Markets released its latest key findings for all current investors, traders, and shareholders of Och-Ziff Capital Management Group LLC (NYSE:OZM), Axalta Coating Systems Ltd. (NYSE:AXTA), Trinity Industries, Inc. (NYSE:TRN), Match Group, Inc. (NASDAQ:MTCH), Eversource Energy (NYSE:ES), and Albemarle Corporation (NYSE:ALB), including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.\n\nComplimentary Access: Research Reports\n\nFull copies of recently published reports are available to readers at the links below.\n\nOZM DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=OZM AXTA DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=AXTA TRN DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=TRN MTCH DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=MTCH ES DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ES ALB DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\n\n(You may have to copy and paste the link into your browser and hit the [ENTER] key)\n\nThe new research reports from Fundamental Markets, available for free download at the links above, examine Och-Ziff Capital Management Group LLC (NYSE:OZM), Axalta Coating Systems Ltd. (NYSE:AXTA), Trinity Industries, Inc. (NYSE:TRN), Match Group, Inc. (NASDAQ:MTCH), Eversource Energy (NYSE:ES), and Albemarle Corporation (NYSE:ALB) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today's readers below.\n\n-----------------------------------------\n\nImportant Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. All information in this release was accessed June 11th, 2018. Percentage calculations are performed after rounding. All amounts in millions (MM), except per share amounts.\n\n-----------------------------------------\n\nOCH-ZIFF CAPITAL MANAGEMENT GROUP LLC (OZM) REPORT OVERVIEW\n\nOch-Ziff Capital Management Group's Recent Financial Performance\n\nFor the three months ended March 31st, 2018 vs March 31st, 2017, Och-Ziff Capital Management Group reported revenue of $128.41MM vs $139.15MM (down 7.72%) and basic earnings per share $0.02 vs -$0.04. For the twelve months ended December 31st, 2017 vs December 31st, 2016, Och-Ziff Capital Management Group reported revenue of $858.34MM vs $770.36MM (up 11.42%) and basic earnings per share $0.10 vs -$0.72. Och-Ziff Capital Management Group is expected to report earnings on August 1st, 2018. The report will be for the fiscal period ending June 30th, 2018. The reported EPS for the same quarter last year was $0.10. The estimated EPS forecast for the next fiscal year is $0.42 and is expected to report on February 15th, 2019.\n\nTo read the full Och-Ziff Capital Management Group LLC (OZM) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=OZM\n\n-----------------------------------------\n\nAXALTA COATING SYSTEMS LTD. (AXTA) REPORT OVERVIEW\n\nAxalta Coating's Recent Financial Performance\n\nFor the three months ended March 31st, 2018 vs March 31st, 2017, Axalta Coating reported revenue of $1,172.00MM vs $1,013.70MM (up 15.62%) and basic earnings per share $0.29 vs $0.27 (up 7.41%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Axalta Coating reported revenue of $4,377.00MM vs $4,092.70MM (up 6.95%) and basic earnings per share $0.15 vs $0.16 (down 6.25%). Axalta Coating is expected to report earnings on August 2nd, 2018. The report will be for the fiscal period ending June 30th, 2018. The reported EPS for the same quarter last year was $0.31. The estimated EPS forecast for the next fiscal year is $1.51 and is expected to report on February 5th, 2019.\n\nTo read the full Axalta Coating Systems Ltd. (AXTA) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=AXTA\n\n-----------------------------------------\n\nTRINITY INDUSTRIES, INC. (TRN) REPORT OVERVIEW\n\nTrinity Industries' Recent Financial Performance\n\nFor the three months ended March 31st, 2018 vs March 31st, 2017, Trinity Industries reported revenue of $831.30MM vs $877.30MM (down 5.24%) and basic earnings per share $0.27 vs $0.30 (down 10.00%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Trinity Industries reported revenue of $3,662.80MM vs $4,588.30MM (down 20.17%) and basic earnings per share $4.62 vs $2.25 (up 105.33%). Trinity Industries is expected to report earnings on July 24th, 2018. The report will be for the fiscal period ending June 30th, 2018. The reported EPS for the same quarter last year was $0.33. The estimated EPS forecast for the next fiscal year is $1.70 and is expected to report on February 20th, 2019.\n\nTo read the full Trinity Industries, Inc. (TRN) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=TRN\n\n-----------------------------------------\n\nMATCH GROUP, INC. (MTCH) REPORT OVERVIEW\n\nMatch Group's Recent Financial Performance\n\nFor the three months ended March 31st, 2018 vs March 31st, 2017, Match Group reported revenue of $407.37MM vs $298.76MM (up 36.35%) and basic earnings per share $0.36 vs $0.10 (up 260.00%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Match Group reported revenue of $1,330.66MM vs $1,118.11MM (up 19.01%) and basic earnings per share $1.33 vs $0.68 (up 95.59%). Match Group is expected to report earnings on August 7th, 2018. The report will be for the fiscal period ending June 30th, 2018. The reported EPS for the same quarter last year was $0.13. The estimated EPS forecast for the next fiscal year is $1.45 and is expected to report on February 5th, 2019.\n\nTo read the full Match Group, Inc. (MTCH) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=MTCH\n\n-----------------------------------------\n\nEVERSOURCE ENERGY (ES) REPORT OVERVIEW\n\nEversource Energy's Recent Financial Performance\n\nFor the three months ended March 31st, 2018 vs March 31st, 2017, Eversource Energy reported revenue of $2,287.96MM vs $2,105.14MM (up 8.68%) and basic earnings per share $0.85 vs $0.82 (up 3.66%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Eversource Energy reported revenue of $7,751.95MM vs $7,639.13MM (up 1.48%) and basic earnings per share $3.11 vs $2.97 (up 4.71%). Eversource Energy is expected to report earnings on July 26th, 2018. The report will be for the fiscal period ending June 30th, 2018. The reported EPS for the same quarter last year was $0.72. The estimated EPS forecast for the next fiscal year is $3.44 and is expected to report on February 28th, 2019.\n\nTo read the full Eversource Energy (ES) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ES\n\n-----------------------------------------\n\nALBEMARLE CORPORATION (ALB) REPORT OVERVIEW\n\nAlbemarle's Recent Financial Performance\n\nFor the three months ended March 31st, 2018 vs March 31st, 2017, Albemarle reported revenue of $821.63MM vs $722.06MM (up 13.79%) and basic earnings per share $1.19 vs $0.46 (up 158.70%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Albemarle reported revenue of $3,071.98MM vs $2,677.20MM (up 14.75%) and basic earnings per share $0.49 vs $5.73 (down 91.45%). Albemarle is expected to report earnings on August 6th, 2018. The report will be for the fiscal period ending June 30th, 2018. The reported EPS for the same quarter last year was $1.13. The estimated EPS forecast for the next fiscal year is $5.92 and is expected to report on February 26th, 2019.\n\nTo read the full Albemarle Corporation (ALB) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\n\n-----------------------------------------\n\nABOUT FUNDAMENTAL MARKETS\n\nFundamental Markets serves thousands of members and have provided research through some of the world's leading brokerages for over a decade–and continue to be one of the best information sources for investors and investment professionals worldwide. Fundamental Markets' roster boasts decades of financial experience and includes top financial writers, FINRA® BrokerCheck® certified professionals with current and valid CRD® number designations, as well as Chartered Financial Analyst® (CFA®) designation holders, to ensure up to date factual information for active readers on the topics they care about.\n\nREGISTERED MEMBER STATUS\n\nFundamental Markets' oversight and audit staff are registered analysts, brokers, and\/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Fundamental Markets' roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Fundamental Markets have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Fundamental Markets' Compliance department by Phone, at +1 667-401-0010, or by E-mail at compliance@Fundamental-Markets.com.\n\nLEGAL NOTICES\n\nInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Fundamental Markets, Fundamental Markets members, and\/or Fundamental Markets affiliates are not responsible for any gains or losses that result from the opinions expressed. Fundamental Markets makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Fundamental Markets has not been compensated for the publication of this press release by any of the above mentioned companies. Fundamental Markets is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.\n\nMedia Contact:\r\n Andrew Duffie, Media Department\r\n Office: +1 667-401-0010\r\n E-mail: media@Fundamental-Markets.com\n\n© 2018 Fundamental Markets. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@Fundamental-Markets.com.\n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n\nFINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.","link":"https:\/\/www.globenewswire.com\/news-release\/2018\/06\/13\/1520921\/0\/en\/Detailed-Research-Economic-Perspectives-on-Och-Ziff-Capital-Management-Group-Axalta-Coating-Trinity-Industries-Match-Group-Eversource-Energy-and-Albemarle-What-Drives-Growth-in-Tod.html","symbols":["ALB.US","AXTA.US","ES.US","MTCH.US","OZM.US","TRN.US"],"tags":["FUNDAMENTAL MARKETS"],"sentiment":{"polarity":0.997,"neg":0.008,"neu":0.931,"pos":0.061}},{"date":"2018-04-03T20:15:00+00:00","title":"Grace Completes Acquisition of Albemarle Polyolefin Catalysts Business","content":"COLUMBIA, Md., April  03, 2018  (GLOBE NEWSWIRE) -- W. R. Grace & Co. (NYSE:GRA) today completed the $416 million acquisition of the Polyolefin Catalysts business of Albemarle Corporation (NYSE:ALB).\n\nThe acquired business primarily develops and manufactures proprietary and custom-manufactured single-site catalysts as well as metallocenes and activators used in the production of plastic resins. The transaction also includes a comprehensive series of highly optimized Ziegler-Natta catalysts for polyethylene production.\n\nThe acquisition includes production plants in Baton Rouge, LA and Yeosu, South Korea; R&D and pilot plant capabilities; and an extensive portfolio of intellectual property.\n\nOver the last five years, Grace has invested well over $1 billion to create a leading position in polyolefin catalysts and process technology. The company now has the broadest portfolio of polyolefin catalyst technologies of any catalysts producer.\n\n“This acquisition significantly enhances our position in the fastest growing polyethylene segment and fills out our polyolefin catalysts portfolio,” said Grace Chairman and Chief Executive Officer Fred Festa. “With the rising demand for sophisticated resins, Grace is committed to growing this business by investing in single-site catalysts technologies to fully support our global polyethylene manufacturing customers.”\n\n“We are very pleased to welcome the approximately 175 employees, including commercial, R&D, and operating professionals, who run this business today,” said Al Beninati, President of Grace’s Specialty Catalysts business. “The combination of talent, technology, and manufacturing capabilities strengthens our team and aligns directly with our strategy to provide our customers the most advanced technologies in the market today.”\n\nGrace addressed the financial impact of the acquisition during an investor call on Dec. 15, 2017, the transcript of which is available on the company’s website under, “Investors.”\n\nAbout Grace\n\nBuilt on talent, technology, and trust, Grace is a leading global supplier of catalysts and engineered materials. The company’s two industry-leading business segments—Catalysts Technologies and Materials Technologies—provide innovative products, technologies, and services that enhance the products and processes of our customers around the world. With approximately 3,700 employees, Grace operates and\/or sells to customers in over 60 countries. More information about Grace is available at grace.com.\n\nForward-Looking Statements\n\nThis announcement contains forward-looking statements, that is, information related to future, not past, events. Such statements generally include the words “believes,” “plans,” “intends,” “targets,” “will,” “expects,” “suggests,” “anticipates,” “outlook,” “continues,” or similar expressions. Forward-looking statements include, without limitation, expected financial positions; results of operations; cash flows; financing plans; business strategy; operating plans; capital and other expenditures; competitive positions; growth opportunities; benefits from new technology and cost reduction initiatives; and markets for securities. For these statements, Grace claims the protections of the safe harbor for forward-looking statements contained in Section 27A of the Securities Act and Section 21E of the Exchange Act. Like other businesses, Grace is subject to risks and uncertainties that could cause its actual results to differ materially from its projections or that could cause other forward-looking statements to prove incorrect. Factors that could cause actual results to differ materially from those contained in the forward-looking statements include, without limitation: risks related to foreign operations, especially in emerging regions; the cost and availability of raw materials, energy and transportation; the effectiveness of its research and development and growth investments; acquisitions and divestitures of assets and businesses; developments affecting Grace’s outstanding indebtedness; developments affecting Grace's pension obligations; its legal and environmental proceedings; environmental compliance costs; uncertainties related to Grace’s ability to realize the anticipated benefits of the separation transaction; the inability to establish or maintain certain business relationships and to hire or retain key personnel; natural disasters such as storms and floods; changes in tax laws and regulations; and those additional factors set forth in Grace's most recent Annual Report on Form 10-K, quarterly report on Form 10-Q and current reports on Form 8-K, which have been filed with the Securities and Exchange Commission and are readily available on the Internet at www.sec.gov. Reported results should not be considered as indications of future performance. Readers are cautioned not to place undue reliance on Grace's projections and forward-looking statements, which speak only as of the dates those projections and statements are made. Grace undertakes no obligation to release publicly any revision to the projections and forward-looking statements contained in this announcement, or to update them to reflect events or circumstances occurring after the date of this announcement.\n\nMedia Relations\r\nRich Badmington\r\nT +1 410.531.4370\r\nrich.badmington@grace.com\n\nInvestor Relations Tania Almond\r\nT +1 410.531.4590\r\ntania.almond@grace.com","link":"https:\/\/www.globenewswire.com\/news-release\/2018\/04\/03\/1459618\/0\/en\/Grace-Completes-Acquisition-of-Albemarle-Polyolefin-Catalysts-Business.html","symbols":["ALB.US","GRA.US"],"tags":["AL BENINATI","FRED FESTA","GRACE","GRACE CATALYSTS TECHNOLOGIES","NYSE:GRA","POLYOLEFIN CATALYSTS","W. R. GRACE & CO"],"sentiment":{"polarity":0.999,"neg":0.021,"neu":0.814,"pos":0.166}},{"date":"2018-02-23T13:25:00+00:00","title":"Research Report Identifies PNM Resources, Inc. (Holding Co.), Sensient Technologies, PS Business Parks, Albemarle, Eversource Energy, and Axalta Coating with Renewed Outlook — Fundamental Analysis, Calculating Forward Movement","content":"NEW YORK, Feb.  23, 2018  (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Fundamental Markets released its latest key findings for all current investors, traders, and shareholders of PNM Resources, Inc. (Holding Co.) (NYSE:PNM), Sensient Technologies Corporation (NYSE:SXT), PS Business Parks, Inc. (NYSE:PSB), Albemarle Corporation (NYSE:ALB), Eversource Energy (NYSE:ES), and Axalta Coating Systems Ltd. (NYSE:AXTA), including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.\n\nComplimentary Access: Research Reports\n\nFull copies of recently published reports are available to readers at the links below.\n\nPNM DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=PNM\r\n SXT DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=SXT\r\n PSB DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=PSB\r\n ALB DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\r\n ES DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ES\r\n AXTA DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=AXTA\n\n(You may have to copy and paste the link into your browser and hit the [ENTER] key)\n\nThe new research reports from Fundamental Markets, available for free download at the links above, examine PNM Resources, Inc. (Holding Co.) (NYSE:PNM), Sensient Technologies Corporation (NYSE:SXT), PS Business Parks, Inc. (NYSE:PSB), Albemarle Corporation (NYSE:ALB), Eversource Energy (NYSE:ES), and Axalta Coating Systems Ltd. (NYSE:AXTA) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today's readers below.\n\n-----------------------------------------\n\nImportant Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. All information in this release was accessed February 21st, 2018. Percentage calculations are performed after rounding. All amounts in millions (MM), except per share amounts.\n\n-----------------------------------------\n\nPNM RESOURCES, INC. (HOLDING CO.) (PNM) REPORT OVERVIEW\n\nPNM Resources, Inc. (Holding Co.)'s Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, PNM Resources, Inc. (Holding Co.) reported revenue of $419.90MM vs $400.37MM (up 4.88%) and basic earnings per share $0.92 vs $0.68 (up 35.29%). For the twelve months ended December 31st, 2016 vs December 31st, 2015, PNM Resources, Inc. (Holding Co.) reported revenue of $1,362.95MM vs $1,439.08MM (down 5.29%) and basic earnings per share $1.47 vs $0.20 (up 635.00%). PNM Resources, Inc. (Holding Co.) is expected to report earnings on February 27th, 2018. The report will be for the fiscal period ending December 31st, 2017. The reported EPS for the same quarter last year was $0.34. The estimated EPS forecast for the next fiscal year is $1.87 and is expected to report on February 27th, 2018.\n\nTo read the full PNM Resources, Inc. (Holding Co.) (PNM) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=PNM\n\n-----------------------------------------\n\nSENSIENT TECHNOLOGIES CORPORATION (SXT) REPORT OVERVIEW\n\nSensient Technologies' Recent Financial Performance\n\nFor the three months ended December 31st, 2017 vs December 31st, 2016, Sensient Technologies reported revenue of $328.87MM vs $330.24MM (down 0.41%) and basic earnings per share $0.31 vs $0.71 (down 56.34%). For the twelve months ended December 31st, 2017 vs December 31st, 2016, Sensient Technologies reported revenue of $1,362.27MM vs $1,383.21MM (down 1.51%) and basic earnings per share $2.05 vs $2.84 (down 27.82%). Sensient Technologies is expected to report earnings on April 24th, 2018. The report will be for the fiscal period ending March 31st, 2018. The reported EPS for the same quarter last year was $0.82. The estimated EPS forecast for the next fiscal year is $4.13 and is expected to report on February 14th, 2019.\n\nTo read the full Sensient Technologies Corporation (SXT) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=SXT\n\n-----------------------------------------\n\nPS BUSINESS PARKS, INC. (PSB) REPORT OVERVIEW\n\nPS Business Parks' Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, PS Business Parks reported revenue of $100.48MM vs $97.34MM (up 3.23%) and basic earnings per share $0.67 vs $0.73 (down 8.22%). For the twelve months ended December 31st, 2016 vs December 31st, 2015, PS Business Parks reported revenue of $387.39MM vs $373.68MM (up 3.67%) and basic earnings per share $2.32 vs $2.53 (down 8.30%). PS Business Parks is expected to report earnings on April 24th, 2018. The report will be for the fiscal period ending March 31st, 2018. The reported EPS for the same quarter last year was $1.52. The estimated EPS forecast for the next fiscal year is $6.53 and is expected to report on February 19th, 2019.\n\nTo read the full PS Business Parks, Inc. (PSB) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=PSB\n\n-----------------------------------------\n\nALBEMARLE CORPORATION (ALB) REPORT OVERVIEW\n\nAlbemarle's Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, Albemarle reported revenue of $754.87MM vs $654.01MM (up 15.42%) and basic earnings per share $1.07 vs $1.14 (down 6.14%). For the twelve months ended December 31st, 2016 vs December 31st, 2015, Albemarle reported revenue of $2,677.20MM vs $2,826.43MM (down 5.28%) and basic earnings per share $5.73 vs $3.01 (up 90.37%). Albemarle is expected to report earnings on February 27th, 2018. The report will be for the fiscal period ending December 31st, 2017. The reported EPS for the same quarter last year was $0.78. The estimated EPS forecast for the next fiscal year is $5.12 and is expected to report on February 27th, 2018.\n\nTo read the full Albemarle Corporation (ALB) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\n\n-----------------------------------------\n\nEVERSOURCE ENERGY (ES) REPORT OVERVIEW\n\nEversource Energy's Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, Eversource Energy reported revenue of $1,988.51MM vs $2,039.71MM (down 2.51%) and basic earnings per share $0.82 vs $0.83 (down 1.20%). For the twelve months ended December 31st, 2016 vs December 31st, 2015, Eversource Energy reported revenue of $7,639.13MM vs $7,954.83MM (down 3.97%) and basic earnings per share $2.97 vs $2.77 (up 7.22%). Eversource Energy is expected to report earnings on February 22nd, 2018. The report will be for the fiscal period ending December 31st, 2017. The reported EPS for the same quarter last year was $0.72. The estimated EPS forecast for the next fiscal year is $3.33 and is expected to report on February 22nd, 2018.\n\nTo read the full Eversource Energy (ES) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ES\n\n-----------------------------------------\n\nAXALTA COATING SYSTEMS LTD. (AXTA) REPORT OVERVIEW\n\nAxalta Coating's Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, Axalta Coating reported revenue of $1,096.30MM vs $1,026.30MM (up 6.82%) and basic earnings per share $0.23 vs -$0.03. For the twelve months ended December 31st, 2016 vs December 31st, 2015, Axalta Coating reported revenue of $4,097.40MM vs $4,113.30MM (down 0.39%) and basic earnings per share $0.18 vs $0.40 (down 55.00%). Axalta Coating is expected to report earnings on April 25th, 2018. The report will be for the fiscal period ending March 31st, 2018. The reported EPS for the same quarter last year was $0.26. The estimated EPS forecast for the next fiscal year is $1.52 and is expected to report on February 5th, 2019.\n\nTo read the full Axalta Coating Systems Ltd. (AXTA) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=AXTA\n\n-----------------------------------------\n\nABOUT FUNDAMENTAL MARKETS\n\nFundamental Markets serves thousands of members and have provided research through some of the world's leading brokerages for over a decade–and continue to be one of the best information sources for investors and investment professionals worldwide. Fundamental Markets' roster boasts decades of financial experience and includes top financial writers, FINRA® BrokerCheck® certified professionals with current and valid CRD® number designations, as well as Chartered Financial Analyst® (CFA®) designation holders, to ensure up to date factual information for active readers on the topics they care about.\n\nREGISTERED MEMBER STATUS\n\nFundamental Markets' oversight and audit staff are registered analysts, brokers, and\/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Fundamental Markets' roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Fundamental Markets have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Fundamental Markets' Compliance department by Phone, at +1 667-401-0010, or by E-mail at compliance@Fundamental-Markets.com.\n\nLEGAL NOTICES\n\nInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Fundamental Markets, Fundamental Markets members, and\/or Fundamental Markets affiliates are not responsible for any gains or losses that result from the opinions expressed. Fundamental Markets makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Fundamental Markets has not been compensated for the publication of this press release by any of the above mentioned companies. Fundamental Markets is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.\n\nMedia Contact:\r\n Andrew Duffie, Media Department\r\n Office: +1 667-401-0010\r\n E-mail: media@Fundamental-Markets.com\n\n© 2018 Fundamental Markets. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@Fundamental-Markets.com.\n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n\nFINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.","link":"https:\/\/www.globenewswire.com\/news-release\/2018\/02\/23\/1386695\/0\/en\/Research-Report-Identifies-PNM-Resources-Inc-Holding-Co-Sensient-Technologies-PS-Business-Parks-Albemarle-Eversource-Energy-and-Axalta-Coating-with-Renewed-Outlook-Fundamental-Anal.html","symbols":["ALB.US","AXTA.US","ES.US","PNM.US","PSB.US","SXT.US"],"tags":["FUNDAMENTAL MARKETS"],"sentiment":{"polarity":0.997,"neg":0.008,"neu":0.931,"pos":0.061}},{"date":"2017-12-19T12:30:00+00:00","title":"Analysis: Positioning to Benefit within Albemarle, Eversource Energy, Axalta Coating, PNM Resources, Sensient Technologies, and PS Business Parks — Research Highlights Growth, Revenue, and Consolidated Results","content":"NEW YORK, Dec.  19, 2017  (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Fundamental Markets released its latest key findings for all current investors, traders, and shareholders of Albemarle Corporation (NYSE:ALB), Eversource Energy (NYSE:ES), Axalta Coating Systems Ltd. (NYSE:AXTA), PNM Resources, Inc. (NYSE:PNM), Sensient Technologies Corporation (NYSE:SXT), and PS Business Parks, Inc. (NYSE:PSB), including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.\n\nComplimentary Access: Research Reports\n\nFull copies of recently published reports are available to readers at the links below.\n\nALB DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\r\n ES DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ES\r\n AXTA DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=AXTA\r\n PNM DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=PNM\r\n SXT DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=SXT\r\n PSB DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=PSB\n\n(You may have to copy and paste the link into your browser and hit the [ENTER] key)\n\nThe new research reports from Fundamental Markets, available for free download at the links above, examine Albemarle Corporation (NYSE:ALB), Eversource Energy (NYSE:ES), Axalta Coating Systems Ltd. (NYSE:AXTA), PNM Resources, Inc. (NYSE:PNM), Sensient Technologies Corporation (NYSE:SXT), and PS Business Parks, Inc. (NYSE:PSB) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today's readers below.\n\n-----------------------------------------\n\nImportant Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. All information in this release was accessed December 15th, 2017. Percentage calculations are performed after rounding. All amounts in millions (MM), except per share amounts.\n\n-----------------------------------------\n\nAlbemarle Corporation (ALB) REPORT OVERVIEW\n\nAlbemarle's Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, Albemarle reported revenue of $754.87MM vs $654.01MM (up 15.42%) and basic earnings per share $1.07 vs $1.14 (down 6.14%). For the twelve months ended December 31st, 2016 vs December 31st, 2015, Albemarle reported revenue of $2,677.20MM vs $2,826.43MM (down 5.28%) and basic earnings per share $5.73 vs $3.01 (up 90.37%). Albemarle is expected to report earnings on February 26th, 2018. The report will be for the fiscal period ending December 31st, 2017. The reported EPS for the same quarter last year was $0.78. The estimated EPS forecast for the next fiscal year is $5.18 and is expected to report on February 26th, 2018.\n\nTo read the full Albemarle Corporation (ALB) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\n\n-----------------------------------------\n\nEversource Energy (ES) REPORT OVERVIEW\n\nEversource Energy's Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, Eversource Energy reported revenue of $1,988.51MM vs $2,039.71MM (down 2.51%) and basic earnings per share $0.82 vs $0.83 (down 1.20%). For the twelve months ended December 31st, 2016 vs December 31st, 2015, Eversource Energy reported revenue of $7,639.13MM vs $7,954.83MM (down 3.97%) and basic earnings per share $2.97 vs $2.77 (up 7.22%). Eversource Energy is expected to report earnings on February 20th, 2018. The report will be for the fiscal period ending December 31st, 2017. The reported EPS for the same quarter last year was $0.72. The estimated EPS forecast for the next fiscal year is $3.33 and is expected to report on February 20th, 2018.\n\nTo read the full Eversource Energy (ES) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ES\n\n-----------------------------------------\n\nAxalta Coating Systems Ltd. (AXTA) REPORT OVERVIEW\n\nAxalta Coating's Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, Axalta Coating reported revenue of $1,096.30MM vs $1,026.30MM (up 6.82%) and basic earnings per share $0.23 vs -$0.03. For the twelve months ended December 31st, 2016 vs December 31st, 2015, Axalta Coating reported revenue of $4,097.40MM vs $4,113.30MM (down 0.39%) and basic earnings per share $0.18 vs $0.40 (down 55.00%). Axalta Coating is expected to report earnings on February 14th, 2018. The report will be for the fiscal period ending December 31st, 2017. The reported EPS for the same quarter last year was $0.28. The estimated EPS forecast for the next fiscal year is $1.37 and is expected to report on February 14th, 2018.\n\nTo read the full Axalta Coating Systems Ltd. (AXTA) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=AXTA\n\n-----------------------------------------\n\nPNM Resources, Inc. (PNM) REPORT OVERVIEW\n\nPNM Resources' Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, PNM Resources reported revenue of $419.90MM vs $400.37MM (up 4.88%) and basic earnings per share $0.92 vs $0.68 (up 35.29%). For the twelve months ended December 31st, 2016 vs December 31st, 2015, PNM Resources reported revenue of $1,362.95MM vs $1,439.08MM (down 5.29%) and basic earnings per share $1.47 vs $0.20 (up 635.00%). PNM Resources is expected to report earnings on February 27th, 2018. The report will be for the fiscal period ending December 31st, 2017. The reported EPS for the same quarter last year was $0.34. The estimated EPS forecast for the next fiscal year is $1.74 and is expected to report on February 27th, 2018.\n\nTo read the full PNM Resources, Inc. (PNM) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=PNM\n\n-----------------------------------------\n\nSensient Technologies Corporation (SXT) REPORT OVERVIEW\n\nSensient Technologies' Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, Sensient Technologies reported revenue of $353.52MM vs $349.66MM (up 1.10%) and basic earnings per share $0.74 vs $0.80 (down 7.50%). For the twelve months ended December 31st, 2016 vs December 31st, 2015, Sensient Technologies reported revenue of $1,383.21MM vs $1,375.96MM (up 0.53%) and basic earnings per share $2.84 vs $2.33 (up 21.89%). Sensient Technologies is expected to report earnings on February 8th, 2018. The report will be for the fiscal period ending December 31st, 2017. The reported EPS for the same quarter last year was $0.80. The estimated EPS forecast for the next fiscal year is $3.78 and is expected to report on February 8th, 2018.\n\nTo read the full Sensient Technologies Corporation (SXT) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=SXT\n\n-----------------------------------------\n\nPS Business Parks, Inc. (PSB) REPORT OVERVIEW\n\nPS Business Parks' Recent Financial Performance\n\nFor the three months ended September 30th, 2017 vs September 30th, 2016, PS Business Parks reported revenue of $100.48MM vs $97.34MM (up 3.23%) and basic earnings per share $0.67 vs $0.73 (down 8.22%). For the twelve months ended December 31st, 2016 vs December 31st, 2015, PS Business Parks reported revenue of $387.39MM vs $373.68MM (up 3.67%) and basic earnings per share $2.32 vs $2.53 (down 8.30%). PS Business Parks is expected to report earnings on February 20th, 2018. The report will be for the fiscal period ending December 31st, 2017. The reported EPS for the same quarter last year was $1.39. The estimated EPS forecast for the next fiscal year is $6.47 and is expected to report on February 20th, 2018.\n\nTo read the full PS Business Parks, Inc. (PSB) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=PSB\n\n-----------------------------------------\n\nABOUT Fundamental Markets\n\nFundamental Markets serves thousands of members and have provided research through some of the world's leading brokerages for over a decade–and continue to be one of the best information sources for investors and investment professionals worldwide. Fundamental Markets' roster boasts decades of financial experience and includes top financial writers, FINRA® BrokerCheck® certified professionals with current and valid CRD® number designations, as well as Chartered Financial Analyst® (CFA®) designation holders, to ensure up to date factual information for active readers on the topics they care about.\n\nREGISTERED MEMBER STATUS\n\nFundamental Markets' oversight and audit staff are registered analysts, brokers, and\/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Fundamental Markets' roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Fundamental Markets have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Fundamental Markets' Compliance department by Phone, at +1 667-401-0010, or by E-mail at compliance@Fundamental-Markets.com.\n\nLEGAL NOTICES\n\nInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Fundamental Markets, Fundamental Markets members, and\/or Fundamental Markets affiliates are not responsible for any gains or losses that result from the opinions expressed. Fundamental Markets makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Fundamental Markets has not been compensated for the publication of this press release by any of the above mentioned companies. Fundamental Markets is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.\n\nMedia Contact:\r\n Andrew Duffie, Media Department\r\n Office: +1 667-401-0010\r\n E-mail: media@Fundamental-Markets.com\n\n© 2017 Fundamental Markets. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@Fundamental-Markets.com.\n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n\nFINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.","link":"https:\/\/www.globenewswire.com\/news-release\/2017\/12\/19\/1266074\/0\/en\/Analysis-Positioning-to-Benefit-within-Albemarle-Eversource-Energy-Axalta-Coating-PNM-Resources-Sensient-Technologies-and-PS-Business-Parks-Research-Highlights-Growth-Revenue-and-C.html","symbols":["ALB.US","AXTA.US","ES.US","PNM.US","PSB.US","SXT.US"],"tags":["FUNDAMENTAL MARKETS"],"sentiment":{"polarity":0.997,"neg":0.008,"neu":0.931,"pos":0.061}},{"date":"2017-12-14T22:00:00+00:00","title":"Grace to Acquire Polyolefin Catalysts Business","content":"COLUMBIA, Md., Dec.  14, 2017  (GLOBE NEWSWIRE) -- W. R. Grace & Co. (NYSE:GRA) today signed an agreement to acquire the Polyolefin Catalysts business of Albemarle Corporation (NYSE:ALB) for $416 million. The transaction is expected to close in the first quarter of 2018, subject to regulatory approvals and other customary closing conditions.\n\nThe Polyolefin Catalysts business is a global leader in proprietary and custom-manufactured single-site catalysts as well as metallocenes and activators. The acquisition also includes a comprehensive series of highly optimized Ziegler-Natta catalysts for polyethylene production.\n\nThe acquisition significantly strengthens Grace’s catalysts technology portfolio, commercial relationships, and manufacturing network. Approximately 175 employees will join Grace’s global team. The two manufacturing operations in Baton Rouge, Louisiana and Yeosu, South Korea add important flexibility to the company’s global catalysts manufacturing network, enhancing Grace’s ability to meet customer needs across multiple regions.\n\n“This transaction aligns perfectly with our strategy to expand our leadership position in polyolefin catalysts,” said Grace Chairman and Chief Executive Officer Fred Festa. “I am excited about the opportunities created by adding the talent, advanced technology, and manufacturing capabilities of the business. Both the catalysts and activators product lines are tied to high-growth applications and the manufacturing assets bring important scale and capital synergies.”\n\nGrace expects to finance the transaction with a combination of debt and cash.\n\nA leader in polyolefin catalysts and licensing, Grace has the world’s broadest portfolio of polypropylene and polyethylene catalyst technologies used to produce thermoplastic resins for a variety of applications. A leading innovator and strategic partner to its customers, Grace supplies catalyst solutions for all polyolefin processes, as well as polypropylene process technology and process controls.\n\nInvestor Call\n\nGrace will host a conference call with investors tomorrow, December 15, at 8:30 a.m. ET. Participants may access the webcast from the Investors portion of our website, www.grace.com. The call will also be accessible by telephone at +1 844.515.9173 (U.S.) or +1 574.990.9421 (International). The participant passcode is 7569029. Please dial into the call at least 10 minutes early to register.\n\nThe replay will be available approximately two hours after the call by dialing +1 855.859.2056 (U.S.) or \r\n +1 404.537.3406 (International) and entering the participant passcode 7569029. The replay will be available for one week, and the webcast replay and transcript will be available on the company's website for one year.\n\nAbout Grace\n\nBuilt on talent, technology, and trust, Grace is a leading global supplier of catalysts and engineered materials. The company’s two industry-leading business segments—Catalysts Technologies and Materials Technologies—provide innovative products, technologies, and services that enhance the products and processes of our customers around the world. Grace employs approximately 3,700 people in over 30 countries. More information about Grace is available at grace.com.\n\nForward-Looking Statements\n\nThis announcement contains forward-looking statements, that is, information related to future, not past, events. Such statements generally include the words “believes,” “plans,” “intends,” “targets,” “will,” “expects,” “suggests,” “anticipates,” “outlook,” “continues,” or similar expressions. Forward-looking statements include, without limitation, expected financial positions; results of operations; cash flows; financing plans; business strategy; operating plans; capital and other expenditures; competitive positions; growth opportunities; benefits from new technology and cost reduction initiatives; and markets for securities. For these statements, Grace claims the protections of the safe harbor for forward-looking statements contained in Section 27A of the Securities Act and Section 21E of the Exchange Act. Like other businesses, Grace is subject to risks and uncertainties that could cause its actual results to differ materially from its projections or that could cause other forward-looking statements to prove incorrect. Factors that could cause actual results to differ materially from those contained in the forward-looking statements include, without limitation: risks related to foreign operations, especially in emerging regions; the cost and availability of raw materials, energy and transportation; the effectiveness of its research and development and growth investments; acquisitions and divestitures of assets and businesses; developments affecting Grace’s outstanding indebtedness; developments affecting Grace's funded and unfunded pension obligations; its legal and environmental proceedings; environmental compliance costs; uncertainties related to Grace’s ability to realize the anticipated benefits of the separation transaction; the inability to establish or maintain certain business relationships and to retain key personnel; natural disasters such as storms and floods; changes in tax laws and regulations; and those additional factors set forth in Grace's most recent Annual Report on Form 10-K, quarterly report on Form 10-Q and current reports on Form 8-K, which have been filed with the Securities and Exchange Commission and are readily available on the Internet at www.sec.gov. Reported results should not be considered as indications of future performance. Readers are cautioned not to place undue reliance on Grace's projections and forward-looking statements, which speak only as of the dates those projections and statements are made. Grace undertakes no obligation to release publicly any revision to the projections and forward-looking statements contained in this announcement, or to update them to reflect events or circumstances occurring after the date of this announcement.\n\nMedia Relations\r\nRich Badmington\r\nT +1 410.531.4370\r\nrich.badmington@grace.com\n\nInvestor Relations\r\nTania Almond\r\nT +1 410.531.4590\r\ntania.almond@grace.com","link":"https:\/\/www.globenewswire.com\/news-release\/2017\/12\/14\/1262340\/0\/en\/Grace-to-Acquire-Polyolefin-Catalysts-Business.html","symbols":["ALB.US","GRA.US"],"tags":["FRED FESTA","NYSE:GRA","POLYOLEFIN CATALYSTS","W. R. GRACE & CO","W.R. GRACE"],"sentiment":{"polarity":0.999,"neg":0.019,"neu":0.822,"pos":0.159}},{"date":"2017-11-15T12:50:00+00:00","title":"Report: Developing Opportunities within The New York Times, Albemarle, Vista Outdoor, Owens & Minor, Select Medical, and Gastar Exploration – Future Expectations, Projections Moving into 2018","content":"NEW YORK, Nov.  15, 2017  (GLOBE NEWSWIRE) -- In new independent research reports released early this morning, Fundamental Markets released its latest key findings for all current investors, traders, and shareholders of The New York Times Company (NYSE:NYT), Albemarle Corporation (NYSE:ALB), Vista Outdoor Inc. (NYSE:VSTO), Owens & Minor, Inc. (NYSE:OMI), Select Medical Holdings Corporation (NYSE:SEM), and Gastar Exploration Inc. (NYSE:GST) including updated fundamental summaries, consolidated fiscal reporting, and fully-qualified certified analyst research.\n\nComplimentary Access: Research Reports\n\nFull copies of recently published reports are available to readers at the links below.\n\nNYT DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=NYT\n\nALB DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\n\nVSTO DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=VSTO\n\nOMI DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=OMI\n\nSEM DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=SEM\n\nGST DOWNLOAD: http:\/\/Fundamental-Markets.com\/register\/?so=GST\n\n(You may have to copy and paste the link into your browser and hit the [ENTER] key)\n\nThe new research reports from Fundamental Markets, available for free download at the links above, examine The New York Times Company (NYSE:NYT), Albemarle Corporation (NYSE:ALB), Vista Outdoor Inc. (NYSE:VSTO), Owens & Minor, Inc. (NYSE:OMI), Select Medical Holdings Corporation (NYSE:SEM), and Gastar Exploration Inc. (NYSE:GST) on a fundamental level and outlines the overall demand for their products and services in addition to an in-depth review of the business strategy, management discussion, and overall direction going forward. Several excerpts from the recently released reports are available to today’s readers below.\n\n-----------------------------------------\n\nImportant Notice: the following excerpts are not designed to be standalone summaries and as such, important information may be missing from these samples. All information in this release was accessed November 14, 2017. Please download the entire research report, free of charge, to ensure you are reading all relevant material information. All amounts in millions (except per share amounts).\n\n-----------------------------------------\n\nTHE NEW YORK TIMES COMPANY (NYT) REPORT OVERVIEW\n\nThe New York Times' Recent Financial Performance\n\nFor the three months ended September 24, 2017 vs September 25, 2016, The New York Times reported revenue of $385.6 vs $363.5 (up 6.1%) and dividends per share $0.08 vs $0.08 (unchanged). For the twelve months ended December 25, 2016 vs December 27, 2015, The New York Times reported revenue of $1,555.3 vs $1,579.2 (down 1.5%) and dividends per share $0.16 vs $0.16 (unchanged).\n\nTo read the full The New York Times Company (NYT) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=NYT\n\n-----------------------------------------\n\nALBEMARLE CORPORATION (ALB) REPORT OVERVIEW\n\nAlbemarle's Recent Financial Performance\n\nFor the three months ended September 30, 2017 vs September 30, 2016, Albemarle reported revenue of $754.9 vs $654.0 (up 15.4%), diluted earnings per share $1.06 vs $1.13 (down 6.2%), and dividends per share $0.320 vs $0.305 (up 4.9%). For the twelve months ended December 31, 2016 vs December 31, 2015, Albemarle reported revenue of $2,677.2 vs $2,826.4 (down 5.3%), diluted earnings per share $5.68 vs $3.00 (up 89.3%), and dividends per share $1.22 vs $1.16 (up 5.2%).\n\nTo read the full Albemarle Corporation (ALB) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=ALB\n\n-----------------------------------------\n\nVISTA OUTDOOR INC. (VSTO) REPORT OVERVIEW\n\nVista Outdoor's Recent Financial Performance\n\nFor the three months ended October 1, 2017 vs October 2, 2016, Vista Outdoor reported revenue of $587.3 vs $684.3 (down 14.2%) and diluted earnings per share -$2.01 vs $1.22. For the twelve months ended March 31, 2017 vs March 31, 2016, Vista Outdoor reported revenue of $2,546.9 vs $2,270.7 (up 12.2%), diluted earnings per share -$4.66 vs $2.35.\n\nTo read the full Vista Outdoor Inc. (VSTO) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=VSTO\n\n-----------------------------------------\n\nOWENS & MINOR, INC. (OMI) REPORT OVERVIEW\n\nOwens & Minor's Recent Financial Performance\n\nFor the three months ended September 30, 2017 vs September 30, 2016, Owens & Minor reported revenue of $2,334.0 vs $2,415.6 (down 3.4%), diluted earnings per share $0.18 vs $0.48 (down 62.5%), and dividends per share $0.2575 vs $0.2550 (up 1.0%). For the twelve months ended December 31, 2016 vs December 31, 2015, Owens & Minor reported revenue of $9,723.4 vs $9,772.9 (down 0.51%), diluted earnings per share $1.76 vs $1.65 (up 6.7%), and dividends per share $1.02 vs $1.01 (up 1.0%).\n\nTo read the full Owens & Minor, Inc. (OMI) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=OMI\n\n-----------------------------------------\n\nSELECT MEDICAL HOLDINGS CORPORATION (SEM) REPORT OVERVIEW\n\nSelect Medical's Recent Financial Performance\n\nFor the three months ended September 30, 2017 vs September 30, 2016, Select Medical reported revenue of $1,097.2 vs $1,053.8 (up 4.1%) and diluted earnings per share $0.14 vs $0.05 (up 180.0%). For the twelve months ended December 31, 2016 vs December 31, 2015, Select Medical reported revenue of $4,286.0 vs $3,742.7 (up 14.5%) and diluted earnings per share $0.87 vs $0.99 (down 12.1%).\n\nTo read the full Select Medical Holdings Corporation (SEM) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=SEM\n\n-----------------------------------------\n\nGASTAR EXPLORATION INC. (GST) REPORT OVERVIEW\n\nGastar Exploration's Recent Financial Performance\n\nFor the three months ended September 30, 2017 vs September 30, 2016, Gastar Exploration reported revenue of $15.3 vs $13.0 (up 17.7%) and diluted earnings per share -$0.08 vs -$0.03. For the twelve months ended December 31, 2016 vs December 31, 2015, Gastar Exploration reported revenue of $58.3 vs $107.3 (down 45.7%) and diluted earnings per share -$0.93 vs -$6.11.\n\nTo read the full Gastar Exploration Inc. (GST) report, download it here: http:\/\/Fundamental-Markets.com\/register\/?so=GST\n\n-----------------------------------------\n\nABOUT FUNDAMENTAL MARKETS\n\nFundamental Markets serves thousands of members and have provided research through some of the world’s leading brokerages for over a decade—and continue to be one of the best information sources for investors and investment professionals worldwide. Fundamental Markets’ roster boasts decades of financial experience and includes top financial writers, FINRA® BrokerCheck® certified professionals with current and valid CRD® number designations, as well as Chartered Financial Analyst® (CFA®) designation holders, to ensure up to date factual information for active readers on the topics they care about.\n\nREGISTERED MEMBER STATUS\n\nFundamental Markets’ oversight and audit staff are registered analysts, brokers, and\/or financial advisers (\"Registered Members\") working within Equity Research, Media, and Compliance departments. Fundamental Markets’ roster includes qualified CFA® charterholders, licensed securities attorneys, and registered FINRA® members holding duly issued CRD® numbers. Current licensed status of several Registered Members at Fundamental Markets have been independently verified by an outside audit firm, including policy and audit records duly executed by Registered Members. Complaints, concerns, questions, or inquiries regarding this release should be directed to Fundamental Markets’ Compliance department by Phone, at +1 667-401-0010, or by E-mail at compliance@fundamental-markets.com.\n\nLEGAL NOTICES\n\nInformation contained herein is not an offer or solicitation to buy, hold, or sell any security. Fundamental Markets, Fundamental Markets members, and\/or Fundamental Markets affiliates are not responsible for any gains or losses that result from the opinions expressed. Fundamental Markets makes no representations as to the completeness, accuracy, or timeliness of the material provided and all materials are subject to change without notice. Fundamental Markets has not been compensated for the publication of this press release by any of the above mentioned companies. Fundamental Markets is not a financial advisory firm, investment adviser, or broker-dealer, and does not undertake any activities that would require such registration. For our full disclaimer, disclosure, and terms of service please visit our website.\n\nMedia Contact:\r\n Andrew Duffie, Media Department\r\n Office: +1 667-401-0010\r\n E-mail: andrew.duffie@fundamental-markets.com\n\n© 2017 Fundamental Markets. All Rights Reserved. For republishing permissions, please contact a partner network manager at partnership@fundamental-markets.com.\n\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n\nFINRA®, BrokerCheck®, and CRD® are registered trademarks owned by Financial Industry Regulatory Authority, Inc.","link":"https:\/\/www.globenewswire.com\/news-release\/2017\/11\/15\/1193426\/0\/en\/Report-Developing-Opportunities-within-The-New-York-Times-Albemarle-Vista-Outdoor-Owens-Minor-Select-Medical-and-Gastar-Exploration-Future-Expectations-Projections-Moving-into-2018.html","symbols":["ALB.US","GST.US","NYT.US","OMI.US","SEM.US","VSTO.US"],"tags":["FUNDAMENTAL MARKETS"],"sentiment":{"polarity":0.997,"neg":0.01,"neu":0.91,"pos":0.08}},{"date":"2017-08-01T12:00:00+00:00","title":"Wealth Signs Letter Agreement to Acquire Interest in ‘Seven Salars’ Lithium Project in Chile","content":"VANCOUVER, British Columbia, Aug.  01, 2017  (GLOBE NEWSWIRE) -- Wealth Minerals Ltd. (the “Company” or “Wealth”) - (TSXV:WML) (OTCQB:WMLLF) (SSE:WMLCL) (Frankfurt:EJZN) announces that it has executed a binding letter agreement (the “Letter Agreement”), whereby Wealth or a Chilean subsidiary of Wealth has been granted the option and right to acquire 49% of the issued and outstanding shares of San Antonio Sociedad Contractual Minera (“San Antonio”) and a 24.5% beneficial interest in certain exploration and exploitation mining concessions that comprise the Salares 7 Lithium project (the “Property” or the “Seven Salars Project”).  The Property is a lithium brine asset portfolio currently owned 50% by Talison Lithium Ltd. (“Talison”) and 50% by San Antonio and has a total area of 39,400 hectares located over seven salars in Region II, northern Chile.\n\n“The Seven Salars Project is one of the most important large-scale lithium brine projects in Chile.  The Property includes the Salar de La Isla, believed by many to be Chile’s second largest lithium deposit and where 68 shallow drill hole samples returned an average lithium grade of 863 mg\/l,” stated Hendrik Van Alphen, CEO, Wealth Minerals, Canada.\n\nTalison acquired its 50% interest in the Seven Salars Project in 2010 and completed drill testing in 2011, but since then the project has not moved forward.\n\nMarcelo Awad, Executive Director, Wealth Chile, “Wealth will bring a new dynamic to the ownership structure and the Company will be working diligently with the owners, allowing the project to realize its real potential.  As a Chilean mining executive, I am pleased to help Chile become the dominant global lithium producer in the new green economy and I believe Seven Salars is one of the most geologically advanced new lithium projects in the country.”\n\nA figure accompanying this announcement is available at: http:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/185a1702-2070-49a1-9735-8aebaee5ae12.\n\nOverview of the Seven Salars Project\n\nSeveral work programs have been completed on the Property (Figure 2).  A regional geochemistry study of salars in Regions I, II and III of northern Chile was undertaken by a combination of government and non-government agencies between 1995 and 1999.  The work covered, but was not limited to, the Seven Salars Project.  Surface water sampling of springs and lagoons was completed and the results demonstrated widespread occurrences of anomalous lithium and potassium in surface lagoons and ponds, including a maximum value of 1,080 mg\/l Li at Salar de La Isla.  Anomalous values were also recorded from a number of springs feeding these salars, although results were generally below 50 mg\/l.\n\nA figure accompanying this announcement is available at: http:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/0b657813-d0a3-4cc6-9da1-a3d9421e6423.\n\nConfirmatory sampling was undertaken by Taigo Consultants Limited in 2009 as part of a review of the Salares 7 Project.  A total of 25 surface water samples were collected from lagoons along the boundaries of, or springs flowing into, five of the seven salars (comprising the Property).  Results in general confirmed the results of the earlier regional survey.  Taiga recommended the use of geophysical surveys to locate high salinity sub-surface brines, followed by a drilling and sampling program to define the lithium and potassium content of the brine deposits.\n\nBetween 2010 and 2011, Talison completed Transient Electromagnetic (TEM) geophysical surveys, surface brine sampling and exploration drilling on the Property and TEM geophysical surveys were completed over five salars of the seven salars.  The TEM method can provide an indication of basin geometry, continuity of hydrogeological units, geological structures and the presence of brine versus fresh groundwater.  Results identified a number of zones of high salinity and it appears that recent sediments have overlapped onto the salars in places, with brine extends beyond the current salar shore lines.  The results of the TEM survey indicate that the depth of the salars may exceed 200 m.\n\nApproximately 200 surface brine samples were collected and analyzed in the Talison Greenbushes Laboratory following routine QA\/QC protocols.  During sample collection a range of physical measurements were made on the brine including temperature, conductivity and pH.  Analytical results from Salar de La Isla indicate a wide range of lithium concentrations with a maximum value of 1,080mg\/l.\n\nThirty-four (34) drill holes totaling 562m were completed with a sonic drill in 2011.  Twenty-seven (27) holes were drilled in Salar de La Isla and 7 holes in Salar de Las Parinas.  The holes were continuously cored and 92 brine samples were collected.  Drill hole locations were sited around the margins of the two salars as shown in Figures 3.\n\nA figure accompanying this announcement is available at: http:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/0fb53850-da7e-4de7-be9f-b8058bf7ac43.\n\nThe maximum drill depth in Salar de La Isla was 43.5 m and the average depth was 16 m. Analyses of brine samples obtained during the drilling program indicate lithium concentrations range from 220 mg\/l to a maximum of 1,080mg\/l; the average lithium concentration of 68 samples was 863 mg\/l.  The average Mg\/Li ratio was 6.6.  Potassium concentrations ranged from 1,960 mg\/l to a maximum of 9,830 mg\/l; the average potassium concentration was 7,979 mg\/l.\n\nThe maximum drill depth in Salar de Las Parinas was 33 m and the average depth was 22m.  Lithium concentrations ranged from 260 mg\/l to a maximum of 480 mg\/l, with an average of 331 mg\/l.  The average Mg\/Li ratio was 11.  Potassium concentrations ranged from 4,440 mg\/l to a maximum of 8,210 mg\/l, with an average of 5,650 mg\/l.\n\nThe Property also includes a land package within the Maricunga Salar, adjacent to concessions in the salar currently under exploration by Lithium Power International and Bearing Resources.  Earlier in 2017, Chilean state mining company CODELCO announced the formation of a lithium production subsidiary with the goal to advance development of the Maricunga Salar.\n\nThe other salars in the Property have varying degrees of historical work completed, including surface samples, water samples and geophysical surveys. The most significant of these is three brine samples on Salar de Aquilar, which returned lithium concentrations between 257 mg\/l and 337 mg\/l, as well as potassium concentrations between 2,910 mg\/l and 3,990 mg\/l.\n\nCommercial Terms\n\nSubject to acceptance of the Letter Agreement and the option grant transaction contemplated thereby (the “Transaction”) by the TSX Venture Exchange (the “TSXV”) and the completion of satisfactory due diligence by Wealth on the Property and other customary conditions precedent on or before 120 days from the execution of the Letter Agreement, including a National Instrument 43-101 technical report on the Property, if required, the existing shareholders of San Antonio (the “Selling Shareholders”) will sell and transfer to Wealth, at the closing of the Transaction (the “Closing”), shares representing 49% of the issued and outstanding shares of San Antonio in consideration for the payment by Wealth of USD 11,760,000 in cash and the issuance of 4,104,545 common shares of Wealth (the “Wealth Shares”) in accordance with the following schedule:\n\nat Closing, an initial payment of USD 3,920,000 and the issuance of 4,104,545 Wealth Shares; a further payment of USD 3,920,000 on or before the day which is 4 months after Closing; and a further payment of USD 3,920,000 on or before the day which is 8 months after Closing.\n\nWealth will provide security for the payments due 4 months and 8 months after Closing by granting to the Selling Shareholders a pledge over the San Antonio shares being purchased by Wealth.  In addition, the Letter Agreement provides that the definitive purchase and sale agreement will contain a buy-back provision, whereby Wealth will grant to the Selling Shareholders the right to re-acquire the San Antonio Shares purchased by Wealth at a price equivalent to 65% of the purchase price paid therefor, in the event that any of the purchase price installments are not fully paid as scheduled and such lack of payment is not remedied within 20 business days of such breach.\n\nThe Wealth Shares issued in connection with the Transaction will be subject to an initial resale restriction of 4 months and one day following the date of issue thereof.  In addition, the Wealth Shares will be subject to an additional lock-up period of 8 months from the date of issue.  During this lock-up period, the Selling Shareholders may only sell up to the aggregate amount of 250,000 Wealth Shares in any calendar month, and Wealth will have the first right of refusal to purchase any Wealth Share proposed to be sold by the Selling Shareholders during this period.\n\nWealth Lithium Interests in Chile\n\nWith this transaction, Wealth now has option interests in 16 salars and the properties have an aggregate area of 110,604 hectares (Table 1).  The Company is now positioned as one of the largest holders of lithium property interests in Chile.\n\nTable 1: Wealth Minerals’ Lithium Brine Property Interests in Chile ProjectSalarOption InterestHectaresAtacama ProjectAtacama100%46,000Trinity ProjectPujsa100% 1,600Calientes Norte2,000Quisquiro2,400Laguna Verde ProjectLaguna Verde100%8,700Five Salars ProjectAscotan100%1,300Piedra Parada1,900Lejia400Siglia1,600Huasco5,300Seven Salars ProjectIsla24.5%16,500Agua Amerga3,100Parinas5,400Grande4,000Aguilar8,800Piedra Parada1,500Maricunga104\n\nAbout Talison Lithium\n\nTalison is a leading global producer of lithium with projects in Western Australia and Chile.  Production from its Greenbushes Project in Australia accounts for approximately 40% of global production.  Talison is owned by Tianqi Lithium (51%) and by Albemarle Corporation (49%).  Talison’s operating partner is Albemarle who is also one of only two current lithium producers in Chile and who is producing from the Atacama Salar, where Wealth has a significant land position.  Talison acquired its 50% stake in the Seven Salars Property via the acquisition of TSXV listed Salares Lithium Ltd. in 2010.\n\nAbout Albemarle Corporation\n\nAlbemarle Corporation (NYSE:ALB) is a global specialty chemicals company with leading positions in lithium, bromine, refining catalysts and applied surface treatments.  Albemarle’s market capitalization is $13 billion and the company employs approximately 5,000 people and serves customers in approximately 100 countries.  Talison’s Greenbushes Project in Australia is operated by Albemarle who also operate in the Atacama Salar, producing lithium carbonate from a location 40km south of Wealth’s Atacama Project.\n\nAbout Tianqui Lithium\n\nTianqi Lithium is a leading global supplier of lithium products, with major businesses including lithium resource development and exploitation, downstream production processing and trade for a diverse range of high quality lithium products including mineral concentrates.  The company has established global presences in China, Hong Kong, the UK, Australia and Chile, allowing the company to service customers across Europe, Asia, the Americas and Oceania.\n\nAbout San Antonio\n\nSan Antonio is the underlying owner from whom Wealth will acquire a 24.5% beneficial interest in the Property.\n\nAbout Wealth Minerals Ltd.\n\nWealth is a mineral resource company with interests in Canada, Mexico, Peru and Chile.  The Company's main focus is the acquisition of lithium projects in South America.  To date, the Company has positioned itself to develop the Aguas Calientes Norte, Pujsa and Quisquiro Salars in Chile (the Trinity Project), as well as to work alongside existing producers in the prolific Atacama Salar, in addition to the Laguna Verde lithium project acquisition.  The Company has also positioned itself to play a role in asset consolidation in Chile with the Five Salars Project.\n\nThe Company continues to pursue new acquisitions in the region, the latest of which is the Seven Salars Project and is eager to move the projects forward into production.  Lithium market dynamics and a rapidly increasing metal price are the result of profound structural issues with the industry meeting anticipated future demand.  Wealth is positioning itself to be a major beneficiary of this future mismatch of supply and demand.  The Company also maintains and continues to evaluate a portfolio of precious and base metal exploration-stage projects.\n\nFor further details on the Company readers are referred to the Company’s website (www.wealthminerals.com) and its Canadian regulatory filings on SEDAR at www.sedar.com.\n\nOn Behalf of the Board of Directors of\r\nWEALTH MINERALS LTD.\n\n“Hendrik van Alphen”\r\nHendrik van Alphen\r\nChief Executive Officer\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThis news release contains forward-looking statements and forward-looking information (collectively, “forward-looking statements”) within the meaning of applicable Canadian and U.S. securities legislation, including the United States Private Securities Litigation Reform Act of 1995.  All statements, other than statements of historical fact, included herein including, without limitation, statements regarding the anticipated content, commencement, timing and cost of exploration programs in respect of the Seven Salars Project and otherwise, anticipated results from the exploration activities, the discovery and delineation of mineral deposits\/resources\/reserves on the Seven Salars Project, the anticipated business plans and timing of future activities of the Company and the Company’s expectation that it will be able to enter into agreements to acquire interests in additional mineral properties, are forward-looking statements.  Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct.  Forward-looking statements are typically identified by words such as: “believe”, “expect”, “anticipate”, “intend”, “estimate”, “postulate” and similar expressions, or are those, which, by their nature, refer to future events.  The Company cautions investors that any forward-looking statements by the Company are not guarantees of future results or performance, and that actual results may differ materially from those in forward-looking statements as a result of various factors, including, issues raised during the Company’s due diligence on the Seven Salars Project, operating and technical difficulties in connection with mineral exploration and development activities, actual results of exploration activities, the estimation or realization of mineral reserves and mineral resources, the timing and amount of estimated future production, the costs of production, capital expenditures, the costs and timing of the development of new deposits, requirements for additional capital, future prices of lithium and precious metals, changes in general economic conditions, changes in the financial markets and in the demand and market price for commodities, labour disputes and other risks of the mining industry, delays in obtaining governmental approvals, permits or financing or in the completion of development or construction activities, changes in laws, regulations and policies affecting mining operations, title disputes, the inability of the Company to obtain any necessary permits, consents or authorizations required, including TSXV acceptance of any current or future property acquisitions or financings and other planned activities, the timing and possible outcome of any pending litigation, environmental issues and liabilities, and risks related to joint venture operations, and other risks and uncertainties disclosed in the Company’s latest interim Management’s Discussion and Analysis and filed with certain securities commissions in Canada.  All of the Company’s Canadian public disclosure filings may be accessed via www.sedar.com and readers are urged to review these materials, including the technical reports filed with respect to the Company’s mineral properties.\n\nReaders are cautioned not to place undue reliance on forward-looking statements.  The Company undertakes no obligation to update any of the forward-looking statements in this news release or incorporated by reference herein, except as otherwise required by law.","link":"https:\/\/www.globenewswire.com\/news-release\/2017\/08\/01\/1065451\/0\/en\/Wealth-Signs-Letter-Agreement-to-Acquire-Interest-in-Seven-Salars-Lithium-Project-in-Chile.html","symbols":["ALB.US","EJZN.F","WML.V","WMLCL-SN.SN","WMLLF.US"],"tags":["TSX VENTURE EXCHANGE:WML","WEALTH MINERALS LTD"],"sentiment":{"polarity":1,"neg":0.018,"neu":0.855,"pos":0.127}},{"date":"2017-04-03T12:00:00+00:00","title":"Advantage Lithium JV Hits Lithium in Brines with Two New Holes; Completes 2nd Phase Drilling","content":"VANCOUVER, BRITISH COLUMBIA--(Marketwired - April 3, 2017) -Advantage Lithium Corp. (the \"Company\" or \"Advantage Lithium\") (TSX VENTURE:AAL)(OTCQX:AVLIF) and its joint venture partner, Nevada Sunrise Gold Corp. (\"Nevada Sunrise\"), are pleased to announce that the final two holes of the 2016-2017 drilling campaign at their Clayton Northeast property (\"Clayton NE, or the \"Property\") in Clayton Valley, Nevada, have intersected lithium in brine of up to 238ppm (hole CNE-17-05).\n\nAll six boreholes from the 2016\/17 program intersected lithium-bearing brines in typical Clayton Valley aquifer systems. As a result of interpreted faulting and displacement, the sixth borehole, collared in the southwest end of the Property, passed through a major fault zone and was terminated at a relatively shallow depth.\n\nThe successful conclusion of the Phase 2 drilling follows positive results previously released from the three Phase 1 boreholes drilled in 2016 (see NRs dated November 1, 2016, December 5, 2016, and December 21, 2016) and from the first borehole of the Phase 2 program, hole CNE-17-04 (see NR dated March 1), which delivered the best results to date at Clayton NE, with Total Composite 426.72m of 243.44mg\/l Lithium in Brines.\n\nRoss McElroy, Technical Advisor for Advantage Lithium, commented: \"These results conclude what has been a highly successful program at Clayton NE. Drilling during phase one and two has given us a 5.54 km mineralized brine trend that runs parallel to Albemarle's adjacent Silver Peak project, including drill holes that averaged more than 243mg\/l over wide intervals and with associated excellent brine flow. We have drilled some of the deepest holes in the Clayton Valley region and encountered potentially untested aquifers. We are very pleased with the first systematic drilling program conducted at Clayton NE and look forward to advancing the project further.\"\n\n2017 Drilling Program Highlights\n\nAll three of the Phase 2 boreholes intersected brine-bearing strata containing lithium. Holes CNE-17-04 and CNE-17-05 intersected multiple aquifer formations. Hole CNE-17-06 intersected one narrow aquifer zone:\n\nTotal composite of 426.72ms of brine-producing strata in CNE-17-04 at an average grade of 243.44 mg\/l lithium, including 274.6 mg\/l lithium over 79.2m (530.35m to 609.6m). Total composite of 164.59m of brine-producing strata in CNE-17-05 at an average grade of 72.47 mg\/l lithium, including 101.45 mg\/l lithium over 91.44m (304.8m to 396.24m). Total composite of 6.1 m of brine-producing strata in CNE-17-06 at a grade of 214 mg\/l from a depth interval of 262.13m to 268.22m. Successful extension of mineralized brine trend to 5.54km. Drilling has established strike length of significant lithium-bearing brines over 4.53 kilometres (between holes CNE-16-01 in the southwest of the Property through CNE-17-04 in the northeast). Drilling at CNE-17-06 has extended the trend of anomalous brine over an additional 1.01 kilometres to the southwest (between holes CNE-16-01 and CNE-17-06) for a total lithium-mineralized trend of 5.54km. Nevada Sunrise and Advantage Lithium drilled deeper into potentially untested aquifers. Phase 1 and 2 boreholes targeted areas of deeper aquifers that may not have been commonly intersected by historical drilling in the Clayton Valley. Hole CNE-16-03, from the Phase 1 program, was one of the deepest boreholes drilled in the Clayton Valley and, based on results obtained, may have encountered a previously untested aquifer. Permits\/waivers obtained for future development of a lithium brine resource and wells. In November 2016, waivers were received from the Nevada Division of Water Resources for 5 of the 6 permitted holes, which allows for reaming a borehole to a larger diameter well, pump testing, and flow rate determination in order to provide the necessary technical information for development of an initial lithium brine resource at Clayton NE.\n\nAbout the 2017 Drilling Program\n\nThe Phase 2 drilling program was comprised of a total of 1,389.89m (4,560 feet) in three RC holes and used a similar approach to the Phase 1 program that hit wide intercepts of lithium-bearing brine with strong brine flow rates. All six holes drilled in the 2016-2017 Clayton NE program are adjacent to the Silver Peak lithium brine field operation, North America's only producing lithium mine, operated by Albemarle Corporation (\"Albemarle\") (NYSE: ALB), in close proximity to several of its production wells.\n\nThe second borehole drilled in the Phase 2 program, CNE-17-05, intersected multiple aquifer formations containing brine-producing strata, but with more subdued levels of lithium in brine, which included 164.59m averaging 72.47 milligrams per litre (\"mg\/l\") lithium between a depth of 256.03m and 420.62m metres, including a higher-grade interval averaging 101.45 mg\/l lithium over 91.44m from a depth of 304.8m to 396.24m. The borehole was completed to a depth of 420.62m, terminating in Paleozoic bedrock.\n\nThe third and final Phase 2 borehole, CNE-17-06, passed through the Angel Island Fault Zone and encountered bedrock at a relatively shallow depth of 327.66m, earlier than in previous holes. The hole was completed to a depth of 347.47m, terminating in Paleozoic bedrock. In general, this hole produced relatively low saline-water flow. The exception was the zone from 262.13m to 268.22m that contained strong brine with lithium concentration of 214 mg\/l.\n\nCNE-17-05 - Technical Details\n\nCNE-17-05 was completed to a depth of 420.62 metres (1,380 feet) into Paleozoic bedrock. The stratigraphy in the area of this hole has been affected by faulting and displacement and did not encounter the Main Ash marker unit. Lower lithium concentrations in brine were encountered in the hole than those encountered in other holes in the program. However, lithium concentrations in the zone from 304.8 to 396.24 metres averaged 101.45 mg\/l, over 91.44 metres (300 feet). The highest lithium concentration was 238 mg\/l in the zone from 304.8 to 310.89 metres. The entire sampled interval from 256.03 to 420.62 metres (164.59 metres) averaged 72.47 mg\/l lithium.\n\nCNE-17-06 - Technical Details\n\nCNE-17-06 was completed to a depth of 347.47 metres (1,140 feet). It is interpreted that the hole was collared on the northeast side of the Angel Island Fault and penetrated the Angel Island Fault Zone at a depth of 170.60 metres (560 feet). Sediment cuttings indicate that the drill was in the Lower Gravel Aquifer beneath the fault to depth of 327.66 metres (1,075 feet) where the drill penetrated Paleozoic bedrock. With the exception of the narrow interval from 262.13 to 268.22 metres, this hole produced only weak brines. This interval did, however, produce relatively strong brine with a concentration of 214 mg\/l lithium, high concentrations of other alkali metals, high specific gravity, and brine salinity.\n\nTable 1: Results of Lithium in Brine Samples for CNE-17-05 and CNE-17-06\n\nDrill Hole Aquifer SystemInterval (m) Total Dissolved Solids (TDS) mg\/l Lithium\r\n Range (mg\/l) Lithium\r\n Average Grade (mg\/l) From To Width CNE-17-05 Lower Gravel Aquifer256.03 420.62 164.59 34,000 to 82,200 79.1 to 238 72.47 including304.80 396.24 91.44 34,000 to 82,200 81.3 to 238 101.45CNE-17-06 Lower Gravel Aquifer262.13 268.22 6.1 26,600 NA 214.00\n\nIn addition to brine samples, throughout the 2016-2017 program drill cuttings were collected for each 1.5 metre interval and over 360 samples were submitted for analysis. Analytical results received for the drill cuttings for five holes of the 2016-2017 program indicate significant lithium values in sediments that range up to 1,440 parts per million (\"ppm\") lithium, as shown in Table 2 below. Analytical results for cuttings samples collected from hole CNE-17-06 are pending.\n\nTable 2. Results of Lithium in Sediment Samples for 2016-2017 Drilling Program\n\nDrill Hole Interval (m) Lithium\r\n Range (ppm) Lithium\r\n Average Grade (ppm) From To Width CNE-16-01 164.59 518.16 353.57 93.7 to 1,150 413.83including 298.70 408.43 109.73 382 to 1,150 741.17 CNE-16-02 188.98 426.72 237.74 78.6 to 254 155.76including 256.03 274.32 18.29 217 to 254 228.67 CNE-16-03 188.98 591.31 402.34 71.6 to 770 364.14including 463.30 591.31 128.02 256 to 770 611.68 CNE-17-04 6.1 609.6 603.5 72.7 to 1,060 380.32including 420.62 481.58 60.96 610 to 1,060 779.09 CNE-17-05 73.15 231.65 158.5 610 to 1,440 932.58including 103.63 195.07 91.44 730 to 1,440 1,030.00 CNE-17-06 pending pending pending pending pending\n\nClayton Valley Project Overview\n\nClayton NE consists of 55 unpatented claims totaling approximately 437 hectares (1,080 acres) located in the Clayton Valley sedimentary salar and is contiguous to the eastern boundary of Albemarle's Silver Peak property, North America's only lithium producer; O'Keefe Drilling, of Butte, Montana, has been retained for the Phase 2 program to drill by RC equipment; Several of Albemarle's lithium brine production wells are situated within approximately 100 metres and less of the Clayton NE western claim boundary. Clayton NE is subject to an option earn-in agreement where Advantage Lithium can earn up to a 70% interest in the Project after fulfilling CDN$3.0 million in exploration expenditures on a package of five lithium properties optioned from Nevada Sunrise (for further details, see Nevada Sunrise news release dated June 20, 2016); Nevada Sunrise is the project manager at Clayton NE on behalf of Advantage Lithium, the operator.\n\nFor further information on Clayton NE, including location maps, see the Company's website www.advantagelithium.com.\n\nGroundwater samples were sent to Western Environmental Testing Laboratory in Reno, Nevada for analysis. General chemistry testing included analysis for specific gravity, total hardness and alkalinity, bicarbonate, carbonate, hydroxide, TDS and electrical conductivity. Anions (chloride, sulfate) were analyzed by ion chromatography. Trace metals (lithium, magnesium, boron, calcium, potassium and sodium) were analyzed by ICP-OES. TDS values obtained in the field are measured with a handheld YSI Model 556 Multiparameter Meter, which meets Good Laboratory Practice (as proscribed by the Organization for Economic Cooperation and Development) for calibration and measurement. All depth measurements reported, including sample and interval widths are down-hole. As holes are oriented vertical and geologic stratigraphy is primarily horizontal to sub-horizontal, downhole measurements are assumed to be close to true thickness.\n\nComposite sediment samples were submitted to ALS Minerals in Reno, NV, and analyzed at ALS Minerals in Vancouver, BC. by way of 48-element, four-acid ICP-MS.\n\nThe technical information in this news release has reviewed and approved on behalf of the company by Ross McElroy, P.Geol., Technical Advisor for Advantage Lithium Corp., and a \"Qualified Person\" as defined in NI 43-101.\n\nAbout Advantage Lithium Corp.\n\nAdvantage Lithium Corp. is a resource company specializing in the strategic acquisition, exploration and development of lithium properties and is headquartered in Vancouver, British Columbia. The common shares of the company are listed on the TSX Venture Exchange (TSX VENTURE:AAL), and the company is also traded on the OTCQX Best Market in the U.S. (OTCQX:AVLIF). The company has acquired a 100% interest in five projects in Argentina and up to a 75% interest in a sixth, called Cauchari. Cauchari is host to a near-surface estimated inferred resource of 230 million cubic metres of brine at 380 mg\/l Lithium that equates to 470,000 tonnes of lithium carbonate (LCE), and a large exploration target of 5.6mt to 0.25mt of LCE and 19mt to 0.9 of KCL. Cauchari is located just 20 km south Orocobre's flagship Olaroz Lithium Facility. The Company is also earning an interest from Nevada Sunrise Gold Corp., in a portfolio of five lithium brine projects in the Clayton and Lida Valley regions of Nevada, USA, including 70% in Clayton NE.\n\nFurther information about the Company can be found at www.advantagelithium.com.\n\nADVANTAGE LITHIUM CORP.\n\nPer: David Sidoo, President\n\nCautionary Statement:\n\nCertain information contained in this press release constitutes \"forward-looking information\", within the meaning of Canadian legislation. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as \"is expected\",\"intends\", or \"has the potential to\". Forward looking statements contained in this press release may include statements regarding the future operating or financial performance of Advantage that involve known and unknown risks and uncertainties which may not prove to be accurate. Actual results and outcomes may differ materially from what is expressed or forecasted in these forward-looking statements. Such statements are qualified in their entirety by the inherent risks and uncertainties surrounding future expectations. The forward-looking statements included in this press release are made as of the date of this press release and the Company disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as expressly required by applicable securities legislation.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nContact Information:\n\nAdvantage Lithium Corp.\r\nDavid Sidoo\r\nPresident\r\n604.343.3760\r\n604.683.1585 (FAX)\r\ninfo@advantagelithium.com\r\nwww.advantagelithium.com","link":"https:\/\/www.globenewswire.com\/news-release\/2017\/04\/03\/1351316\/0\/en\/Advantage-Lithium-JV-Hits-Lithium-in-Brines-with-Two-New-Holes-Completes-2nd-Phase-Drilling.html","symbols":["ALB.US"],"tags":["ADVANTAGE LITHIUM CORP"],"sentiment":{"polarity":0.997,"neg":0.03,"neu":0.906,"pos":0.064}},{"date":"2016-06-20T13:00:00+00:00","title":"Resolve Ventures Provides Update Regarding  Neptune Property Option","content":"VANCOUVER, BRITISH COLUMBIA--(Marketwired - June 20, 2016) - Resolve Ventures Inc. (\"Resolve\" or the \"Company\") (TSX VENTURE:RSV) wishes to announce that the Company's Joint Venture and Option Agreement partner, Nevada Sunrise Gold Corporation (\"Nevada Sunrise\") (TSX VENTURE:NEV), has recently announced that it has granted North South Petroleum Corp. (\"North South\") (TSX VENTURE:NAS.H) the right to earn a 50% interest in the Neptune Property should Resolve choose to waive its right to earn a further 25% interest in the Neptune Property.\n\nNeptune Property Option\n\nNevada Sunrise has granted North South the right to earn a 50% interest in the Neptune Property, subject to, among other things:\n\nResolve waiving its right to earn a further 25% interest in the Neptune Property; Nevada Sunrise, Resolve and North South entering into an amending agreement to the existing Neptune Option Agreement between Resolve and Nevada Sunrise, on terms acceptable to all three parties; North South incurring exploration expenditures of CDN$700,000 on the Neptune Property; and North South exercising its option.\n\nIf these conditions are met, a joint venture would be formed between North South (50%), Nevada Sunrise (25%) and Resolve (25%), on substantially the same terms as are set out in the current agreement between Nevada Sunrise and Resolve.\n\nNeptune Property\n\nNeptune consists of 316 unpatented 20-acre placer claims totaling approximately 6,320 acres (2,557 hectares) and is located in an active area of lithium exploration and mining. The Silver Peak lithium mine operation, acquired by Albemarle Corporation (NYSE:ALB) in 2015, has extracted lithium minerals from brines continuously since 1966 and is located approximately 10 miles (15 kilometres) to the north of Neptune. Pure Energy Minerals Ltd. (TSX VENTURE:PE) and Lithium-X Energy Corp. (TSX ENTUREV:LIX) hold claims near or adjacent to the Neptune Property. Nevada Sunrise has an option to earn a 100% interest in Neptune, subject to a 3.0% gross overriding royalty (see Nevada Sunrise's news release dated September 21, 2015 for further details of the Neptune underlying option agreement).\n\nAbout Resolve Ventures\n\nResolve is a junior mineral exploration company based in Vancouver, BC, Canada. Resolve has earned a 25% working interest in Nevada Sunrise's interest in Neptune, and can earn up to a 50% working interest after completing certain cash or share payments to Nevada Sunrise, and by incurring an additional CDN$700,000 in exploration expenditures over a 2-year period (see the Company's news release dated March 4, 2016 for details of the Nevada Sunrise-Resolve option agreement).\n\nFor further information on the Neptune Property, please see the technical report prepared in accordance with National Instrument 43-101, which is dated February 29, 2016, and filed on SEDAR by Resolve on May 3, 2016.\n\nON BEHALF OF THE BOARD OF DIRECTORS\n\nDavid Baker, President and CEO\n\nFORWARD LOOKING STATEMENTS\n\nAll statements in this release, other than statements of historical fact, are \"forward-looking information\" with respect to Resolve within the meaning of applicable Canadian securities laws, including statements that address the Company's use of funds, the future price of lithium, potential quantity and\/or grade of minerals, potential size of a mineralized zone, potential expansion of mineralization, the timing and results of future resource estimates, or other study, proposed exploration and development of our exploration properties, the estimation of mineral resources. Forward-looking information is often, but not always, identified by the use of words such as \"seek\", \"anticipate\", \"plan\", \"continue\", \"estimate\", \"expect\", \"project\", \"predict\", \"potential\", \"targeting\", \"intends\", \"believe\", \"potential\", and similar expressions, or describes a \"goal\", or variation of such words and phrases or state that certain actions, events or results \"may\", \"should\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. These statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievement of Resolve Ventures to differ materially from those anticipated in such forward-looking information.\n\nAlthough Resolve has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information.\n\nForward-looking statements are made as of the date hereof and accordingly are subject to change after such date. Except as otherwise indicated by Resolve, these statements do not reflect the potential impact of any non-recurring or other special items or of any dispositions, monetizations, mergers, acquisitions, other business combinations or other transactions that may be announced or that may occur after the date hereof. Forward-looking statements are provided for the purpose of providing information about management's current expectations and plans and allowing investors and others to get a better understanding of our operating environment. Resolve does not undertake to update any forward-looking statements that are included in this document, except in accordance with applicable securities laws.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of TSX Venture Exchange) accepts responsibility for the adequacy of accuracy of this release.\n\nContact Information:\n\nResolve Ventures Inc.\r\nDavid Baker\r\nPresident and CEO\r\n(604) 817-4211 or (604) 685-3317\r\nwww.resolveventures.com","link":"https:\/\/www.globenewswire.com\/news-release\/2016\/06\/20\/1118949\/0\/en\/Resolve-Ventures-Provides-Update-Regarding-Neptune-Property-Option.html","symbols":["ALB.US"],"tags":["RESOLVE VENTURES INC"],"sentiment":{"polarity":0.997,"neg":0.011,"neu":0.863,"pos":0.125}}]