[{"date":"2019-07-22T12:30:00+00:00","title":"MONDAY DEADLINE ALERT: The Schall Law Firm Announces the Filing of a Class Action Lawsuit Against Livent Corporation and Encourages Investors with Losses in Excess of $100,000 to Contact the Firm","content":"LOS ANGELES, July  22, 2019  (GLOBE NEWSWIRE) -- The Schall Law Firm, a national shareholder rights litigation firm, announces the filing of a class action lawsuit against Livent Corporation (“Livent” or “the Company”) (NYSE: LTHM) for violations of the federal securities laws.\n\nInvestors who purchased the Company’s shares pursuant to and\/or traceable to the Company’s Initial Public Offering in October 2018 (the “IPO”) are encouraged to contact the firm before July 22, 2019.\n\nIf you are a shareholder who suffered a loss, click here to participate.\n\nWe also encourage you to contact Brian Schall of the Schall Law Firm, 1880 Century Park East, Suite 404, Los Angeles, CA 90067, at 424-303-1964, to discuss your rights free of charge. You can also reach us through the firm's website at www.schallfirm.com, or by email at brian@schallfirm.com.\n\nThe class, in this case, has not yet been certified, and until certification occurs, you are not represented by an attorney. If you choose to take no action, you can remain an absent class member.\n\nAccording to the Complaint, the Company made false and misleading statements to the market. Livent’s supply contract with Nemaska Lithium Inc. was terminated. As a result, the Company was forced to fulfill customer contracts using different vendors with unfavorable terms, reducing revenues and lowering margins. Livent had a long-standing contract to supply lithium hydroxide to a customer at a significantly lower price than its existing contacts. When the customer increased its orders, the Company’s margins were further squeezed. Based on these facts, the Company’s public statements were false and materially misleading throughout the IPO period. When the market learned the truth about Livent, investors suffered damages.\n\nJoin the case to recover your losses.\n\nThe Schall Law Firm represents investors around the world and specializes in securities class action lawsuits and shareholder rights litigation.\n\nThis press release may be considered Attorney Advertising in some jurisdictions under the applicable law and rules of ethics.\n\nCONTACT:\n\nThe Schall Law Firm\r\n Brian Schall, Esq.,\r\nwww.schallfirm.com\r\nOffice: 310-301-3335\r\nCell: 424-303-1964\r\ninfo@schallfirm.com\n\nSOURCE:\n\nThe Schall Law Firm","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/22\/1885761\/0\/en\/MONDAY-DEADLINE-ALERT-The-Schall-Law-Firm-Announces-the-Filing-of-a-Class-Action-Lawsuit-Against-Livent-Corporation-and-Encourages-Investors-with-Losses-in-Excess-of-100-000-to-Con.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","LIVENT","LTHM","SCHALL LAW","SCHALL LAW FIRM"],"sentiment":{"polarity":-0.926,"neg":0.113,"neu":0.816,"pos":0.071}},{"date":"2019-07-19T19:00:00+00:00","title":"FINAL DEADLINE ALERT - Livent Corporation (LTHM) - Bronstein, Gewirtz & Grossman, LLC Announces Class Action and Lead Plaintiff Deadline: July 22, 2019","content":"NEW YORK, July  19, 2019  (GLOBE NEWSWIRE) -- Attorney Advertising -- Bronstein, Gewirtz & Grossman, LLC notifies investors that a class action lawsuit has been filed against Livent Corporation (“Livent” or the “Company”) (NYSE: LTHM) and certain of its officers, on behalf of shareholders who purchased or otherwise acquired Livent securities pursuant and\/or traceable to the company’s initial public offering completed in October 2018 (the “IPO” or the “Offering”). Such investors are encouraged to join this case by visiting the firm’s site: www.bgandg.com\/lthm.\n\nThis class action seeks to recover damages against Defendants for alleged violations of the federal securities laws under the Securities Exchange Act of 1933.\n\nIn October 2018, Livent completed its initial public offering (“IPO”), selling 23 million shares of common stock priced at $17.00 per share.  On February 11, 2019, Livent released its fourth quarter 2018 financial results, advising investors that the Company had missed top line sales targets, citing difficulties negotiating contracts with existing customers.  On this news, Livent’s stock price fell $0.57 per share, over 4%, to close at $12.55 per share on February 12, 2019.  Then, on May 8, 2019, Livent announced disappointing financial results for the first quarter of 2019, citing further customer issues.  On this news, Livent’s stock price fell $1.70 per share, nearly 16%, to close at $9.03 per share on May 8, 2019.\n\nThe lawsuit alleges that the Registration Statement was false and\/or contained misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) Livent would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) Livent had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (4) Livent’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\n\nIf you wish to review a copy of the Complaint you can visit the firm’s site: www.bgandg.com\/lthm or you may contact Peretz Bronstein, Esq. or his Investor Relations Analyst, Yael Hurwitz of Bronstein, Gewirtz & Grossman, LLC at 212-697-6484. If you suffered a loss in Livent you have until July 22, 2019 to request that the Court appoint you as lead plaintiff.  A lead plaintiff acts on behalf of all other class members in directing the litigation. The lead plaintiff can select a law firm of its choice. Your ability to share in any recovery doesn't require that you serve as a lead plaintiff.\n\nBronstein, Gewirtz & Grossman, LLC is a corporate litigation boutique.  Our primary expertise is the aggressive pursuit of litigation claims on behalf of our clients.  In addition to representing institutions and other investor plaintiffs in class action security litigation, the firm’s expertise includes general corporate and commercial litigation, as well as securities arbitration.   Attorney advertising. Prior results do not guarantee similar outcomes.\n\nContact:\r\nBronstein, Gewirtz & Grossman, LLC\r\n Peretz Bronstein or Yael Hurwitz \r\n212-697-6484 | info@bgandg.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/19\/1885412\/9788\/en\/FINAL-DEADLINE-ALERT-Livent-Corporation-LTHM-Bronstein-Gewirtz-Grossman-LLC-Announces-Class-Action-and-Lead-Plaintiff-Deadline-July-22-2019.html","symbols":["LTHM.US"],"tags":["BRONSTEIN","CLASS ACTION","GEWIRTZ & GROSSMAN","LLC"],"sentiment":{"polarity":-0.771,"neg":0.108,"neu":0.798,"pos":0.094}},{"date":"2019-07-18T13:03:00+00:00","title":"CLASS ACTION UPDATE for LTHM, HL, FDX and FRED: Levi & Korsinsky, LLP Reminds Investors of Class Actions on Behalf of Shareholders","content":"NEW YORK, July  18, 2019  (GLOBE NEWSWIRE) -- Levi & Korsinsky, LLP announces that class action lawsuits have commenced on behalf of shareholders of the following publicly-traded companies. Shareholders interested in serving as lead plaintiff have until the deadlines listed to petition the court and further details about the cases can be found at the links provided. There is no cost or obligation to you.\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\nLead Plaintiff Deadline: July 22, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/livent-corporation-loss-form?wire=3\n\nAllegations: Livent Corporation made materially false and\/or misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5) as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent Corporation class action contact jlevi@levikorsinsky.com.\n\nHecla Mining Company (NYSE: HL)\r\n Class Period: March 19, 2018 - May 8, 2019\r\nLead Plaintiff Deadline: July 23, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/hecla-mining-company-loss-form?wire=3\n\nAllegations: During the class period, Hecla Mining Company made materially false and\/or misleading statements and\/or failed to disclose that: (a) the Nevada operations were hemorrhaging cash due to a multitude of material problems identified by Defendants during Hecla’s extensive due diligence of the Nevada mines before the  Class Period, and (b) as a result of these material problems, Defendants had no reasonable basis for their representations that the Nevada operations would be in a position to have positive or self-funding cash flow.\n\nTo learn more about the Hecla Mining Company class action contact jlevi@levikorsinsky.com.\n\nFedEx Corporation (NYSE: FDX)\r\n Class Period: September 19, 2017 - December 18, 2018\r\nLead Plaintiff Deadline: August 26, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/fedex-corporation-loss-form?wire=3\n\nAllegations: FedEx Corporation made materially false and\/or misleading statements throughout the class period and\/or failed to disclose that: (1) TNT’s overall package volume growth was slowing as TNT’s large customers permanently took their business to competitors after the Cyberattack; (2) as a result of the customer attrition, TNT was experiencing an increased shift in product mix from higher-margin parcel services to lower-margin freight services; (3) the anticipated costs and timeframe to integrate and restore the TNT network were significantly larger and longer than disclosed; (4) FedEx was not on track to achieve TNT synergy targets; and (5) as a result of these undisclosed negative trends and cost issues, FedEx’s positive statements about TNT’s recovery from the Cyberattack, integration into FedEx’s legacy operations, customer mix, customer service levels, profitability, and prospects lacked a reasonable basis.\n\nTo learn more about the FedEx Corporation class action contact jlevi@levikorsinsky.com.\n\nFred's, Inc. (NASDAQGS: FRED)\r\n Class Period: December 20, 2016 - June 28, 2017\r\nLead Plaintiff Deadline: August 27, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/freds-inc-loss-form?wire=3\n\nAccording to the filed complaint, defendants made numerous materially false and misleading statements concerning the level of regulatory risk faced by the Original Merger and the Revised Merger which would ultimately cause the termination of the Fred’s Asset Purchase Agreement. Specifically, Defendants made false and\/or misleading statements: (i) downplaying or disputing contrary reports from journalists signaling regulatory turbulence in closing the merger; (ii) representing that inside knowledge of the FTC gave confidence that the deal would close.\n\nTo learn more about the Fred's, Inc. class action contact jlevi@levikorsinsky.com.\n\nYou have until the lead plaintiff deadlines to request the court appoint you as lead plaintiff. Your ability to share in any recovery doesn’t require that you serve as a lead plaintiff.\n\nLevi & Korsinsky is a national firm with offices in New York, California, Connecticut, and Washington D.C. The firm’s attorneys have extensive expertise and experience representing investors in securities litigation and have recovered hundreds of millions of dollars for aggrieved shareholders. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nLevi & Korsinsky, LLP\r\nJoseph E. Levi, Esq.\r\n55 Broadway, 10th Floor\r\nNew York, NY 10006\r\njlevi@levikorsinsky.com\r\nTel: (212) 363-7500\r\nFax: (212) 363-7171\r\nwww.zlk.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/18\/1884670\/3080\/en\/CLASS-ACTION-UPDATE-for-LTHM-HL-FDX-and-FRED-Levi-Korsinsky-LLP-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders.html","symbols":["FDX.US","HL.US","LTHM.US"],"tags":["CLASS ACTION","LEVI & KORSINSKY","LLP"],"sentiment":{"polarity":0.488,"neg":0.075,"neu":0.847,"pos":0.079}},{"date":"2019-07-18T01:30:00+00:00","title":"Bragar Eagel & Squire, P.C. Reminds Investors That Class Action Lawsuits Have Been Filed Against Floor & Decor Holdings, PriceSmart, RCI Hospitality Holdings, and Livent Corporation and Encourages Investors to Contact the Firm","content":"NEW YORK, July  17, 2019  (GLOBE NEWSWIRE) -- Bragar Eagel & Squire, P.C. reminds investors that class action lawsuits have been commenced on behalf of stockholders of Floor & Decor Holdings, Inc., PriceSmart, Inc., RCI Hospitality Holdings, Inc., and Livent Corporation. Stockholders have until the deadlines below to petition the court to serve as lead plaintiff. Additional information about each case can be found at the link provided.\n\nFloor & Decor Holdings, Inc. (NYSE: FND)\n\nClass Period: May 23, 2018 to August 1, 2018\n\nLead Plaintiff Deadline: July 19, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made false and misleading statements and\/or failed to disclose adverse information regarding Floor & Decor’s business and prospects.  Specifically, the complaint alleges that each of the statements in the Registration Statement filed with the SEC regarding the current financial condition of the company were materially false and misleading.  The complaint alleges that prior to the May 24 Secondary Offering, defendants knew, but failed to disclose, that the company had already begun to experience declining sales trends that would ultimately result in the reduction of its fiscal 2018 sales and adjusted earnings per share guidance, which had been increased as recently as May 2018.  As a result of this adverse information being withheld from the market, the price of the company’s stock was artificially inflated during the Class Period, allowing company insiders to sell more than 10.3 million shares of Floor & Decor common stock, including the shares sold in the May 24 Secondary Offering, for proceeds of more than $466 million.\n\nTo learn more about the Floor & Decor class action go to: http:\/\/bespc.com\/fnd-2\n\nPriceSmart, Inc. (NASDAQ: PSMT)\n\nLead Plaintiff Deadline: July 22, 2019\n\nClass Period: October 26, 2017 to October 25, 2018\n\nThe complaint alleges that throughout the Class Period, defendants made materially false and\/or misleading statements, as well as failed to disclose material adverse facts about the company’s business, operations, and prospects.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) the company’s omni-channel business strategy had failed to reach key operating goals; (2) the company’s South America distribution strategy had failed to realize key cost saving goals; (3) the company had invested Trinidad and Tobago dollars into certificates of deposits with financial institutions; (4) these investments had been improperly classified as cash and cash equivalents; (5) the relevant corrections would materially impact financial statements; (6) there was a material weakness in the company’s internal controls over financial reporting; (7) increasing competition negatively impacted the company’s revenue and profitability; and (8) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nFor more information on the PriceSmart class action go to: https:\/\/bespc.com\/pricesmart\/\n\nRCI Hospitality Holdings, Inc. (NASDAQ: RICK)\n\nClass Period: August 8, 2017 to May 10, 2019\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made materially false and\/or misleading statements, as well as failed to disclose material adverse facts about the company’s business, operations, and prospects.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) the company engaged in numerous transactions with the CEO, including lending him significant sums of money; (2) these practices were reasonably likely to lead to regulatory scrutiny of the company; (3) as a result of investigations into the company’s governance, the company would be unable to timely file its financial statements; and (4) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects were materially false and\/or misleading and\/or lacked a reasonable basis\n\nFor more information on the RCI Hospitality Holdings class action go to: https:\/\/bespc.com\/rick\/\n\nLivent Corporation (NYSE: LTHM)\n\nClass Period: October 7, 2018 to May 22, 2019 (the “Class Period”) or Securities pursuant to and\/or traceable to the Initial Public Offering (“IPO”) on or about October 12, 2018\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that the Registration Statement was false and misleading and omitted to state material adverse facts.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the company’s existing contracts; (4) the company’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent class action go to: http:\/\/www.bespc.com\/lthm\n\nBragar Eagel & Squire, P.C. is a New York-based law firm concentrating in commercial and securities litigation. For additional information about Bragar Eagel & Squire, P.C. please go to www.bespc.com. Attorney advertising.  Prior results do not guarantee similar outcomes.\n\nContacts\r\nBragar Eagel & Squire, P.C.\r\nBrandon Walker, Esq.\r\nMelissa Fortunato, Esq.\r\n(212) 355-4648\r\ninvestigations@bespc.com\r\nwww.bespc.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/18\/1884336\/0\/en\/Bragar-Eagel-Squire-P-C-Reminds-Investors-That-Class-Action-Lawsuits-Have-Been-Filed-Against-Floor-Decor-Holdings-PriceSmart-RCI-Hospitality-Holdings-and-Livent-Corporation-and-Enc.html","symbols":["FND.US","LTHM.US","PSMT.US","RICK.US"],"tags":["BRAGAR EAGEL & SQUIRE","CLASS ACTION","FLOOR & DECOR HOLDINGS","INC","LIVENT CORPORATION","PRICESMART","RCI HOSPITALITY HOLDINGS","SHAREHOLDER"],"sentiment":{"polarity":-0.993,"neg":0.118,"neu":0.814,"pos":0.068}},{"date":"2019-07-17T13:17:00+00:00","title":"The Klein Law Firm Reminds Investors of Class Actions on Behalf of Shareholders of LTHM, ASNA, BUD and EQT","content":"NEW YORK, July  17, 2019  (GLOBE NEWSWIRE) -- The Klein Law Firm announces that class action complaints have been filed on behalf of shareholders of the following companies. If you suffered a loss you have until the lead plaintiff deadline to request that the court appoint you as lead plaintiff.\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\n Lead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that during the class period Livent Corporation made materially false and\/or misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5) as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nGet additional information about the LTHM lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/livent-corporation-loss-submission-form?wire=3\n\nAscena Retail Group, Inc. (NASDAQGS: ASNA)\r\n Class Period: September 16, 2015 to June 8, 2017\r\n Lead Plaintiff Deadline: August 6, 2019\n\nAccording to the complaint, Ascena Retail Group, Inc. allegedly made materially false and\/or misleading statements and\/or failed to disclose that: (a) the ANN Acquisition was a complete disaster for the Company as Ann’s operations were in far worse condition than had been represented to the public; (b) in order to mask the true condition of Ann, Defendants improperly delayed recognizing an impairment charge to the value of Ann’s goodwill and, as a result, Ascena’s reported income and assets were materially overstated and the Company’s financial results were not prepared in conformity with GAAP; (c) many of the brands acquired in the ANN Acquisition were in steep decline and were also materially overvalued on Ascena’s Class Period financial statements; and (d) as a result of the foregoing, Defendants lacked a reasonable basis for their positive statements about the Company, its operations and prospects.\n\nGet additional information about the ASNA lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/ascena-retail-group-inc-loss-submission-form?wire=3\n\nAnheuser-Busch Inbev Sa\/Nv (NYSE: BUD)\r\n Class Period: March 1, 2018 to October 24, 2018\r\n Lead Plaintiff Deadline: August 20, 2019\n\nAccording to the filed complaint, Defendants issued a steady stream of materially false and misleading reassurances about Anheuser Busch’s deleveraging efforts, cost cutting measures, EBITDA growth, the sufficiency of its liquidity and its debt maturity profile during the Class Period. These positive statements by Defendants created a false impression and materially misled investors about the Company’s finances, including the sustainability of Anheuser-Busch’s dividends. Once Defendants chose to speak about Anheuser-Busch’s finances, they had a duty to speak completely and truthfully, including speaking about those factors that were then having a material adverse effect on the Company’s deleveraging efforts.\n\nGet additional information about the BUD lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/anheuser-busch-inbev-sa-nv-loss-submission-form?wire=3\n\nEQT Corporation (NYSE: EQT)\r\n Class Period: June 19, 2017 to October 24, 2018\r\n Lead Plaintiff Deadline: August 26, 2019\n\nThe complaint alleges EQT Corporation made materially false and\/or misleading statements and\/or failed to disclose that: (1) land acquired by the Rice Energy merger was not contiguous with the Company’s previously held acreage, which reduced the purported synergy benefits; (2) the purported longer lateral wells were not feasible because of intervening third-party parcels or prior drilling by EQT, Rice, or third parties; and (3) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nGet additional information about the EQT lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/eqt-corporation-loss-submission-form?wire=3\n\nYour ability to share in any recovery doesn’t require that you serve as a lead plaintiff. There is no cost or obligation to you. If you suffered a loss during the class period and wish to obtain additional information, please contact J. Klein, Esq. by telephone at 212-616-4899 or visit the webpages provided.\n\nJ. Klein, Esq. represents investors and participates in securities litigations involving financial fraud throughout the nation. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nJ. Klein, Esq.\r\nEmpire State Building\r\n350 Fifth Avenue\r\n59th Floor\r\nNew York, NY 10118\r\njk@kleinstocklaw.com\r\nTelephone: (212) 616-4899\r\nFax: (347) 558-9665\r\nwww.kleinstocklaw.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/17\/1884031\/0\/en\/The-Klein-Law-Firm-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders-of-LTHM-ASNA-BUD-and-EQT.html","symbols":["BUD.US","EQT.US","LTHM.US"],"tags":["CLASS ACTION","THE KLEIN LAW FIRM"],"sentiment":{"polarity":-0.955,"neg":0.11,"neu":0.805,"pos":0.085}},{"date":"2019-07-17T11:10:00+00:00","title":"LTHM Investor Alert: Deadline on July 22nd in Lawsuit against Livent Corporation announced by Shareholders Foundation","content":"SAN DIEGO, July  17, 2019  (GLOBE NEWSWIRE) -- The Shareholders Foundation, Inc. announces that a deadline is coming up in the lawsuit for certain investors in shares of Livent Corporation.\n\nInvestors, who purchased shares of Livent Corporation (NYSE: LTHM), have certain options and for certain investors are short and strict deadlines running. Deadline: July 22, 2019. NYSE: LTHM investors should contact the Shareholders Foundation at mail@shareholdersfoundation.com or call +1(858) 779 - 1554.\n\nThe plaintiff alleges that the defendants failed to disclose to investors that a supply contract with Nemaska Lithium Inc. had been terminated, that, as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins, that the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company’s existing contracts, that the Company’s margins were squeezed due to the customer’s increased orders, and that, as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nThose who purchased Livent Corporation (NYSE: LTHM) shares should contact the Shareholders Foundation, Inc.\n\nCONTACT:\r\nShareholders Foundation, Inc. \r\n Michael Daniels \r\n +1 (858) 779-1554 \r\nmail@shareholdersfoundation.com \r\n 3111 Camino Del Rio North \r\n Suite 423 \r\n San Diego, CA 92108\n\nThe Shareholders Foundation, Inc. is a professional portfolio legal monitoring and a settlement claim filing service, which does research related to shareholder issues and informs investors of securities class actions, settlements, judgments, and other legal related news to the stock\/financial market. The Shareholders Foundation, Inc. is not a law firm. Any referenced cases, investigations, and\/or settlements are not filed\/initiated\/reached and\/or are not related to Shareholders Foundation. The information is only provided as a public service. It is not intended as legal advice and should not be relied upon.","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/17\/1883876\/12089\/en\/LTHM-Investor-Alert-Deadline-on-July-22nd-in-Lawsuit-against-Livent-Corporation-announced-by-Shareholders-Foundation.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","INC","LAWSUIT","LIVENT CORPORATION","LTHM","NYSE: LTHM","SHAREHOLDERS FOUNDATION"],"sentiment":{"polarity":0.857,"neg":0.052,"neu":0.857,"pos":0.091}},{"date":"2019-07-16T17:36:00+00:00","title":"LIVENT 6 DAY CLASS ACTION DEADLINE: Bernstein Liebhard LLP Announces That Approximately 6 Days Remain to Make a Motion for Lead Plaintiff in a Securities Class Action Lawsuit Against the Livent Corporation – LTHM","content":"NEW YORK, July  16, 2019  (GLOBE NEWSWIRE) -- Bernstein Liebhard LLP, a nationally acclaimed investor rights law firm, announced that approximately six days remain to make a motion to serve as a lead plaintiff in a class action pending against the Livent Corporation (“Livent,” “LTHM” or the “Company”) (NYSE: LTHM) pursuant to or traceable to Livent’s initial public offering (“IPO”) on or around October 12, 2018.\n\nIf you purchased Livent securities, and\/or would like to discuss your legal rights and options, please visit Livent LTHM Shareholder Class Action Lawsuit or contact Matthew Guarnero toll free at (877) 779-1414 or MGuarnero@bernlieb.com.\n\nThe complaint, which is pending in the United States District Court for the Eastern District of Pennsylvania, alleges that Defendants violated the Securities Act of 1933. If you wish to serve as lead plaintiff in the Livent Securities Class Action you must move the Court no later than July 22, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. Your ability to share in any recovery does not require that you serve as lead plaintiff. If you choose to take no action, you may remain an absent class member.\n\nAccording to the lawsuit, Defendants made false and\/or misleading statements in the offering documents relating to the IPO, including failing to disclose that: (i) a supply contract with Nemaska Lithium Inc. had been terminated; (ii) the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (iii) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (iv) the Company’s margins were squeezed due to that customer’s increased orders; and (v) as a result of the foregoing, Defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nOn February 11, 2019, Livent released its fourth quarter 2018 financial results that missed top line sales targets, citing difficulties negotiating contracts with existing customers. On this news, Livent’s share price fell $0.57, over 4%, to close at $12.55 per share on February 12, 2019.\n\nOn May 8, 2019, Livent announced disappointing financial results for first quarter 2019, citing further customer issues. On this news, the Company’s share price fell $1.70, nearly 16%, to close at $9.03 per share on May 8, 2019.\n\nIf you purchased Livent securities, and\/or would like to discuss your legal rights and options, please visit https:\/\/www.bernlieb.com\/cases\/livent-corporation-lthm-class-action-lawsuit-fraud-stock-133\/ or contact Matthew Guarnero toll free at (877) 779-1414 or MGuarnero@bernlieb.com.\n\nSince 1993, Bernstein Liebhard LLP has recovered over $3.5 billion for its clients. In addition to representing individual investors, the Firm has been retained by some of the largest public and private pension funds in the country to monitor their assets and pursue litigation on their behalf. As a result of its success litigating hundreds of lawsuits and class actions, the Firm has been named to The National Law Journal’s “Plaintiffs’ Hot List” thirteen times and listed in The Legal 500 for ten consecutive years.\n\nATTORNEY ADVERTISING. © 2019 Bernstein Liebhard LLP. The law firm responsible for this advertisement is Bernstein Liebhard LLP, 10 East 40th Street, New York, New York 10016, (212) 779-1414. The lawyer responsible for this advertisement in the State of Connecticut is Michael S. Bigin.  Prior results do not guarantee or predict a similar outcome with respect to any future matter.\n\nContact Information\n\nMatthew Guarnero\r\n Bernstein Liebhard LLP\r\nhttps:\/\/www.bernlieb.com\r\n (877) 779-1414\r\nMGuarnero@bernlieb.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/16\/1883606\/0\/en\/LIVENT-6-DAY-CLASS-ACTION-DEADLINE-Bernstein-Liebhard-LLP-Announces-That-Approximately-6-Days-Remain-to-Make-a-Motion-for-Lead-Plaintiff-in-a-Securities-Class-Action-Lawsuit-Agains.html","symbols":["LTHM.US"],"tags":["BERNSTEIN LIEBHARD LLP","CLASS ACTION"],"sentiment":{"polarity":0.982,"neg":0.069,"neu":0.807,"pos":0.124}},{"date":"2019-07-15T23:30:00+00:00","title":"ROSEN, A TOP RANKED LAW FIRM, Reminds Livent Corporation Investors of Important July 22nd Deadline in Securities Class Action Lawsuit – LTHM","content":"NEW YORK, July  15, 2019  (GLOBE NEWSWIRE) -- Rosen Law Firm, a global investor rights law firm, reminds purchasers of the securities of Livent Corporation (NYSE: LTHM) pursuant and\/or traceable to Livent’s false and\/or misleading registration statement and prospectus (collectively, the “Registration Statement”) issued in connection with Livent’s initial public offering completed in October 2018 (the “IPO”) of the important July 22, 2019 lead plaintiff deadline in securities class action. The lawsuit seeks to recover damages for Livent investors under the federal securities laws.\r\n\r\nTo join the Livent class action, go to http:\/\/www.rosenlegal.com\/cases-register-1579.html or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action. \r\n\r\nNO CLASS HAS YET BEEN CERTIFIED IN THE ABOVE ACTION. UNTIL A CLASS IS CERTIFIED, YOU ARE NOT REPRESENTED BY COUNSEL UNLESS YOU RETAIN ONE. YOU MAY RETAIN COUNSEL OF YOUR CHOICE. YOU MAY ALSO REMAIN AN ABSENT CLASS MEMBER AND DO NOTHING AT THIS POINT. AN INVESTOR’S ABILITY TO SHARE IN ANY POTENTIAL FUTURE RECOVERY IS NOT DEPENDENT UPON SERVING AS LEAD PLAINTIFF.\r\n\r\nAccording to the lawsuit, the Registration Statement was false and\/or contained misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) Livent would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) Livent had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (4) Livent’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\r\n\r\nA class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than July 22, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. If you wish to join the litigation, go to http:\/\/www.rosenlegal.com\/cases-register-1579.html or to discuss your rights or interests regarding this class action, please contact Phillip Kim, Esq. of Rosen Law Firm toll free at 866-767-3653 or via e-mail at pkim@rosenlegal.com or cases@rosenlegal.com.\n\nFollow us for updates on LinkedIn: https:\/\/www.linkedin.com\/company\/the-rosen-law-firm, on Twitter: https:\/\/twitter.com\/rosen_firm or on Facebook: https:\/\/www.facebook.com\/rosenlawfirm\/.\n\nRosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 3 each year since 2013.  Rosen Law Firm has secured hundreds of millions of dollars for investors. Attorney advertising. Prior results do not guarantee future outcomes.\n\nContact Information:\r\n Laurence Rosen, Esq.\r\n Phillip Kim, Esq.\r\n The Rosen Law Firm, P.A.\r\n 275 Madison Avenue, 34th Floor\r\n New York, NY  10016\r\n Tel: (212) 686-1060\r\n Toll Free: (866) 767-3653\r\n Fax: (212) 202-3827\r\n lrosen@rosenlegal.com\r\n pkim@rosenlegal.com\r\n cases@rosenlegal.com\r\n www.rosenlegal.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/15\/1883020\/673\/en\/ROSEN-A-TOP-RANKED-LAW-FIRM-Reminds-Livent-Corporation-Investors-of-Important-July-22nd-Deadline-in-Securities-Class-Action-Lawsuit-LTHM.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","THE ROSEN LAW FIRM PA"],"sentiment":{"polarity":0.924,"neg":0.088,"neu":0.799,"pos":0.113}},{"date":"2019-07-15T13:40:00+00:00","title":"7-DAY DEADLINE ALERT: The Schall Law Firm Announces the Filing of a Class Action Lawsuit Against Livent Corporation and Encourages Investors with Losses in Excess of $100,000 to Contact the Firm","content":"LOS ANGELES, July  15, 2019  (GLOBE NEWSWIRE) -- The Schall Law Firm, a national shareholder rights litigation firm, announces the filing of a class action lawsuit against Livent Corporation (“Livent” or “the Company”) (NYSE: LTHM) for violations of the federal securities laws.\n\nInvestors who purchased the Company’s shares pursuant to and\/or traceable to the Company’s Initial Public Offering in October 2018 (the “IPO”) are encouraged to contact the firm before July 22, 2019.\n\nIf you are a shareholder who suffered a loss, click here to participate.\n\nWe also encourage you to contact Brian Schall of the Schall Law Firm, 1880 Century Park East, Suite 404, Los Angeles, CA 90067, at 424-303-1964, to discuss your rights free of charge. You can also reach us through the firm's website at www.schallfirm.com, or by email at brian@schallfirm.com.\n\nThe class, in this case, has not yet been certified, and until certification occurs, you are not represented by an attorney. If you choose to take no action, you can remain an absent class member.\n\nAccording to the Complaint, the Company made false and misleading statements to the market. Livent’s supply contract with Nemaska Lithium Inc. was terminated. As a result, the Company was forced to fulfill customer contracts using different vendors with unfavorable terms, reducing revenues and lowering margins. Livent had a long-standing contract to supply lithium hydroxide to a customer at a significantly lower price than its existing contacts. When the customer increased its orders, the Company’s margins were further squeezed. Based on these facts, the Company’s public statements were false and materially misleading throughout the IPO period. When the market learned the truth about Livent, investors suffered damages.\n\nJoin the case to recover your losses.\n\nThe Schall Law Firm represents investors around the world and specializes in securities class action lawsuits and shareholder rights litigation.\n\nThis press release may be considered Attorney Advertising in some jurisdictions under the applicable law and rules of ethics.\n\nCONTACT:\n\nThe Schall Law Firm\r\n Brian Schall, Esq.,\r\nwww.schallfirm.com\r\nOffice: 310-301-3335\r\nCell: 424-303-1964\r\ninfo@schallfirm.com\n\nSOURCE:\n\nThe Schall Law Firm","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/15\/1882724\/0\/en\/7-DAY-DEADLINE-ALERT-The-Schall-Law-Firm-Announces-the-Filing-of-a-Class-Action-Lawsuit-Against-Livent-Corporation-and-Encourages-Investors-with-Losses-in-Excess-of-100-000-to-Cont.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","LIVENT","LTHM","SCHALL LAW","SCHALL LAW FIRM"],"sentiment":{"polarity":-0.926,"neg":0.113,"neu":0.816,"pos":0.071}},{"date":"2019-07-12T20:42:00+00:00","title":"CLASS ACTION UPDATE for PSMT, LTHM, RLGY and FRED: Levi & Korsinsky, LLP Reminds Investors of Class Actions on Behalf of Shareholders","content":"NEW YORK, July  12, 2019  (GLOBE NEWSWIRE) -- Levi & Korsinsky, LLP announces that class action lawsuits have commenced on behalf of shareholders of the following publicly-traded companies. Shareholders interested in serving as lead plaintiff have until the deadlines listed to petition the court and further details about the cases can be found at the links provided. There is no cost or obligation to you.\n\nPriceSmart, Inc. (NASDAQGS: PSMT)\r\n Class Period: October 26, 2017 - October 25, 2018\r\nLead Plaintiff Deadline: July 22, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/pricesmart-inc-loss-form?wire=3\n\nAllegations: PriceSmart, Inc. made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company’s omni-channel business strategy had failed to reach key operating goals; (2) the Company’s South America distribution strategy had failed to realize key cost saving goals; (3) the Company had invested Trinidad and Tobago dollars into certificates of deposits with financial institutions; (4) that these investments had been improperly classified as cash and cash equivalents; (5) the relevant corrections would materially impact financial statements; (6) there was a material weakness in the Company’s internal controls over financial reporting; (7) increasing competition negatively impacted the Company’s revenue and profitability; and (8) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the PriceSmart, Inc. class action contact jlevi@levikorsinsky.com.\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\nLead Plaintiff Deadline: July 22, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/livent-corporation-loss-form?wire=3\n\nAllegations: Livent Corporation made materially false and\/or misleading statements throughout the class period and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5) as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent Corporation class action contact jlevi@levikorsinsky.com.\n\nRealogy Holdings Corp. (NYSE: RLGY)\r\n Class Period: February 24, 2017 - May 22, 2019\r\nLead Plaintiff Deadline: September 9, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/realogy-holdings-corp-loss-form?wire=3\n\nAllegations: Realogy Holdings Corp. made materially false and\/or misleading statements and\/or failed to disclose that: (1) Realogy was engaged in anticompetitive behavior by requiring property sellers to pay the commissions of a buyer’s broker at an inflated rate; (2) Realogy’s anticompetitive actions would prompt the U.S. Department of Justice (“DOJ”) to open an antitrust investigation into the real estate industry’s practices regarding brokers’ commissions; and (3) as a result, Defendants’ statements about the Realogy’s business, operations and prospects were materially false and misleading and\/or lacked a reasonable basis at all relevant times.\n\nTo learn more about the Realogy Holdings Corp. class action contact jlevi@levikorsinsky.com.\n\nFred's, Inc. (NASDAQGS: FRED)\r\n Class Period: December 20, 2016 - June 28, 2017\r\nLead Plaintiff Deadline: August 27, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/freds-inc-loss-form?wire=3\n\nAccording to the filed complaint, defendants made numerous materially false and misleading statements concerning the level of regulatory risk faced by the Original Merger and the Revised Merger which would ultimately cause the termination of the Fred’s Asset Purchase Agreement. Specifically, Defendants made false and\/or misleading statements: (i) downplaying or disputing contrary reports from journalists signaling regulatory turbulence in closing the merger; (ii) representing that inside knowledge of the FTC gave confidence that the deal would close.\n\nTo learn more about the Fred's, Inc. class action contact jlevi@levikorsinsky.com.\n\nYou have until the lead plaintiff deadlines to request the court appoint you as lead plaintiff. Your ability to share in any recovery doesn’t require that you serve as a lead plaintiff.\r\n\r\nLevi & Korsinsky is a national firm with offices in New York, California, Connecticut, and Washington D.C. The firm’s attorneys have extensive expertise and experience representing investors in securities litigation and have recovered hundreds of millions of dollars for aggrieved shareholders. Attorney advertising. Prior results do not guarantee similar outcomes.\r\n\r\nCONTACT:\r\nLevi & Korsinsky, LLP\r\nJoseph E. Levi, Esq.\r\n55 Broadway, 10th Floor\r\nNew York, NY 10006\r\njlevi@levikorsinsky.com\r\nTel: (212) 363-7500\r\nFax: (212) 363-7171\r\nwww.zlk.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/12\/1882212\/3080\/en\/CLASS-ACTION-UPDATE-for-PSMT-LTHM-RLGY-and-FRED-Levi-Korsinsky-LLP-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders.html","symbols":["LTHM.US","RLGY.US"],"tags":["CLASS ACTION","LEVI & KORSINSKY","LLP"],"sentiment":{"polarity":-0.696,"neg":0.081,"neu":0.844,"pos":0.075}},{"date":"2019-07-12T19:00:00+00:00","title":"Class Action Reminder – FND, RICK & LTHM - Bronstein, Gewirtz & Grossman, LLC","content":"NEW YORK, July  12, 2019  (GLOBE NEWSWIRE) -- Attorney Advertising -- Bronstein, Gewirtz & Grossman, LLC reminds investors that a class action lawsuit has been filed against the following publicly-traded companies. You can review a copy of the Complaints by visiting the links below or you may contact Peretz Bronstein, Esq. or his Investor Relations Analyst, Yael Hurwitz of Bronstein, Gewirtz & Grossman, LLC at 212-697-6484. If you suffered a loss, you can request that the Court appoint you as lead plaintiff.  Your ability to share in any recovery doesn't require that you serve as a lead plaintiff. A lead plaintiff acts on behalf of all other class members in directing the litigation. The lead plaintiff can select a law firm of its choice. An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\n\nFloor & Decor Holdings, Inc. (NYSE: FND)\r\nClass Period: May 23, 2018 - August 1, 2018\r\nDeadline: July 19, 2019 For more info:www.bgandg.com\/fnd\n\nThe complaint alleges that throughout the Floor & Decor’s May 24, 2018 Secondary Offering documents included false and misleading statements. Specifically, the complaint alleges that the defendants knew but failed to disclose that the company had already begun to experience declining sales trends that would ultimately result in the reduction of its fiscal 2018 sales and adjusted earnings per share guidance, which the company publicly increased in May 2018. While the company’s stock was artificially inflated, insiders sold more than 10.3 million shares of Floor & Decor common stock, including shares sold in the May 24, 2018 Secondary Offering.\n\nRCI Hospitality Holdings, Inc. (NASDAQ: RICK) \r\nClass Period: August 10, 2017 - May 10, 2019\r\nDeadline: July 22, 2019 For more info:www.bgandg.com\/rick\r\nThe complaint alleges that throughout the Class Period, defendants made false and\/or misleading statements and\/or failed to disclose that: (1) RCI engaged in numerous transactions with Eric Langan, RCI’s CEO, including lending him large amounts of money; (2) these practices were likely to lead to investigations of RCI by regulators; (3) investigations into RCI’s corporate governance would harm RCI’s prospects by, among other things, causing it to be unable to timely file its financial statements; and (4) as a result, Defendants’ statements about RCI’s business, operations and prospects were materially false and misleading and\/or lacked a reasonable basis at all relevant times.\n\nLivent Corporation (NYSE: LTHM)\r\nClass Period: Livent securities purchased pursuant and\/or traceable to the company’s initial public offering completed in October 2018 (the “IPO” or the “Offering”).\r\nDeadline: July 22, 2019 For more info:www.bgandg.com\/lthm\n\nThe lawsuit alleges that the Registration Statement was false and\/or contained misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) Livent would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) Livent had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (4) Livent’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\n\nContact:\r\nBronstein, Gewirtz & Grossman, LLC\r\n Peretz Bronstein or Yael Hurwitz \r\n212-697-6484 | info@bgandg.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/12\/1882168\/9788\/en\/Class-Action-Reminder-FND-RICK-LTHM-Bronstein-Gewirtz-Grossman-LLC.html","symbols":["FND.US","LTHM.US","RICK.US"],"tags":["BRONSTEIN","CLASS ACTION","GEWIRTZ & GROSSMAN","LLC"],"sentiment":{"polarity":-0.977,"neg":0.118,"neu":0.804,"pos":0.078}},{"date":"2019-07-11T15:10:00+00:00","title":"LEAD PLAINTIFF DEADLINE ALERT: Faruqi & Faruqi, LLP Encourages Investors Who Suffered Losses Exceeding $50,000 Investing In Livent Corporation To Contact The Firm","content":"NEW YORK, July  11, 2019  (GLOBE NEWSWIRE) -- Faruqi & Faruqi, LLP, a leading national securities law firm, reminds investors in Livent Corporation (\"Livent\" or the \"Company\")(NYSE:LTHM) of the July 22, 2019 deadline to seek the role of lead plaintiff in a federal securities class action that has been filed against the Company.\n\nIf you invested in Livent stock or options pursuant and\/or traceable to the Company's October 2018 initial public offering (\"IPO\") and would like to discuss your legal rights, click here: www.faruqilaw.com\/LTHM. There is no cost or obligation to you.\n\nYou can also contact us by calling Richard Gonnello toll free at 877-247-4292 or at 212-983-9330 or by sending an e-mail to rgonnello@faruqilaw.com.\n\nCONTACT:\r\n FARUQI & FARUQI, LLP \r\n 685 Third Avenue, 26th Floor \r\n New York, NY 10017 \r\n Attn:  Richard Gonnello, Esq. \r\nrgonnello@faruqilaw.com \r\n Telephone: (877) 247-4292 or (212) 983-9330\n\nThe lawsuit has been filed in the U.S. District Court for the Eastern District of Pennsylvania on behalf of all those who purchased Livent securities pursuant and\/or traceable to the Company's October 2018 IPO. The case, Nikolov v. Livent Corporation et al., No. 19-cv-19-cv-02218-CFK was filed on May 22, 2019 and has been assigned to Judge Chad F. Kenney.\n\nThe lawsuit focuses on whether the Company and its executives violated federal securities laws by failing to disclose to investors: (1) that a supply contract with Nemaska Lithium Inc. had been terminated; (2) that, as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) that the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) that the Company's margins were squeezed due to the customer's increased orders; and (5) that, as a result of the foregoing, Defendants' positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nSince Livent's October 2018 IPO, the Company's share price has declined from its IPO price of $17 by approximately 60%.\n\nThe court-appointed lead plaintiff is the investor with the largest financial interest in the relief sought by the class who is adequate and typical of class members who directs and oversees the litigation on behalf of the putative class. Any member of the putative class may move the Court to serve as lead plaintiff through counsel of their choice, or may choose to do nothing and remain an absent class member. Your ability to share in any recovery is not affected by the decision to serve as a lead plaintiff or not.\n\nFaruqi & Faruqi, LLP also encourages anyone with information regarding Livent's conduct to contact the firm, including whistleblowers, former employees, shareholders and others.\n\nAttorney Advertising. The law firm responsible for this advertisement is Faruqi & Faruqi, LLP (www.faruqilaw.com). Prior results do not guarantee or predict a similar outcome with respect to any future matter. We welcome the opportunity to discuss your particular case. All communications will be treated in a confidential manner.","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/11\/1881558\/683\/en\/LEAD-PLAINTIFF-DEADLINE-ALERT-Faruqi-Faruqi-LLP-Encourages-Investors-Who-Suffered-Losses-Exceeding-50-000-Investing-In-Livent-Corporation-To-Contact-The-Firm.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","FARUQI & FARUQI LLP"],"sentiment":{"polarity":0.977,"neg":0.052,"neu":0.841,"pos":0.107}},{"date":"2019-07-11T13:24:00+00:00","title":"FILING DEADLINE--Kuznicki Law PLLC Announces Class Actions on Behalf of Shareholders of PSMT, EQBK, XENT and LTHM","content":"CEDARHURST, N.Y., July  11, 2019  (GLOBE NEWSWIRE) -- The securities litigation law firm of Kuznicki Law PLLC issues the following notice on behalf of shareholders of the following publicly traded companies. Shareholders who purchased shares in these companies during the dates listed below are encouraged to contact the firm regarding possible appointment as lead plaintiff and a preliminary estimate of their recoverable losses.\n\nIf you wish to choose counsel to represent you and the class, you must apply to be appointed lead plaintiff and be selected by the Court. The lead plaintiff will direct the litigation and participate in important decisions including whether to accept a settlement for the class in the action. The lead plaintiff will be selected from among applicants claiming the largest loss from investment in the respective securities during the class periods. Members of the class will be represented by the lead plaintiff and counsel chosen by the lead plaintiff. No classes have yet been certified in the actions below. Appointment as lead plaintiff is not required to partake in any recovery.\n\nPriceSmart, Inc. (NASDAQGS: PSMT)\r\nInvestors Affected: October 26, 2017 - October 25, 2018\n\nA class action has commenced on behalf of certain shareholders in PriceSmart, Inc. The filed complaint alleges that defendants made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company’s omni-channel business strategy had failed to reach key operating goals; (2) the Company’s South America distribution strategy had failed to realize key cost saving goals; (3) the Company had invested Trinidad and Tobago dollars into certificates of deposits with financial institutions; (4) that these investments had been improperly classified as cash and cash equivalents; (5) the relevant corrections would materially impact financial statements; (6) there was a material weakness in the Company’s internal controls over financial reporting; (7) increasing competition negatively impacted the Company’s revenue and profitability; and (8) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nShareholders may find more information at https:\/\/kclasslaw.com\/securities\/pricesmart-inc-loss-submission-form\/?wire=3\n\nEquity Bancshares, Inc. (NASDAQ: EQBK)\r\nInvestors Affected: May 11, 2018 - April 22, 2019\n\nA class action has commenced on behalf of certain shareholders in Equity Bancshares, Inc. The filed complaint alleges that defendants made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company lacked adequate internal controls to assess credit risk; (2) as a result, certain of the Company’s loans posed an increased risk of loss; (3) as a result, the Company was reasonably likely to incur significant losses for certain substandard loans; and (4) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nShareholders may find more information at https:\/\/kclasslaw.com\/securities\/equity-bancshares-inc-loss-submission-form\/?wire=3\n\nIntersect ENT, Inc. (NASDAQGM: XENT)\r\nInvestors Affected: August 1, 2018 - May 6, 2019\n\nA class action has commenced on behalf of certain shareholders in Intersect ENT, Inc. The filed complaint alleges that defendants made materially false and\/or misleading statements and\/or failed to disclose that: (1) Intersect lacked adequate reimbursement representatives to ensure physicians had access to SINUVA, Intersect’s sinus implant; (2) Intersect’s sales force would focus on ensuring reimbursement; (3) Intersect’s sales representatives were less focused on driving sales; (4) physicians were less likely to adopt Intersect’s SINUVA due to transaction costs associated with seeking reimbursement; (5) Intersect would increase staffing to address these issues; and (6) as a result of the foregoing, defendants’ positive statements about Intersect’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nShareholders may find more information at https:\/\/kclasslaw.com\/securities\/intersect-ent-inc-loss-submission-form\/?wire=3\n\nLivent Corporation (NYSE: LTHM)\r\nInvestors Affected: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\n\nA class action has commenced on behalf of certain shareholders in Livent Corporation. The filed complaint alleges that defendants made materially false and\/or misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5)  as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nShareholders may find more information at https:\/\/kclasslaw.com\/securities\/livent-corporation-loss-submission-form\/?wire=3\n\nKuznicki Law PLLC is committed to ensuring that companies adhere to responsible business practices and engage in good corporate citizenship. The firm seeks recovery on behalf of investors who incurred losses when false and\/or misleading statements or the omission of material information by a Company lead to artificial inflation of the Company's stock. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nKuznicki Law PLLC\r\nDaniel Kuznicki, Esq.\r\n445 Central Avenue, Suite 344\r\nCedarhurst, NY 11516\r\nEmail: dk@kclasslaw.com \r\nPhone: (347) 696-1134\r\nCell: (347) 690-0692\r\nFax: (347) 348-0967","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/11\/1881475\/0\/en\/FILING-DEADLINE-Kuznicki-Law-PLLC-Announces-Class-Actions-on-Behalf-of-Shareholders-of-PSMT-EQBK-XENT-and-LTHM.html","symbols":["EQBK.US","LTHM.US"],"tags":["CLASS ACTION","KUZNICKI LAW PLLC"],"sentiment":{"polarity":0.363,"neg":0.099,"neu":0.796,"pos":0.105}},{"date":"2019-07-10T13:41:00+00:00","title":"The Klein Law Firm Reminds Investors of Class Actions on Behalf of Shareholders of PSMT, JMIA, LTHM and CYH","content":"NEW YORK, July  10, 2019  (GLOBE NEWSWIRE) -- The Klein Law Firm announces that class action complaints have been filed on behalf of shareholders of the following companies. If you suffered a loss you have until the lead plaintiff deadline to request that the court appoint you as lead plaintiff.\n\nPriceSmart, Inc. (NASDAQGS: PSMT)\r\n Class Period: October 26, 2017 to October 25, 2018\r\n Lead Plaintiff Deadline: July 22, 2019\n\nThe lawsuit alleges that PriceSmart, Inc. made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company’s omni-channel business strategy had failed to reach key operating goals; (2) the Company’s South America distribution strategy had failed to realize key cost saving goals; (3) the Company had invested Trinidad and Tobago dollars into certificates of deposits with financial institutions; (4) these investments had been improperly classified as cash and cash equivalents; (5) the relevant corrections would materially impact financial statements; (6) there was a material weakness in the Company’s internal controls over financial reporting; (7) increasing competition negatively impacted the Company’s revenue and profitability; and (8) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nGet additional information about the PSMT lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/pricesmart-inc-loss-submission-form?wire=3\n\nJumia Technologies AG (NYSE: JMIA)\r\n Class Period: Purchasers of American Depositary Shares between April 12, 2019 and May 9, 2019\r\n Lead Plaintiff Deadline: July 15, 2019\n\nThe complaint alleges that throughout the class period Jumia Technologies AG made materially false and\/or misleading statements and\/or failed to disclose that: (a) Jumia had materially overstated its active customers and active merchants; (b) Jumia’s representations about its orders, order cancellations, undelivered orders and returned orders lacked a sufficient factual basis and materially overstated the Company’s sales; (c) Jumia failed to sufficiently disclose related party transactions; and (d) Jumia’s financial statements were presented in violation of applicable accounting standards.\n\nGet additional information about the JMIA lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/jumia-technologies-ag-loss-submission-form?wire=3\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\n Lead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that during the class period Livent Corporation made materially false and\/or misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5)  as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nGet additional information about the LTHM lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/livent-corporation-loss-submission-form?wire=3\n\nCommunity Health Systems, Inc. (NYSE: CYH)\r\n Class Period: February 20, 2017 to February 27, 2018\r\n Lead Plaintiff Deadline: July 29, 2019\n\nDuring the class period, Community Health Systems, Inc. allegedly made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company had understated its contractual allowances; (2) the Company had understated its provision for bad debts; (3) as a result, the Company had overstated its net operating revenue; (4)  as a result, the Company had understated its net loss; and (5) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nGet additional information about the CYH lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/community-health-systems-inc-loss-submission-form?wire=3\n\nYour ability to share in any recovery doesn’t require that you serve as a lead plaintiff. There is no cost or obligation to you. If you suffered a loss during the class period and wish to obtain additional information, please contact J. Klein, Esq. by telephone at 212-616-4899 or visit the webpages provided.\n\nJ. Klein, Esq. represents investors and participates in securities litigations involving financial fraud throughout the nation. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nJ. Klein, Esq.\r\nEmpire State Building\r\n350 Fifth Avenue\r\n59th Floor\r\nNew York, NY 10118\r\njk@kleinstocklaw.com\r\nTelephone: (212) 616-4899\r\nFax: (347) 558-9665\r\nwww.kleinstocklaw.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/10\/1880900\/0\/en\/The-Klein-Law-Firm-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders-of-PSMT-JMIA-LTHM-and-CYH.html","symbols":["CYH.US","JMIA.US","LTHM.US"],"tags":["CLASS ACTION","THE KLEIN LAW FIRM"],"sentiment":{"polarity":-0.992,"neg":0.125,"neu":0.811,"pos":0.064}},{"date":"2019-07-10T01:30:00+00:00","title":"Bragar Eagel & Squire, P.C. Reminds Investors That Class Action Lawsuits Have Been Filed Against CBL & Associates Properties, Floor & Decor Holdings, RCI Hospitality Holdings, and Livent Corporation and Encourages Investors to Contact the Firm","content":"NEW YORK, July  09, 2019  (GLOBE NEWSWIRE) -- Bragar Eagel & Squire, P.C. reminds investors that class action lawsuits have been commenced on behalf of stockholders of CBL and Associates Properties, Inc., Floor & Decor Holdings, Inc., RCI Hospitality Holdings, Inc., and Livent Corporation. Stockholders have until the deadlines below to petition the court to serve as lead plaintiff. Additional information about each case can be found at the link provided.\n\nCBL and Associates Properties, Inc. (NYSE: CBL)\n\nClass Period: July 29, 2014 to March 26, 2019\n\nLead Plaintiff Deadline: July 17, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made false and\/or misleading statements and\/or failed to disclose in its SEC filings that the company was the target of a class action suit that could result in tens of millions or even hundreds of millions of dollars in liability.  Specifically, the complaint alleges that defendants completely ignored their disclosure obligation, motivated by a desire to avoid bad publicity surrounding their dishonest nature and their dishonest conduct.\n\nTo learn more about the CBL class action go to https:\/\/bespc.com\/cbl\/\n\nFloor & Decor Holdings, Inc. (NYSE: FND)\n\nClass Period: May 23, 2018 - August 1, 2018\n\nLead Plaintiff Deadline: July 19, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made false and misleading statements and\/or failed to disclose adverse information regarding Floor & Decor’s business and prospects.  Specifically, the complaint alleges that each of the statements in the Registration Statement filed with the SEC regarding the current financial condition of the company were materially false and misleading.  The complaint alleges that prior to the May 24 Secondary Offering, defendants knew, but failed to disclose, that the company had already begun to experience declining sales trends that would ultimately result in the reduction of its fiscal 2018 sales and adjusted earnings per share guidance, which had been increased as recently as May 2018.  As a result of this adverse information being withheld from the market, the price of the company’s stock was artificially inflated during the Class Period, allowing company insiders to sell more than 10.3 million shares of Floor & Decor common stock, including the shares sold in the May 24 Secondary Offering, for proceeds of more than $466 million.\n\nTo learn more about the Floor & Decor class action go to: http:\/\/bespc.com\/fnd-2\n\nRCI Hospitality Holdings, Inc. (NASDAQ: RICK)\n\nClass Period: August 8, 2017 to May 10, 2019\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made materially false and\/or misleading statements, as well as failed to disclose material adverse facts about the company’s business, operations, and prospects.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) the company engaged in numerous transactions with the CEO, including lending him significant sums of money; (2) these practices were reasonably likely to lead to regulatory scrutiny of the company; (3) as a result of investigations into the company’s governance, the company would be unable to timely file its financial statements; and (4) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects were materially false and\/or misleading and\/or lacked a reasonable basis.\n\nFor more information on the RCI Hospitality Holdings class action go to: https:\/\/bespc.com\/rick\/\n\nLivent Corporation (NYSE: LTHM)\n\nClass Period: October 7, 2018- May 22, 2019 or Securities pursuant to and\/or traceable to the Initial Public Offering (“IPO”) on or about October 12, 2018\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that the Registration Statement was false and misleading and omitted to state material adverse facts.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the company’s existing contracts; (4) the company’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent class action go to: http:\/\/www.bespc.com\/lthm\n\nBragar Eagel & Squire, P.C. is a New York-based law firm concentrating in commercial and securities litigation. For additional information about Bragar Eagel & Squire, P.C. please go to www.bespc.com. Attorney advertising.  Prior results do not guarantee similar outcomes.\n\nContacts\r\nBragar Eagel & Squire, P.C.\r\nBrandon Walker, Esq.\r\nMelissa Fortunato, Esq.\r\n(212) 355-4648\r\ninvestigations@bespc.com\r\nwww.bespc.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/10\/1880583\/0\/en\/Bragar-Eagel-Squire-P-C-Reminds-Investors-That-Class-Action-Lawsuits-Have-Been-Filed-Against-CBL-Associates-Properties-Floor-Decor-Holdings-RCI-Hospitality-Holdings-and-Livent-Corp.html","symbols":["CBL.US","FND.US","LTHM.US","RICK.US"],"tags":["BRAGAR EAGEL & SQUIRE","CBL & ASSOCIATES PROPERTIES","CLASS ACTION","FLOOR & DECOR HOLDINGS","INC","LIVENT","RCI HOSPITALITY HOLDINGS","SHAREHOLDER ALERT"],"sentiment":{"polarity":-0.984,"neg":0.11,"neu":0.826,"pos":0.064}},{"date":"2019-07-09T15:07:00+00:00","title":"Livent Shareholder Class Action Deadline: Bernstein Liebhard LLP Announces that Approximately 2 Weeks Remain to Make a Motion for Lead Plaintiff in a Securities Class Action Lawsuit Against the Livent Corporation – LTHM","content":"NEW YORK, July  09, 2019  (GLOBE NEWSWIRE) -- Bernstein Liebhard LLP, a nationally acclaimed investor rights law firm, announced that approximately two weeks remain to make a motion to serve as a lead plaintiff in a class action pending against the Livent Corporation (“Livent,” “LTHM” or the “Company”) (NYSE: LTHM) pursuant to or traceable to Livent’s initial public offering (“IPO”) on or around October 12, 2018.\n\nIf you purchased Livent securities, and\/or would like to discuss your legal rights and options, please visit Livent LTHM Shareholder Class Action Lawsuit or contact Matthew Guarnero toll free at (877) 779-1414 or MGuarnero@bernlieb.com.\n\nThe complaint, which is pending in the United States District Court for the Eastern District of Pennsylvania, alleges that Defendants violated the Securities Act of 1933. If you wish to serve as lead plaintiff in the Livent Securities Class Action you must move the Court no later than July 22, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. Your ability to share in any recovery does not require that you serve as lead plaintiff. If you choose to take no action, you may remain an absent class member.\n\nAccording to the lawsuit, Defendants made false and\/or misleading statements in the offering documents relating to the IPO, including failing to disclose that: (i) a supply contract with Nemaska Lithium Inc. had been terminated; (ii) the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (iii) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (iv) the Company’s margins were squeezed due to that customer’s increased orders; and (v) as a result of the foregoing, Defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nOn February 11, 2019, Livent released its fourth quarter 2018 financial results that missed top line sales targets, citing difficulties negotiating contracts with existing customers. On this news, Livent’s share price fell $0.57, over 4%, to close at $12.55 per share on February 12, 2019.\n\nOn May 8, 2019, Livent announced disappointing financial results for first quarter 2019, citing further customer issues. On this news, the Company’s share price fell $1.70, nearly 16%, to close at $9.03 per share on May 8, 2019.\n\nIf you purchased Livent securities, and\/or would like to discuss your legal rights and options, please visit https:\/\/www.bernlieb.com\/cases\/livent-corporation-lthm-class-action-lawsuit-fraud-stock-133\/ or contact Matthew Guarnero toll free at (877) 779-1414 or MGuarnero@bernlieb.com.\n\nSince 1993, Bernstein Liebhard LLP has recovered over $3.5 billion for its clients. In addition to representing individual investors, the Firm has been retained by some of the largest public and private pension funds in the country to monitor their assets and pursue litigation on their behalf. As a result of its success litigating hundreds of lawsuits and class actions, the Firm has been named to The National Law Journal’s “Plaintiffs’ Hot List” thirteen times and listed in The Legal 500 for ten consecutive years.\n\nATTORNEY ADVERTISING. © 2019 Bernstein Liebhard LLP. The law firm responsible for this advertisement is Bernstein Liebhard LLP, 10 East 40th Street, New York, New York 10016, (212) 779-1414. The lawyer responsible for this advertisement in the State of Connecticut is Michael S. Bigin.  Prior results do not guarantee or predict a similar outcome with respect to any future matter.\n\nContact Information\n\nMatthew Guarnero\r\n Bernstein Liebhard LLP\r\nhttps:\/\/www.bernlieb.com\r\n (877) 779-1414\r\nMGuarnero@bernlieb.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/09\/1880352\/0\/en\/Livent-Shareholder-Class-Action-Deadline-Bernstein-Liebhard-LLP-Announces-that-Approximately-2-Weeks-Remain-to-Make-a-Motion-for-Lead-Plaintiff-in-a-Securities-Class-Action-Lawsuit.html","symbols":["LTHM.US"],"tags":["BERNSTEIN LIEBHARD LLP","CLASS ACTION"],"sentiment":{"polarity":0.982,"neg":0.069,"neu":0.807,"pos":0.124}},{"date":"2019-07-09T13:39:00+00:00","title":"CLASS ACTION UPDATE for XENT, LTHM, EROS and BUD: Levi & Korsinsky, LLP Reminds Investors of Class Actions on Behalf of Shareholders","content":"NEW YORK, July  09, 2019  (GLOBE NEWSWIRE) -- Levi & Korsinsky, LLP announces that class action lawsuits have commenced on behalf of shareholders of the following publicly-traded companies. Shareholders interested in serving as lead plaintiff have until the deadlines listed to petition the court and further details about the cases can be found at the links provided. There is no cost or obligation to you.\n\nIntersect ENT, Inc. (NASDAQGM: XENT)\r\n Class Period: August 1, 2018 - May 6, 2019\r\nLead Plaintiff Deadline: July 15, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/intersect-ent-inc-loss-form?wire=3\n\nAbout the lawsuit: Throughout the class period, Intersect ENT, Inc. allegedly made materially false and\/or misleading statements and\/or failed to disclose that: (1) Intersect lacked adequate reimbursement representatives to ensure physicians had access to SINUVA, Intersect’s sinus implant; (2) Intersect’s sales force would focus on ensuring reimbursement; (3) Intersect’s sales representatives were less focused on driving sales; (4) physicians were less likely to adopt Intersect’s SINUVA due to transaction costs associated with seeking reimbursement; (5) Intersect would increase staffing to address these issues; and (6) as a result of the foregoing, defendants’ positive statements about Intersect’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Intersect ENT, Inc. class action contact jlevi@levikorsinsky.com.\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\nLead Plaintiff Deadline: July 22, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/livent-corporation-loss-form?wire=3\n\nAbout the lawsuit: During the class period, Livent Corporation allegedly made materially false and\/or misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5)  as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent Corporation class action contact jlevi@levikorsinsky.com.\n\nEros International Plc (NYSE: EROS)\r\n Class Period: July 28, 2017 - June 5, 2019\r\nLead Plaintiff Deadline: August 20, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/eros-international-plc-loss-form?wire=3\n\nAbout the lawsuit: Eros International Plc allegedly made materially false and\/or misleading statements during the class period and\/or failed to disclose that: (1) Eros and its executives engaged in a scheme to use related-party transactions to fabricate receivables that they reported in Eros’s public financial disclosures; (2) because of this scheme, Eros’s financial position was weaker than what the Company disclosed; (3) consequently, the Company’s Indian subsidiary, Eros International Media Ltd (“EIML”), missed loan payments and had its credit downgraded; and (4) due to the foregoing, Defendants’ statements about Eros’s receivables, business, operations, and prospects, were materially false and misleading and\/or lacked a reasonable basis at all relevant times.\n\nTo learn more about the Eros International Plc class action contact jlevi@levikorsinsky.com.\n\nAnheuser-Busch Inbev Sa\/Nv (NYSE: BUD)\r\n Class Period: March 1, 2018 - October 24, 2018\r\nLead Plaintiff Deadline: August 20, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/anheuser-busch-inbev-sa-nv-loss-form?wire=3\n\nAccording to the filed complaint, Defendants issued a steady stream of materially false and misleading reassurances about Anheuser Busch’s deleveraging efforts, cost cutting measures, EBITDA growth, the sufficiency of its liquidity and its debt maturity profile during the Class Period. These positive statements by Defendants created a false impression and materially misled investors about the Company’s finances, including the  sustainability of Anheuser-Busch’s dividends. Once Defendants chose to speak about Anheuser-Busch’s finances, they had a duty to speak completely and truthfully, including speaking about those factors that were then having a material adverse effect on the Company’s deleveraging efforts.\n\nTo learn more about the Anheuser-Busch Inbev Sa\/Nv class action contact jlevi@levikorsinsky.com.\n\nYou have until the lead plaintiff deadlines to request the court appoint you as lead plaintiff. Your ability to share in any recovery doesn’t require that you serve as a lead plaintiff.\r\n\r\nLevi & Korsinsky is a national firm with offices in New York, California, Connecticut, and Washington D.C. The firm’s attorneys have extensive expertise and experience representing investors in securities litigation and have recovered hundreds of millions of dollars for aggrieved shareholders. Attorney advertising. Prior results do not guarantee similar outcomes.\r\n\r\nCONTACT:\r\nLevi & Korsinsky, LLP\r\nJoseph E. Levi, Esq.\r\n55 Broadway, 10th Floor\r\nNew York, NY 10006\r\njlevi@levikorsinsky.com\r\nTel: (212) 363-7500\r\nFax: (212) 363-7171\r\nwww.zlk.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/09\/1880261\/3080\/en\/CLASS-ACTION-UPDATE-for-XENT-LTHM-EROS-and-BUD-Levi-Korsinsky-LLP-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders.html","symbols":["BUD.US","EROS.US","LTHM.US"],"tags":["CLASS ACTION","LEVI & KORSINSKY","LLP"],"sentiment":{"polarity":0.88,"neg":0.076,"neu":0.835,"pos":0.09}},{"date":"2019-07-08T13:32:00+00:00","title":"SHAREHOLDER ALERT: EQBK LTHM PVTL DBD: The Law Offices of Vincent Wong Reminds Investors of Important Class Action Deadlines","content":"NEW YORK, July  08, 2019  (GLOBE NEWSWIRE) -- The Law Offices of Vincent Wong announce that class actions have commenced on behalf of shareholders of the following companies. If you suffered a loss you have until the lead plaintiff deadline to request that the court appoint you as lead plaintiff.\n\nEquity Bancshares, Inc. (NASDAQ: EQBK)\r\n Lead Plaintiff Deadline: July 12, 2019\r\n Class Period: May 11, 2018 and April 22, 2019\n\nGet additional information about EQBK: http:\/\/www.wongesq.com\/pslra-1\/equity-bancshares-inc-loss-submission-form?wire=3\n\nLivent Corporation (NYSE: LTHM)\r\n Lead Plaintiff Deadline: July 22, 2019\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\n\nGet additional information about LTHM: http:\/\/www.wongesq.com\/pslra-1\/livent-corporation-loss-submission-form?wire=3\n\nPivotal Software, Inc. (NYSE: PVTL)\r\n Lead Plaintiff Deadline: August 19, 2019\r\n Class Period: investors who purchased common stock pursuant or traceable to the April 2018 initial public offering and\/or Pivotal securities between April 24, 2018 and June 4, 2019.\n\nGet additional information about PVTL: http:\/\/www.wongesq.com\/pslra-1\/pivotal-software-inc-loss-submission-form?wire=3\n\nDiebold Nixdorf, Incorporated (NYSE: DBD)\r\n Lead Plaintiff Deadline: September 3, 2019\r\n Class Period: May 4, 2017 and July 4, 2017\n\nGet additional information about DBD: http:\/\/www.wongesq.com\/pslra-1\/diebold-nixdorf-incorporated-loss-submission-form?wire=3\n\nTo learn more contact Vincent Wong, Esq. either via email vw@wongesq.com or by telephone at 212.425.1140.\n\nVincent Wong, Esq. is an experienced attorney that has represented investors in securities litigations involving financial fraud and violations of shareholder rights. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nVincent Wong, Esq.\r\n39 East Broadway\r\nSuite 304\r\nNew York, NY 10002\r\nTel. 212.425.1140\r\nFax. 866.699.3880\r\nE-Mail: vw@wongesq.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/08\/1879533\/31847\/en\/SHAREHOLDER-ALERT-EQBK-LTHM-PVTL-DBD-The-Law-Offices-of-Vincent-Wong-Reminds-Investors-of-Important-Class-Action-Deadlines.html","symbols":["DBD.US","EQBK.US","LTHM.US","PVTL.US"],"tags":["CLASS ACTION","THE LAW OFFICES OF VINCENT WONG"],"sentiment":{"polarity":-0.854,"neg":0.055,"neu":0.92,"pos":0.024}},{"date":"2019-07-08T13:30:00+00:00","title":"UPCOMING DEADLINE ALERT: The Schall Law Firm Announces the Filing of a Class Action Lawsuit Against Livent Corporation and Encourages Investors with Losses in Excess of $100,000 to Contact the Firm","content":"LOS ANGELES, July  08, 2019  (GLOBE NEWSWIRE) -- The Schall Law Firm, a national shareholder rights litigation firm, announces the filing of a class action lawsuit against Livent Corporation (“Livent” or “the Company”) (NYSE: LTHM) for violations of the federal securities laws.\n\nInvestors who purchased the Company’s shares pursuant to and\/or traceable to the Company’s Initial Public Offering in October 2018 (the “IPO”) are encouraged to contact the firm before July 22, 2019.\n\nIf you are a shareholder who suffered a loss, click here to participate.\n\nWe also encourage you to contact Brian Schall of the Schall Law Firm, 1880 Century Park East, Suite 404, Los Angeles, CA 90067, at 424-303-1964, to discuss your rights free of charge. You can also reach us through the firm's website at www.schallfirm.com, or by email at brian@schallfirm.com.\n\nThe class, in this case, has not yet been certified, and until certification occurs, you are not represented by an attorney. If you choose to take no action, you can remain an absent class member.\n\nAccording to the Complaint, the Company made false and misleading statements to the market. Livent’s supply contract with Nemaska Lithium Inc. was terminated. As a result, the Company was forced to fulfill customer contracts using different vendors with unfavorable terms, reducing revenues and lowering margins. Livent had a long-standing contract to supply lithium hydroxide to a customer at a significantly lower price than its existing contacts. When the customer increased its orders, the Company’s margins were further squeezed. Based on these facts, the Company’s public statements were false and materially misleading throughout the IPO period. When the market learned the truth about Livent, investors suffered damages.\n\nJoin the case to recover your losses.\n\nThe Schall Law Firm represents investors around the world and specializes in securities class action lawsuits and shareholder rights litigation.\n\nThis press release may be considered Attorney Advertising in some jurisdictions under the applicable law and rules of ethics.\n\nCONTACT:\n\nThe Schall Law Firm\r\n Brian Schall, Esq.,\r\nwww.schallfirm.com\r\nOffice: 310-301-3335\r\nCell: 424-303-1964\r\ninfo@schallfirm.com\n\nSOURCE:\n\nThe Schall Law Firm","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/08\/1879530\/0\/en\/UPCOMING-DEADLINE-ALERT-The-Schall-Law-Firm-Announces-the-Filing-of-a-Class-Action-Lawsuit-Against-Livent-Corporation-and-Encourages-Investors-with-Losses-in-Excess-of-100-000-to-C.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","LIVENT","LTHM","SCHALL LAW","SCHALL LAW FIRM"],"sentiment":{"polarity":-0.926,"neg":0.113,"neu":0.816,"pos":0.071}},{"date":"2019-07-05T19:00:00+00:00","title":"JMIA, FND & LTHM - Bronstein, Gewirtz & Grossman, LLC Reminds Investors of Class Action","content":"NEW YORK, July  05, 2019  (GLOBE NEWSWIRE) -- Attorney Advertising -- Bronstein, Gewirtz & Grossman, LLC reminds investors that a class action lawsuit has been filed against the following publicly-traded companies. You can review a copy of the Complaints by visiting the links below or you may contact Peretz Bronstein, Esq. or his Investor Relations Analyst, Yael Hurwitz of Bronstein, Gewirtz & Grossman, LLC at 212-697-6484. If you suffered a loss, you can request that the Court appoint you as lead plaintiff.  Your ability to share in any recovery doesn't require that you serve as a lead plaintiff. A lead plaintiff acts on behalf of all other class members in directing the litigation. The lead plaintiff can select a law firm of its choice. An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\n\nJumia Technologies AG (NYSE: JMIA)\r\nClass Period: April 12, 2019 -May 9, 2019\r\nDeadline: July 15, 2019 For more info:www.bgandg.com\/jmia\n\nThe complaint alleges that throughout the Class Period, defendants made false and\/or misleading statements and\/or failed to disclose that: (1) Jumia had materially overstated its active customers and active merchants; (2) Jumia’s representations about its orders, order cancellations, undelivered orders and returned orders lacked a sufficient factual basis and materially overstated Jumia’s sales; (3) Jumia failed to sufficiently disclose related party transactions; (4) Jumia’s financial statements were presented in violation of applicable accounting standards; and (5) as a result of the foregoing, defendants’ positive statements about Jumia’s business, operations, and prospects, were materially misleading and lacked a reasonable basis.\n\nFloor & Decor Holdings, Inc. (NYSE: FND)\r\nClass Period: May 23, 2018 - August 1, 2018,\r\nDeadline: July 19, 2019 For more info:www.bgandg.com\/fnd\n\nThe complaint alleges that throughout the Floor & Decor’s May 24, 2018 Secondary Offering documents included false and misleading statements. Specifically, the complaint alleges that the defendants knew but failed to disclose that the company had already begun to experience declining sales trends that would ultimately result in the reduction of its fiscal 2018 sales and adjusted earnings per share guidance, which the company publicly increased in May 2018. While the company’s stock was artificially inflated, insiders sold more than 10.3 million shares of Floor & Decor common stock, including shares sold in the May 24, 2018 Secondary Offering,\n\nLivent Corporation (NYSE: LTHM)\r\nClass Period: Livent securities purchased pursuant and\/or traceable to the company’s initial public offering completed in October 2018 (the “IPO” or the “Offering”).\r\nDeadline: July 22, 2019 For more info:www.bgandg.com\/lthm\n\nThe lawsuit alleges that the Registration Statement was false and\/or contained misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) Livent would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) Livent had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (4) Livent’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\n\nContact:\r\nBronstein, Gewirtz & Grossman, LLC\r\n Peretz Bronstein or Yael Hurwitz \r\n212-697-6484 | info@bgandg.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/05\/1879058\/9788\/en\/JMIA-FND-LTHM-Bronstein-Gewirtz-Grossman-LLC-Reminds-Investors-of-Class-Action.html","symbols":["FND.US","JMIA.US","LTHM.US"],"tags":["BRONSTEIN","CLASS ACTION","GEWIRTZ & GROSSMAN","LLC"],"sentiment":{"polarity":-0.94,"neg":0.108,"neu":0.812,"pos":0.08}},{"date":"2019-07-05T18:00:00+00:00","title":"ROSEN, A TOP RANKED LAW FIRM, Reminds Livent Corporation Investors of Important July 22nd Deadline in Securities Class Action Lawsuit; Encourages Investors with Over $100K in Losses to Contact the Firm – LTHM","content":"NEW YORK, July  05, 2019  (GLOBE NEWSWIRE) -- Rosen Law Firm, a global investor rights law firm, reminds purchasers of the securities of Livent Corporation (NYSE: LTHM) pursuant and\/or traceable to Livent’s false and\/or misleading registration statement and prospectus (collectively, the “Registration Statement”) issued in connection with Livent’s initial public offering completed in October 2018 (the “IPO”) of the important July 22, 2019 lead plaintiff deadline in securities class action. The lawsuit seeks to recover damages for Livent investors under the federal securities laws.\n\nTo join the Livent class action, go to http:\/\/www.rosenlegal.com\/cases-register-1579.html or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action.\n\nNO CLASS HAS YET BEEN CERTIFIED IN THE ABOVE ACTION. UNTIL A CLASS IS CERTIFIED, YOU ARE NOT REPRESENTED BY COUNSEL UNLESS YOU RETAIN ONE. YOU MAY RETAIN COUNSEL OF YOUR CHOICE. YOU MAY ALSO REMAIN AN ABSENT CLASS MEMBER AND DO NOTHING AT THIS POINT. AN INVESTOR’S ABILITY TO SHARE IN ANY POTENTIAL FUTURE RECOVERY IS NOT DEPENDENT UPON SERVING AS LEAD PLAINTIFF.\n\nAccording to the lawsuit, the Registration Statement was false and\/or contained misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) Livent would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) Livent had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (4) Livent’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\n\nA class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than July 22, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. If you wish to join the litigation, go to http:\/\/www.rosenlegal.com\/cases-register-1579.html or to discuss your rights or interests regarding this class action, please contact Phillip Kim, Esq. of Rosen Law Firm toll free at 866-767-3653 or via e-mail at pkim@rosenlegal.com or cases@rosenlegal.com.\n\nFollow us for updates on LinkedIn: https:\/\/www.linkedin.com\/company\/the-rosen-law-firm, on Twitter: https:\/\/twitter.com\/rosen_firm or on Facebook: https:\/\/www.facebook.com\/rosenlawfirm\/.\n\nRosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 3 each year since 2013.   Rosen Law Firm has secured hundreds of millions of dollars for investors. Attorney advertising. Prior results do not guarantee future outcomes.\n\n-------------------------------\n\nContact Information:\r\n Laurence Rosen, Esq.\r\n Phillip Kim, Esq.\r\n The Rosen Law Firm, P.A.\r\n 275 Madison Avenue, 34th Floor\r\n New York, NY  10016\r\n Tel: (212) 686-1060\r\n Toll Free: (866) 767-3653\r\n Fax: (212) 202-3827\r\n lrosen@rosenlegal.com\r\n pkim@rosenlegal.com\r\n cases@rosenlegal.com\r\n www.rosenlegal.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/05\/1879046\/673\/en\/ROSEN-A-TOP-RANKED-LAW-FIRM-Reminds-Livent-Corporation-Investors-of-Important-July-22nd-Deadline-in-Securities-Class-Action-Lawsuit-Encourages-Investors-with-Over-100K-in-Losses-to.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","THE ROSEN LAW FIRM PA"],"sentiment":{"polarity":0.924,"neg":0.088,"neu":0.799,"pos":0.113}},{"date":"2019-07-03T01:30:00+00:00","title":"Bragar Eagel & Squire, P.C. Reminds Investors That Class Action Lawsuits Have Been Filed Against CBL & Associates Properties, Floor & Decor Holdings, RCI Hospitality Holdings, and Livent Corporation and Encourages Investors to Contact the Firm","content":"NEW YORK, July  02, 2019  (GLOBE NEWSWIRE) -- Bragar Eagel & Squire, P.C. reminds investors that class action lawsuits have been commenced on behalf of stockholders of CBL and Associates Properties, Inc., Floor & Decor Holdings, Inc., RCI Hospitality Holdings, Inc., and Livent Corporation. Stockholders have until the deadlines below to petition the court to serve as lead plaintiff. Additional information about each case can be found at the link provided.\n\nCBL and Associates Properties, Inc. (NYSE: CBL)\n\nClass Period: April 29, 2016 to March 26, 2019\n\nLead Plaintiff Deadline: July 17, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made false and\/or misleading statements and\/or failed to disclose in its SEC filings that the company was the target of a class action suit that could result in tens of millions or even hundreds of millions of dollars in liability.  Specifically, the complaint alleges that defendants completely ignored their disclosure obligation, motivated by a desire to avoid bad publicity surrounding their dishonest nature and their dishonest conduct.\n\nTo learn more about the CBL class action go to https:\/\/bespc.com\/cbl\/\n\nFloor & Decor Holdings, Inc. (NYSE: FND)\n\nClass Period: May 23, 2018 - August 1, 2018\n\nLead Plaintiff Deadline: July 19, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made false and misleading statements and\/or failed to disclose adverse information regarding Floor & Decor’s business and prospects.  Specifically, the complaint alleges that each of the statements in the Registration Statement filed with the SEC regarding the current financial condition of the company were materially false and misleading.  The complaint alleges that prior to the May 24 Secondary Offering, defendants knew, but failed to disclose, that the company had already begun to experience declining sales trends that would ultimately result in the reduction of its fiscal 2018 sales and adjusted earnings per share guidance, which had been increased as recently as May 2018.  As a result of this adverse information being withheld from the market, the price of the company’s stock was artificially inflated during the Class Period, allowing company insiders to sell more than 10.3 million shares of Floor & Decor common stock, including the shares sold in the May 24 Secondary Offering, for proceeds of more than $466 million.\n\nTo learn more about the Floor & Decor class action go to: http:\/\/bespc.com\/fnd-2\n\nRCI Hospitality Holdings, Inc. (NASDAQ: RICK)\n\nClass Period: August 8, 2017 to May 10, 2019\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made materially false and\/or misleading statements, as well as failed to disclose material adverse facts about the company’s business, operations, and prospects.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) the company engaged in numerous transactions with the CEO, including lending him significant sums of money; (2) these practices were reasonably likely to lead to regulatory scrutiny of the company; (3) as a result of investigations into the company’s governance, the company would be unable to timely file its financial statements; and (4) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects were materially false and\/or misleading and\/or lacked a reasonable basis\n\nFor more information on the RCI Hospitality Holdings class action go to: https:\/\/bespc.com\/rick\/\n\nLivent Corporation (NYSE: LTHM)\n\nClass Period: October 7, 2018- May 22, 2019 or Securities pursuant to and\/or traceable to the Initial Public Offering (“IPO”) on or about October 12, 2018\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that the Registration Statement was false and misleading and omitted to state material adverse facts.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the company’s existing contracts; (4) the company’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent class action go to: http:\/\/www.bespc.com\/lthm\n\nBragar Eagel & Squire, P.C. is a New York-based law firm concentrating in commercial and securities litigation. For additional information about Bragar Eagel & Squire, P.C. please go to www.bespc.com. Attorney advertising.  Prior results do not guarantee similar outcomes.\n\nContacts\r\nBragar Eagel & Squire, P.C.\r\nBrandon Walker, Esq.\r\nMelissa Fortunato, Esq.\r\n(212) 355-4648\r\ninvestigations@bespc.com\r\nwww.bespc.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/03\/1877643\/0\/en\/Bragar-Eagel-Squire-P-C-Reminds-Investors-That-Class-Action-Lawsuits-Have-Been-Filed-Against-CBL-Associates-Properties-Floor-Decor-Holdings-RCI-Hospitality-Holdings-and-Livent-Corp.html","symbols":["CBL.US","FND.US","LTHM.US","RICK.US"],"tags":["BRAGAR EAGEL & SQUIRE","CBL & ASSOCIATES PROPERTIES","CLASS ACTION","FLOOR & DECOR HOLDINGS","INC","LIVENT CORPORATION","RCI HOSPITALITY HOLDINGS","SHAREHOLDER ALERT"],"sentiment":{"polarity":-0.984,"neg":0.11,"neu":0.826,"pos":0.064}},{"date":"2019-07-01T16:30:00+00:00","title":"INVESTOR ACTION NOTICE: The Schall Law Firm Announces the Filing of a Class Action Lawsuit Against Livent Corporation and Encourages Investors with Losses in Excess of $100,000 to Contact the Firm","content":"LOS ANGELES, July  01, 2019  (GLOBE NEWSWIRE) -- The Schall Law Firm, a national shareholder rights litigation firm, announces the filing of a class action lawsuit against Livent Corporation (“Livent” or “the Company”) (NYSE: LTHM) for violations of the federal securities laws.\n\nInvestors who purchased the Company’s shares pursuant to and\/or traceable to the Company’s Initial Public Offering in October 2018 (the “IPO”) are encouraged to contact the firm before July 22, 2019.\n\nIf you are a shareholder who suffered a loss, click here to participate.\n\nWe also encourage you to contact Brian Schall of the Schall Law Firm, 1880 Century Park East, Suite 404, Los Angeles, CA 90067, at 424-303-1964, to discuss your rights free of charge. You can also reach us through the firm's website at www.schallfirm.com, or by email at brian@schallfirm.com.\n\nThe class, in this case, has not yet been certified, and until certification occurs, you are not represented by an attorney. If you choose to take no action, you can remain an absent class member.\n\nAccording to the Complaint, the Company made false and misleading statements to the market. Livent’s supply contract with Nemaska Lithium Inc. was terminated. As a result, the Company was forced to fulfill customer contracts using different vendors with unfavorable terms, reducing revenues and lowering margins. Livent had a long-standing contract to supply lithium hydroxide to a customer at a significantly lower price than its existing contacts. When the customer increased its orders, the Company’s margins were further squeezed. Based on these facts, the Company’s public statements were false and materially misleading throughout the IPO period. When the market learned the truth about Livent, investors suffered damages.\n\nJoin the case to recover your losses.\n\nThe Schall Law Firm represents investors around the world and specializes in securities class action lawsuits and shareholder rights litigation.\n\nThis press release may be considered Attorney Advertising in some jurisdictions under the applicable law and rules of ethics.\n\nCONTACT:\n\nThe Schall Law Firm\r\n Brian Schall, Esq.,\r\nwww.schallfirm.com\r\nOffice: 310-301-3335\r\nCell: 424-303-1964\r\ninfo@schallfirm.com\n\nSOURCE:\n\nThe Schall Law Firm","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/01\/1876873\/0\/en\/INVESTOR-ACTION-NOTICE-The-Schall-Law-Firm-Announces-the-Filing-of-a-Class-Action-Lawsuit-Against-Livent-Corporation-and-Encourages-Investors-with-Losses-in-Excess-of-100-000-to-Co.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","LIVENT","LTHM","SCHALL LAW","SCHALL LAW FIRM"],"sentiment":{"polarity":-0.926,"neg":0.113,"neu":0.816,"pos":0.071}},{"date":"2019-07-01T13:01:00+00:00","title":"CLASS ACTION UPDATE for PSMT, LTHM, TUSK and EQT: Levi & Korsinsky, LLP Reminds Investors of Class Actions on Behalf of Shareholders","content":"NEW YORK, July  01, 2019  (GLOBE NEWSWIRE) -- Levi & Korsinsky, LLP announces that class action lawsuits have commenced on behalf of shareholders of the following publicly-traded companies. Shareholders interested in serving as lead plaintiff have until the deadlines listed to petition the court and further details about the cases can be found at the links provided. There is no cost or obligation to you.\n\nPriceSmart, Inc. (NASDAQGS: PSMT)\r\n Class Period: October 26, 2017 - October 25, 2018\r\nLead Plaintiff Deadline: July 22, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/pricesmart-inc-loss-form?wire=3\n\nThe lawsuit alleges: PriceSmart, Inc. made materially false and\/or misleading statements throughout the class period and\/or failed to disclose that: (1) the Company’s omni-channel business strategy had failed to reach key operating goals; (2) the Company’s South America distribution strategy had failed to realize key cost saving goals; (3) the Company had invested Trinidad and Tobago dollars into certificates of deposits with financial institutions; (4) that these investments had been improperly classified as cash and cash equivalents; (5) the relevant corrections would materially impact financial statements; (6) there was a material weakness in the Company’s internal controls over financial reporting; (7) increasing competition negatively impacted the Company’s revenue and profitability; and (8) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the PriceSmart, Inc. class action contact jlevi@levikorsinsky.com.\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\nLead Plaintiff Deadline: July 22, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/livent-corporation-loss-form?wire=3\n\nThe lawsuit alleges that, during the class period, Livent Corporation made materially false and\/or misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5)  as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent Corporation class action contact jlevi@levikorsinsky.com.\n\nMammoth Energy Services, Inc. (NASDAQ: TUSK)\r\n Class Period: October 19, 2017 - June 5, 2019\r\nLead Plaintiff Deadline: August 9, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/mammoth-energy-services-inc-loss-form?wire=3\n\nThe lawsuit alleges: Mammoth Energy Services, Inc. made materially false and\/or misleading statements throughout the class period and\/or failed to disclose that: (1) Mammoth’s subsidiary, Cobra, improperly obtained two  infrastructure contracts with PREPA that  totaled over $1.8  billion;  (2)  specifically, the contracts were awarded as the result of improper steering and not a competitive RFP process; and (3) as a result, Defendants’ statements about Mammoth’s business, operations and prospects were materially false and misleading and\/or lacked a reasonable basis at all relevant times.\n\nTo learn more about the Mammoth Energy Services, Inc. class action contact jlevi@levikorsinsky.com.\n\nEQT Corporation (NYSE: EQT)\r\n Class Period: June 19, 2017 - October 24, 2018\r\nLead Plaintiff Deadline: August 26, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/eqt-corporation-loss-form?wire=3\n\nThe lawsuit alleges that, during the class period, EQT Corporation made materially false and\/or misleading statements and\/or failed to disclose that:  (1) land acquired by the Rice Energy merger was not contiguous with the Company’s previously held acreage, which reduced the purported synergy benefits; (2) the purported longer lateral wells were not feasible because of intervening third-party parcels or prior drilling by EQT, Rice, or third parties; and (3) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the EQT Corporation class action contact jlevi@levikorsinsky.com.\n\nYou have until the lead plaintiff deadlines to request the court appoint you as lead plaintiff. Your ability to share in any recovery doesn’t require that you serve as a lead plaintiff.\r\n\r\nLevi & Korsinsky is a national firm with offices in New York, California, Connecticut, and Washington D.C. The firm’s attorneys have extensive expertise and experience representing investors in securities litigation and have recovered hundreds of millions of dollars for aggrieved shareholders. Attorney advertising. Prior results do not guarantee similar outcomes.\r\n\r\nCONTACT:\r\nLevi & Korsinsky, LLP\r\nJoseph E. Levi, Esq.\r\n55 Broadway, 10th Floor\r\nNew York, NY 10006\r\njlevi@levikorsinsky.com\r\nTel: (212) 363-7500\r\nFax: (212) 363-7171\r\nwww.zlk.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/07\/01\/1876707\/3080\/en\/CLASS-ACTION-UPDATE-for-PSMT-LTHM-TUSK-and-EQT-Levi-Korsinsky-LLP-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders.html","symbols":["EQT.US","LTHM.US","TUSK.US"],"tags":["CLASS ACTION","LEVI & KORSINSKY","LLP"],"sentiment":{"polarity":-0.566,"neg":0.083,"neu":0.835,"pos":0.081}},{"date":"2019-06-29T00:07:00+00:00","title":"LTHM CLASS ACTION REMINDER: Hagens Berman Reminds Livent Corporation (LTHM) Investors of Lead Plaintiff Deadline, Encourages Investors Who Suffered $50,000+ Losses to Contact the Firm","content":"SAN FRANCISCO , June  28, 2019  (GLOBE NEWSWIRE) -- Hagens Berman Sobol Shapiro LLP, with nine offices in eight cities around the country and eighty attorneys, reminds investors in Livent Corporation (NYSE: LTHM) of the Lead Plaintiff deadline in the securities class action, Nikolov v. Livent Corp. et al., No. 2:19-cv-02218, pending in the U.S. District Court for the Eastern District of Pennsylvania.\n\nIf you purchased or otherwise acquired Livent securities between October 7, 2018 and May 22, 2019 (the “Class Period”) and suffered losses you do not need to sign up to be included in the putative class of investors.\n\nIf you purchased or otherwise acquired Livent securities during the Class Period and suffered significant losses (in excess of $50,000), you may qualify to be a lead plaintiff – one who selects and oversees the attorneys prosecuting the case.\n\nIf you wish to serve as a lead plaintiff in this class action, you must move the Court no later than July 22, 2019 (the “Lead Plaintiff Deadline”). Contact Hagens Berman immediately for more information about the case and being a lead plaintiff.\n\nhttps:\/\/www.hbsslaw.com\/cases\/LTHM\n\nor contact Reed Kathrein, who is leading the firm’s investigation, by calling 510-725-3000 or emailing\n\nLTHM@hbsslaw.com.\n\nAccording to the complaint, Defendants improperly concealed (1) the termination of a supply contract with Nemaska Lithium Inc., and (2) fulfillment of customer contracts using alternative vendors would adversely affect Livent.\n\n“We’re focused on investors’ losses and the extent to which Defendants’ IPO- and post-IPO statements about the Company’s business may have misled investors,” said Hagens Berman partner Reed Kathrein.\n\nWhistleblowers: Persons with non-public information regarding Livent should consider their options to help in the investigation or take advantage of the SEC Whistleblower program.  Under the new program, whistleblowers who provide original information may receive rewards totaling up to 30 percent of any successful recovery made by the SEC.  For more information, call Reed Kathrein at 510-725-3000 or email LTHM@hbsslaw.com.\n\nAbout Hagens Berman\r\n Hagens Berman is a nationwide law firm that represents investors, whistleblowers, workers and consumers in complex litigation.  More about the firm and its successes is located at hbsslaw.com.  For the latest news visit our newsroom or follow us on Twitter at @classactionlaw.\n\nContact:\r\nReed Kathrein, 510-725-3000","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/29\/1876312\/32716\/en\/LTHM-CLASS-ACTION-REMINDER-Hagens-Berman-Reminds-Livent-Corporation-LTHM-Investors-of-Lead-Plaintiff-Deadline-Encourages-Investors-Who-Suffered-50-000-Losses-to-Contact-the-Firm.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","HAGENS BERMAN SOBOL SHAPIRO LLP","LTHM","LTHM CLASS ACTION","LTHM FRAUD","LTHM INVESTOR FRAUD","LTHM SECURITIES","LTHM SECURITIES CLASS ACTION","LTHM SECURITIES FRAUD"],"sentiment":{"polarity":0.807,"neg":0.058,"neu":0.863,"pos":0.079}},{"date":"2019-06-28T20:17:00+00:00","title":"Livent Class Action Deadline: Bernstein Liebhard LLP Announces That Approximately Three Weeks Remain to Make a Motion for Lead Plaintiff in a Securities Class Action Lawsuit Against the Livent Corporation – LTHM","content":"NEW YORK, June  28, 2019  (GLOBE NEWSWIRE) -- Bernstein Liebhard LLP, a nationally acclaimed investor rights law firm, announced that approximately three weeks remain to make a motion to serve as a lead plaintiff in a class action pending against the Livent Corporation (“Livent,” “LTHM” or the “Company”) (NYSE: LTHM) alleging claims on behalf of those who purchased or acquired Livent shares pursuant to or traceable to Livent’s initial public offering (“IPO”) on or around October 12, 2018.\n\nIf you purchased Livent securities, and\/or would like to discuss your legal rights and options, please visit Livent LTHM Shareholder Class Action Lawsuit or contact Matthew Guarnero toll free at (877) 779-1414 or MGuarnero@bernlieb.com.\n\nThe complaint, which is pending in the United States District Court for the Eastern District of Pennsylvania, alleges that Defendants violated the Securities Act of 1933. If you wish to serve as lead plaintiff in the Livent Securities Class Action you must move the Court no later than July 22, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. Your ability to share in any recovery does not require that you serve as lead plaintiff. If you choose to take no action, you may remain an absent class member.\n\nAccording to the lawsuit, Defendants made false and\/or misleading statements in the offering documents relating to the IPO, including failing to disclose that: (i) a supply contract with Nemaska Lithium Inc. had been terminated; (ii) the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (iii) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (iv) the Company’s margins were squeezed due to that customer’s increased orders; and (v) as a result of the foregoing, Defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nOn February 11, 2019, Livent released its fourth quarter 2018 financial results that missed top line sales targets, citing difficulties negotiating contracts with existing customers. On this news, Livent’s share price fell $0.57, over 4%, to close at $12.55 per share on February 12, 2019.\n\nOn May 8, 2019, Livent announced disappointing financial results for first quarter 2019, citing further customer issues. On this news, the Company’s share price fell $1.70, nearly 16%, to close at $9.03 per share on May 8, 2019.\n\nSince 1993, Bernstein Liebhard LLP has recovered over $3.5 billion for its clients. In addition to representing individual investors, the Firm has been retained by some of the largest public and private pension funds in the country to monitor their assets and pursue litigation on their behalf. As a result of its success litigating hundreds of lawsuits and class actions, the Firm has been named to The National Law Journal’s “Plaintiffs’ Hot List” thirteen times and listed in The Legal 500 for ten consecutive years.\n\nATTORNEY ADVERTISING. © 2019 Bernstein Liebhard LLP. The law firm responsible for this advertisement is Bernstein Liebhard LLP, 10 East 40th Street, New York, New York 10016, (212) 779-1414. The lawyer responsible for this advertisement in the State of Connecticut is Michael S. Bigin.  Prior results do not guarantee or predict a similar outcome with respect to any future matter.\n\nContact Information\n\nMatthew Guarnero\r\n Bernstein Liebhard LLP\r\nhttps:\/\/www.bernlieb.com\r\n (877) 779-1414\r\nMGuarnero@bernlieb.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/28\/1876248\/0\/en\/Livent-Class-Action-Deadline-Bernstein-Liebhard-LLP-Announces-That-Approximately-Three-Weeks-Remain-to-Make-a-Motion-for-Lead-Plaintiff-in-a-Securities-Class-Action-Lawsuit-Against.html","symbols":["LTHM.US"],"tags":["BERNSTEIN LIEBHARD LLP","CLASS ACTION"],"sentiment":{"polarity":0.965,"neg":0.072,"neu":0.816,"pos":0.113}},{"date":"2019-06-28T19:00:00+00:00","title":"JMIA, FND & LTHM - Bronstein, Gewirtz & Grossman, LLC Class Action Update","content":"NEW YORK, June  28, 2019  (GLOBE NEWSWIRE) -- Attorney Advertising -- Bronstein, Gewirtz & Grossman, LLC reminds investors that a class action lawsuit has been filed against the following publicly-traded companies. You can review a copy of the Complaints by visiting the links below or you may contact Peretz Bronstein, Esq. or his Investor Relations Analyst, Yael Hurwitz of Bronstein, Gewirtz & Grossman, LLC at 212-697-6484. If you suffered a loss, you can request that the Court appoint you as lead plaintiff.  Your ability to share in any recovery doesn't require that you serve as a lead plaintiff. A lead plaintiff acts on behalf of all other class members in directing the litigation. The lead plaintiff can select a law firm of its choice. An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\n\nJumia Technologies AG (NYSE: JMIA)\r\nClass Period: April 12, 2019 -May 9, 2019\r\nDeadline: July 15, 2019 For more info:www.bgandg.com\/jmia\n\nThe complaint alleges that throughout the Class Period, defendants made false and\/or misleading statements and\/or failed to disclose that: (1) Jumia had materially overstated its active customers and active merchants; (2) Jumia’s representations about its orders, order cancellations, undelivered orders and returned orders lacked a sufficient factual basis and materially overstated Jumia’s sales; (3) Jumia failed to sufficiently disclose related party transactions; (4) Jumia’s financial statements were presented in violation of applicable accounting standards; and (5) as a result of the foregoing, defendants’ positive statements about Jumia’s business, operations, and prospects, were materially misleading and lacked a reasonable basis.\n\nFloor & Decor Holdings, Inc. (NYSE: FND)\r\nClass Period: May 23, 2018 - August 1, 2018,\r\nDeadline: July 19, 2019 For more info:www.bgandg.com\/fnd\n\nThe complaint alleges that throughout the Floor & Decor’s May 24, 2018 Secondary Offering documents included false and misleading statements. Specifically, the complaint alleges that the defendants knew but failed to disclose that the company had already begun to experience declining sales trends that would ultimately result in the reduction of its fiscal 2018 sales and adjusted earnings per share guidance, which the company publicly increased in May 2018. While the company’s stock was artificially inflated, insiders sold more than 10.3 million shares of Floor & Decor common stock, including shares sold in the May 24, 2018 Secondary Offering,\n\nLivent Corporation (NYSE: LTHM)\r\nClass Period: Livent securities purchased pursuant and\/or traceable to the company’s initial public offering completed in October 2018 (the “IPO” or the “Offering”).\r\nDeadline: July 22, 2019 For more info:www.bgandg.com\/lthm\n\nThe lawsuit alleges that the Registration Statement was false and\/or contained misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) Livent would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) Livent had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (4) Livent’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\n\nContact:\r\nBronstein, Gewirtz & Grossman, LLC\r\n Peretz Bronstein or Yael Hurwitz \r\n212-697-6484 | info@bgandg.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/28\/1876218\/9788\/en\/JMIA-FND-LTHM-Bronstein-Gewirtz-Grossman-LLC-Class-Action-Update.html","symbols":["FND.US","JMIA.US","LTHM.US"],"tags":["BRONSTEIN","CLASS ACTION","GEWIRTZ & GROSSMAN","LLC"],"sentiment":{"polarity":-0.94,"neg":0.108,"neu":0.812,"pos":0.08}},{"date":"2019-06-28T01:30:00+00:00","title":"Bragar Eagel & Squire, P.C. Reminds Investors That Class Action Lawsuits Have Been Filed Against Dynagas LNG Partners, Floor & Decor Holdings, RCI Hospitality Holdings, and Livent Corporation and Encourages Investors to Contact the Firm","content":"NEW YORK, June  27, 2019  (GLOBE NEWSWIRE) -- Bragar Eagel & Squire, P.C. reminds investors that class action lawsuits have been commenced on behalf of stockholders of Dynagas LNG Partners LP, Floor & Decor Holdings, Inc., RCI Hospitality Holdings, Inc., and Livent Corporation. Stockholders have until the deadlines below to petition the court to serve as lead plaintiff. Additional information about each case can be found at the link provided.\n\nDynagas LNG Partners, LP (NYSE: DLNG)\n\nClass Period: February 16, 2018 - March 21, 2019\n\nLead Plaintiff Deadline: July 16, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made materially false and misleading statements and omitted material adverse facts to conceal the unfavorable terms of the company’s long-term contracts on its liquid natural gas ships, Arctic Aurora and Ob River, and its resulting inability to sustain its quarterly distributions.  As a result of defendants’ false and misleading statements and omissions, Dynagas securities traded at artificially inflated prices during the Class Period.  Such inflation was removed when it was revealed that the Arctic Aurora and the Ob River were commencing employment under new extended charter contracts which were at lower rates compared to the previous charter contracts, thereby undermining the company’s ability to make future distributions.\n\nTo learn more about the Dynagas class action go to: http:\/\/bespc.com\/dlng\/.\n\nFloor & Decor Holdings, Inc. (NYSE: FND)\n\nClass Period: May 23, 2018 - August 1, 2018\n\nLead Plaintiff Deadline: July 19, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made false and misleading statements and\/or failed to disclose adverse information regarding Floor & Decor’s business and prospects.  Specifically, the complaint alleges that each of the statements in the Registration Statement filed with the SEC regarding the current financial condition of the company were materially false and misleading.  The complaint alleges that prior to the May 24 Secondary Offering, defendants knew, but failed to disclose, that the company had already begun to experience declining sales trends that would ultimately result in the reduction of its fiscal 2018 sales and adjusted earnings per share guidance, which had been increased as recently as May 2018.  As a result of this adverse information being withheld from the market, the price of the company’s stock was artificially inflated during the Class Period, allowing company insiders to sell more than 10.3 million shares of Floor & Decor common stock, including the shares sold in the May 24 Secondary Offering, for proceeds of more than $466 million.\n\nTo learn more about the Floor & Decor class action go to: http:\/\/bespc.com\/fnd-2.\n\nRCI Hospitality Holdings, Inc. (NASDAQ: RICK)\n\nClass Period: August 8, 2017 to May 10, 2019\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made materially false and\/or misleading statements, as well as failed to disclose material adverse facts about the company’s business, operations, and prospects.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) the company engaged in numerous transactions with the CEO, including lending him significant sums of money; (2) these practices were reasonably likely to lead to regulatory scrutiny of the company; (3) as a result of investigations into the company’s governance, the company would be unable to timely file its financial statements; and (4) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects were materially false and\/or misleading and\/or lacked a reasonable basis\n\nFor more information on the RCI Hospitality Holdings class action go to: https:\/\/bespc.com\/rick\/\n\nLivent Corporation (NYSE: LTHM)\n\nClass Period: Pursuant to and\/or traceable to the Initial Public Offering (“IPO”) on or about October 12, 2018\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that the Registration Statement was false and misleading and omitted to state material adverse facts.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the company’s existing contracts; (4) the company’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent class action go to: http:\/\/www.bespc.com\/lthm\n\nBragar Eagel & Squire, P.C. is a New York-based law firm concentrating in commercial and securities litigation.  For additional information about Bragar Eagel & Squire, P.C. please go to www.bespc.com.  Attorney advertising.  Prior results do not guarantee similar outcomes.\n\nContacts\r\nBragar Eagel & Squire, P.C.\r\nBrandon Walker, Esq.\r\nMelissa Fortunato, Esq.\r\n(212) 355-4648\r\ninvestigations@bespc.com\r\nwww.bespc.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/28\/1875723\/0\/en\/Bragar-Eagel-Squire-P-C-Reminds-Investors-That-Class-Action-Lawsuits-Have-Been-Filed-Against-Dynagas-LNG-Partners-Floor-Decor-Holdings-RCI-Hospitality-Holdings-and-Livent-Corporati.html","symbols":["DLNG.US","FND.US","LTHM.US","RICK.US"],"tags":["BRAGAR EAGEL & SQUIRE","CLASS ACTION","DYNAGAS LNG PARTNERS LP","FLOOR & DECOR HOLDINGS","INC","INVESTORS","LEGAL","LIVENT CORPORATION","RCI HOSPITALITY HOLDINGS","STOCKS"],"sentiment":{"polarity":-0.979,"neg":0.098,"neu":0.842,"pos":0.06}},{"date":"2019-06-26T21:16:00+00:00","title":"Shareholder Alert: Livent Corporation – Kehoe Law Firm, P.C. Investigating Claims on Behalf of Livent Corporation Investors - LTHM","content":"PHILADELPHIA, June  26, 2019  (GLOBE NEWSWIRE) -- Kehoe Law Firm, P.C. is investigating claims on behalf of investors of Livent Corporation (“Livent” or the “Company”).  The investigation concerns whether Livent (NYSE: LTHM) and certain officers and\/or directors engaged in securities fraud or other unlawful business practices.\n\nOn May 22, 2019, a securities class action lawsuit was filed on behalf of individuals who purchased, or otherwise acquired, Livent securities pursuant and\/or traceable to the registration statement and prospectus issued in connection with Livent’s October 2018 initial public offering (“IPO”).  The class action lawsuit alleges that the Defendants violated the Securities Act of 1933.\n\nLivent investors have until July 22, 2019 to move the Court to seek appointment as lead plaintiff in the securities class action.  Livent shareholders who have suffered losses are encouraged to click Join a Securities Class Action or contact either John Kehoe, Esq, (215) 792-6676, Ext. 801, jkehoe@kehoelawfirm.com or Michael Yarnoff, Esq., (215) 792-6676, Ext. 804, myarnoff@kehoelawfirm.com, info@kehoelawfirm.com, to learn more about the Livent investigation or participating in the class action lawsuit.\n\nAccording to the class action complaint:\n\nIn October 2018, Livent completed its initial public offering (“IPO”), selling 23 million shares of common stock priced at $17.00 per share.  Livent received $369 million from the IPO, net of underwriting discounts and commissions.\n\nOn February 11, 2019, Livent released its fourth quarter 2018 financial results that missed top-line sales targets, citing difficulties negotiating contracts with existing customers.\n\nOn this news, Livent’s stock price fell $0.57 per share, over 4%, to close at $12.55 per share on February 12, 2019.\n\nOn May 8, 2019, Livent announced disappointing financial results for the first quarter of 2019, citing further customer issues.\n\nOn this news, Livent’s stock price fell $1.70 per share, nearly 16%, to close at $9.03 per share on May 8, 2019.\n\nFurther, the class action alleges that Livent’s IPO Registration Statement was false and misleading and omitted to state material adverse facts. Specifically, the Livent Defendants failed to disclose to investors: (1) that a supply contract with Nemaska Lithium Inc. had been terminated; (2) that, as a result, Livent would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) that Livent had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) that Livent’s margins were squeezed due to the customer's increased orders; and (5) that, as a result of the foregoing, the Livent Defendants' positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nLivent shareholders who suffered losses are encouraged to click Join a Securities Class Action or contact either John Kehoe, Esq, (215) 792-6676, Ext. 801, jkehoe@kehoelawfirm.com or Michael Yarnoff, Esq., (215) 792-6676, Ext. 804, myarnoff@kehoelawfirm.com, info@kehoelawfirm.com, to learn more about the Livent investigation or participating in the class action lawsuit.\n\nKehoe Law Firm, P.C., with offices in New York and Philadelphia, is a multidisciplinary, plaintiff–side law firm dedicated to protecting investors from securities fraud, breaches of fiduciary duties, and corporate misconduct.  Combined, the partners at Kehoe Law Firm have served as Lead Counsel or Co-Lead Counsel in cases that have recovered more than $10 billion on behalf of institutional and individual investors.","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/26\/1874896\/0\/en\/Shareholder-Alert-Livent-Corporation-Kehoe-Law-Firm-P-C-Investigating-Claims-on-Behalf-of-Livent-Corporation-Investors-LTHM.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","KEHOE LAW FIRM"],"sentiment":{"polarity":-0.813,"neg":0.098,"neu":0.811,"pos":0.091}},{"date":"2019-06-26T19:34:00+00:00","title":"LEAD PLAINTIFF DEADLINE ALERT: Faruqi & Faruqi, LLP Encourages Investors Who Suffered Losses Exceeding $50,000 Investing In Livent Corporation To Contact The Firm","content":"NEW YORK, June  26, 2019  (GLOBE NEWSWIRE) -- Faruqi & Faruqi, LLP, a leading national securities law firm, reminds investors in Livent Corporation (\"Livent\" or the \"Company\")(NYSE:LTHM) of the July 22, 2019 deadline to seek the role of lead plaintiff in a federal securities class action that has been filed against the Company.\n\nIf you invested in Livent stock or options pursuant and\/or traceable to the Company's October 2018 initial public offering (\"IPO\") and would like to discuss your legal rights, click here: www.faruqilaw.com\/LTHM. There is no cost or obligation to you.\n\nYou can also contact us by calling Richard Gonnello toll free at 877-247-4292 or at 212-983-9330 or by sending an e-mail to rgonnello@faruqilaw.com.\n\nCONTACT:\r\n FARUQI & FARUQI, LLP \r\n 685 Third Avenue, 26th Floor \r\n New York, NY 10017 \r\n Attn:  Richard Gonnello, Esq. \r\n rgonnello@faruqilaw.com \r\n Telephone: (877) 247-4292 or (212) 983-9330\n\nThe lawsuit has been filed in the U.S. District Court for the Eastern District of Pennsylvania on behalf of all those who purchased Livent securities pursuant and\/or traceable to the Company's October 2018 IPO. The case, Nikolov v. Livent Corporation et al., No. 19-cv-19-cv-02218-CFK was filed on May 22, 2019 and has been assigned to Judge Chad F. Kenney.\n\nThe lawsuit focuses on whether the Company and its executives violated federal securities laws by failing to disclose to investors: (1) that a supply contract with Nemaska Lithium Inc. had been terminated; (2) that, as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) that the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) that the Company's margins were squeezed due to the customer's increased orders; and (5) that, as a result of the foregoing, Defendants' positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nSince Livent's October 2018 IPO, the Company's share price has declined from its IPO price of $17 by approximately 60%.\n\nThe court-appointed lead plaintiff is the investor with the largest financial interest in the relief sought by the class who is adequate and typical of class members who directs and oversees the litigation on behalf of the putative class. Any member of the putative class may move the Court to serve as lead plaintiff through counsel of their choice, or may choose to do nothing and remain an absent class member. Your ability to share in any recovery is not affected by the decision to serve as a lead plaintiff or not.\n\nFaruqi & Faruqi, LLP also encourages anyone with information regarding Livent's conduct to contact the firm, including whistleblowers, former employees, shareholders and others.\n\nAttorney Advertising. The law firm responsible for this advertisement is Faruqi & Faruqi, LLP (www.faruqilaw.com). Prior results do not guarantee or predict a similar outcome with respect to any future matter. We welcome the opportunity to discuss your particular case. All communications will be treated in a confidential manner.","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/26\/1874816\/683\/en\/LEAD-PLAINTIFF-DEADLINE-ALERT-Faruqi-Faruqi-LLP-Encourages-Investors-Who-Suffered-Losses-Exceeding-50-000-Investing-In-Livent-Corporation-To-Contact-The-Firm.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","FARUQI & FARUQI LLP"],"sentiment":{"polarity":0.977,"neg":0.052,"neu":0.841,"pos":0.107}},{"date":"2019-06-26T13:22:00+00:00","title":"SHAREHOLDER ALERT: PSMT KSHB LTHM CYH: The Law Offices of Vincent Wong Reminds Investors of Important Class Action Deadlines","content":"NEW YORK, June  26, 2019  (GLOBE NEWSWIRE) -- The Law Offices of Vincent Wong announce that class actions have commenced on behalf of shareholders of the following companies. If you suffered a loss you have until the lead plaintiff deadline to request that the court appoint you as lead plaintiff.\n\nPriceSmart, Inc. (NASDAQGS: PSMT)\r\n Lead Plaintiff Deadline: July 22, 2019\r\n Class Period: October 26, 2017 and October 25, 2018\n\nGet additional information about PSMT: http:\/\/www.wongesq.com\/pslra-1\/pricesmart-inc-loss-submission-form?wire=3\n\nKushCo Holdings, Inc. (OTCMKTS: KSHB)\r\n Lead Plaintiff Deadline: July 1, 2019\r\n Class Period: July 13, 2017 and April 9, 2019\n\nGet additional information about KSHB: http:\/\/www.wongesq.com\/pslra-1\/kushco-holdings-inc-loss-submission-form?wire=3\n\nLivent Corporation (NYSE: LTHM)\r\n Lead Plaintiff Deadline: July 22, 2019\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\n\nGet additional information about LTHM: http:\/\/www.wongesq.com\/pslra-1\/livent-corporation-loss-submission-form?wire=3\n\nCommunity Health Systems, Inc. (NYSE: CYH)\r\n Lead Plaintiff Deadline: July 29, 2019\r\n Class Period: February 20, 2017 and February 27, 2018\n\nGet additional information about CYH: http:\/\/www.wongesq.com\/pslra-1\/community-health-systems-inc-loss-submission-form?wire=3\n\nTo learn more contact Vincent Wong, Esq. either via email vw@wongesq.com or by telephone at 212.425.1140.\n\nVincent Wong, Esq. is an experienced attorney that has represented investors in securities litigations involving financial fraud and violations of shareholder rights. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nVincent Wong, Esq.\r\n39 East Broadway\r\nSuite 304\r\nNew York, NY 10002\r\nTel. 212.425.1140\r\nFax. 866.699.3880\r\nE-Mail: vw@wongesq.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/26\/1874569\/31847\/en\/SHAREHOLDER-ALERT-PSMT-KSHB-LTHM-CYH-The-Law-Offices-of-Vincent-Wong-Reminds-Investors-of-Important-Class-Action-Deadlines.html","symbols":["CYH.US","LTHM.US"],"tags":["CLASS ACTION","THE LAW OFFICES OF VINCENT WONG"],"sentiment":{"polarity":-0.89,"neg":0.06,"neu":0.922,"pos":0.018}},{"date":"2019-06-25T13:29:00+00:00","title":"The Klein Law Firm Reminds Investors of Class Actions on Behalf of Shareholders of PSMT, LTHM, CYH and PVTL","content":"NEW YORK, June  25, 2019  (GLOBE NEWSWIRE) -- The Klein Law Firm announces that class action complaints have been filed on behalf of shareholders of the following companies. If you suffered a loss you have until the lead plaintiff deadline to request that the court appoint you as lead plaintiff.\n\nPriceSmart, Inc. (NASDAQGS: PSMT)\r\n Class Period: October 26, 2017 to October 25, 2018\r\n Lead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that throughout the class period PriceSmart, Inc. made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company’s omni-channel business strategy had failed to reach key operating goals; (2) the Company’s South America distribution strategy had failed to realize key cost saving goals; (3) the Company had invested Trinidad and Tobago dollars into certificates of deposits with financial institutions; (4) that these investments had been improperly classified as cash and cash equivalents; (5) the relevant corrections would materially impact financial statements; (6) there was a material weakness in the Company’s internal controls over financial reporting; (7) increasing competition negatively impacted the Company’s revenue and profitability; and (8) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nGet additional information about the PSMT lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/pricesmart-inc-loss-submission-form?wire=3\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\n Lead Plaintiff Deadline: July 22, 2019\n\nLivent Corporation allegedly made materially false and\/or misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5) as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nGet additional information about the LTHM lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/livent-corporation-loss-submission-form?wire=3\n\nCommunity Health Systems, Inc. (NYSE: CYH)\r\n Class Period: February 20, 2017 to February 27, 2018\r\n Lead Plaintiff Deadline: July 29, 2019\n\nThe complaint alleges that throughout the class period Community Health Systems, Inc. made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company had understated its contractual allowances; (2) the Company had understated its provision for bad debts; (3) as a result, the Company had overstated its net operating revenue; (4) as a result, the Company had understated its net loss; and (5) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nGet additional information about the CYH lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/community-health-systems-inc-loss-submission-form?wire=3\n\nPivotal Software, Inc. (NYSE: PVTL)\r\n Class Period: investors who purchased common stock pursuant or traceable to the April 2018 initial public offering and\/or Pivotal securities between April 24, 2018 and June 4, 2019.\r\n Lead Plaintiff Deadline: August 19, 2019\n\nAccording to the complaint, Pivotal Software, Inc. allegedly made materially false and\/or misleading statements and\/or failed to disclose that: (i) Pivotal was facing major problems with its sales execution and a complex technology landscape; (ii) the foregoing headwinds resulted in deferred sales, lengthening sales cycles, and diminished growth as its customers and the industry’s sentiment shifted away from Pivotal’s principal products because the Company’s products were outdated, inadequate, and incompatible with the industry-standard platform; and (iii) as a result, the Company’s public statements were materially false and misleading at all relevant times.\n\nGet additional information about the PVTL lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/pivotal-software-inc-loss-submission-form?wire=3\n\nYour ability to share in any recovery doesn’t require that you serve as a lead plaintiff. There is no cost or obligation to you. If you suffered a loss during the class period and wish to obtain additional information, please contact J. Klein, Esq. by telephone at 212-616-4899 or visit the webpages provided.\n\nJ. Klein, Esq. represents investors and participates in securities litigations involving financial fraud throughout the nation. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nJ. Klein, Esq.\r\nEmpire State Building\r\n350 Fifth Avenue\r\n59th Floor\r\nNew York, NY 10118\r\njk@kleinstocklaw.com\r\nTelephone: (212) 616-4899\r\nFax: (347) 558-9665\r\nwww.kleinstocklaw.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/25\/1873904\/0\/en\/The-Klein-Law-Firm-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders-of-PSMT-LTHM-CYH-and-PVTL.html","symbols":["CYH.US","LTHM.US","PVTL.US"],"tags":["CLASS ACTION","THE KLEIN LAW FIRM"],"sentiment":{"polarity":-0.994,"neg":0.123,"neu":0.821,"pos":0.055}},{"date":"2019-06-24T20:00:00+00:00","title":"INVESTOR ACTION REMINDER: The Schall Law Firm Announces the Filing of a Class Action Lawsuit Against Livent Corporation and Encourages Investors with Losses in Excess of $100,000 to Contact the Firm","content":"LOS ANGELES, June  24, 2019  (GLOBE NEWSWIRE) -- The Schall Law Firm, a national shareholder rights litigation firm, announces the filing of a class action lawsuit against Livent Corporation (“Livent” or “the Company”) (NYSE: LTHM) for violations of the federal securities laws.\n\nInvestors who purchased the Company’s shares pursuant to and\/or traceable to the Company’s Initial Public Offering in October 2018 (the “IPO”) are encouraged to contact the firm before July 22, 2019.\n\nIf you are a shareholder who suffered a loss, click here to participate.\n\nWe also encourage you to contact Brian Schall of the Schall Law Firm, 1880 Century Park East, Suite 404, Los Angeles, CA 90067, at 424-303-1964, to discuss your rights free of charge. You can also reach us through the firm's website at www.schallfirm.com or by email at brian@schallfirm.com.\n\nThe class, in this case, has not yet been certified, and until certification occurs, you are not represented by an attorney. If you choose to take no action, you can remain an absent class member.\n\nAccording to the Complaint, the Company made false and misleading statements to the market. Livent’s supply contract with Nemaska Lithium Inc. was terminated. As a result, the Company was forced to fulfill customer contracts using different vendors with unfavorable terms, reducing revenues and lowering margins. Livent had a long-standing contract to supply lithium hydroxide to a customer at a significantly lower price than its existing contacts. When the customer increased its orders, the Company’s margins were further squeezed. Based on these facts, the Company’s public statements were false and materially misleading throughout the IPO period. When the market learned the truth about Livent, investors suffered damages.\n\nJoin the case to recover your losses.\n\nThe Schall Law Firm represents investors around the world and specializes in securities class action lawsuits and shareholder rights litigation.\n\nThis press release may be considered Attorney Advertising in some jurisdictions under the applicable law and rules of ethics.\n\nCONTACT:\n\nThe Schall Law Firm\r\n Brian Schall, Esq.,\r\nwww.schallfirm.com\r\nOffice: 310-301-3335\r\nCell: 424-303-1964\r\ninfo@schallfirm.com\n\nSOURCE:\n\nThe Schall Law Firm","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/24\/1873288\/0\/en\/INVESTOR-ACTION-REMINDER-The-Schall-Law-Firm-Announces-the-Filing-of-a-Class-Action-Lawsuit-Against-Livent-Corporation-and-Encourages-Investors-with-Losses-in-Excess-of-100-000-to-.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","LAWSUIT","LIVENT","LTHM","SCHALL LAW","SCHALL LAW FIRM","SHAREHOLDERS"],"sentiment":{"polarity":-0.926,"neg":0.113,"neu":0.816,"pos":0.071}},{"date":"2019-06-24T13:13:00+00:00","title":"CLASS ACTION UPDATE for PSMT, EQBK, LTHM and CYH: Levi & Korsinsky, LLP Reminds Investors of Class Actions on Behalf of Shareholders","content":"NEW YORK, June  24, 2019  (GLOBE NEWSWIRE) -- Levi & Korsinsky, LLP announces that class action lawsuits have commenced on behalf of shareholders of the following publicly-traded companies. Shareholders interested in serving as lead plaintiff have until the deadlines listed to petition the court and further details about the cases can be found at the links provided. There is no cost or obligation to you.\n\nPriceSmart, Inc. (NASDAQGS: PSMT)\r\n Class Period: October 26, 2017 - October 25, 2018\r\nLead Plaintiff Deadline: July 22, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/pricesmart-inc-loss-form?wire=3\n\nAllegations: PriceSmart, Inc. made materially false and\/or misleading statements throughout the class period and\/or failed to disclose that: (1) the Company’s omni-channel business strategy had failed to reach key operating goals; (2) the Company’s South America distribution strategy had failed to realize key cost saving goals; (3) the Company had invested Trinidad and Tobago dollars into certificates of deposits with financial institutions; (4) that these investments had been improperly classified as cash and cash equivalents; (5) the relevant corrections would materially impact financial statements; (6) there was a material weakness in the Company’s internal controls over financial reporting; (7) increasing competition negatively impacted the Company’s revenue and profitability; and (8) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the PriceSmart, Inc. class action contact jlevi@levikorsinsky.com.\n\nEquity Bancshares, Inc. (NASDAQ: EQBK)\r\n Class Period: May 11, 2018 - April 22, 2019\r\nLead Plaintiff Deadline: July 12, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/equity-bancshares-inc-loss-form?wire=3\n\nAllegations: During the class period, Equity Bancshares, Inc. made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company lacked adequate internal controls to assess credit risk; (2) as a result, certain of the Company’s loans posed an increased risk of loss; (3) as a result, the Company was reasonably likely to incur significant losses for certain substandard loans; and (4) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Equity Bancshares, Inc. class action contact jlevi@levikorsinsky.com.\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\nLead Plaintiff Deadline: July 22, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/livent-corporation-loss-form?wire=3\n\nAllegations: Livent Corporation made materially false and\/or misleading statements throughout the class period and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5) as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent Corporation class action contact jlevi@levikorsinsky.com.\n\nCommunity Health Systems, Inc. (NYSE: CYH)\r\n Class Period: February 20, 2017 - February 27, 2018\r\nLead Plaintiff Deadline: July 29, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/community-health-systems-inc-loss-form?wire=3\n\nAllegations: Community Health Systems, Inc. made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company had understated its contractual allowances; (2) the Company had understated its provision for bad debts; (3) as a result, the Company had overstated its net operating revenue; (4)  as a result, the Company had understated its net loss; and (5) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Community Health Systems, Inc. class action contact jlevi@levikorsinsky.com.\n\nYou have until the lead plaintiff deadlines to request the court appoint you as lead plaintiff. Your ability to share in any recovery doesn’t require that you serve as a lead plaintiff.\r\n\r\nLevi & Korsinsky is a national firm with offices in New York, California, Connecticut, and Washington D.C. The firm’s attorneys have extensive expertise and experience representing investors in securities litigation and have recovered hundreds of millions of dollars for aggrieved shareholders. Attorney advertising. Prior results do not guarantee similar outcomes.\r\n\r\nCONTACT:\r\nLevi & Korsinsky, LLP\r\nJoseph E. Levi, Esq.\r\n55 Broadway, 10th Floor\r\nNew York, NY 10006\r\njlevi@levikorsinsky.com\r\nTel: (212) 363-7500\r\nFax: (212) 363-7171\r\nwww.zlk.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/24\/1873067\/3080\/en\/CLASS-ACTION-UPDATE-for-PSMT-EQBK-LTHM-and-CYH-Levi-Korsinsky-LLP-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders.html","symbols":["CYH.US","EQBK.US","LTHM.US"],"tags":["CLASS ACTION","LEVI & KORSINSKY","LLP"],"sentiment":{"polarity":-0.919,"neg":0.092,"neu":0.829,"pos":0.079}},{"date":"2019-06-22T01:30:00+00:00","title":"Bragar Eagel & Squire, P.C. Reminds Investors That Class Action Lawsuits Have Been Filed Against Livent Corporation, PriceSmart, Hecla Mining Company, and A.O. Smith Corporation and Encourages Investors to Contact the Firm","content":"NEW YORK, June  21, 2019  (GLOBE NEWSWIRE) -- Bragar Eagel & Squire, P.C. reminds investors that class action lawsuits have been commenced on behalf of stockholders of Livent Corporation, PriceSmart, Inc., Hecla Mining Company, and A.O. Smith Corporation.  Stockholders have until the deadlines listed below to petition the court to serve as lead plaintiff.  Additional information about each case can be found at the link provided.\n\nLivent Corporation (NYSE: LTHM)\n\nClass Period: Between October 7, 2018 and May 22, 2019  and\/or traceable to the Initial Public Offering (“IPO”) on or about October 12, 2018\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that the Registration Statement was false and misleading and omitted to state material adverse facts.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the company’s existing contracts; (4) the company’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent class action go to: http:\/\/bespc.com\/lthm\/.\n\nPriceSmart, Inc. (NASDAQ: PSMT)\n\nClass Period: October 26, 2017 - October 25, 2018\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made materially false and\/or misleading statements, as well as failed to disclose material adverse facts about the company’s business, operations, and prospects.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) the company’s omni-channel business strategy had failed to reach key operating goals; (2) the company’s South America distribution strategy had failed to realize key cost saving goals; (3) the company had invested Trinidad and Tobago dollars into certificates of deposits with financial institutions; (4) these investments had been improperly classified as cash and cash equivalents; (5) the relevant corrections would materially impact financial statements; (6) there was a material weakness in the company’s internal controls over financial reporting; (7) increasing competition negatively impacted the company’s revenue and profitability; and (8) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the PriceSmart class action go to: http:\/\/bespc.com\/psmt\/.\n\nHecla Mining Company (NYSE: HL)\n\nClass Period: March 19, 2018 - May 8, 2019\n\nLead Plaintiff Deadline: July 23, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made false and\/or misleading statements and\/or failed to disclose that: (1) Hecla’s Nevada operations were hemorrhaging cash due to a multitude of material problems identified by defendants during Hecla’s extensive due diligence of the Nevada mines before the Class Period; (2) due to these material problems, defendants had no reasonable basis for their representations that the Nevada operations would be in a position to have positive or self-funding cash flow; and (3) as a result, Hecla’s public statements were materially false and misleading at all relevant times.\n\nTo learn more about the Hecla class action go to: http:\/\/bespc.com\/hl\/.\n\nA.O. Smith Corporation (NYSE: AOS)\n\nClass Period: July 26, 2016 to May 16, 2019\n\nLead Plaintiff Deadline: July 29. 2019\n\nThe complaint alleges that throughout the Class Period defendants made false and\/or misleading statements and\/or failed to disclose that: (a) A.O. Smith had undisclosed business connections and entanglements with UTP through which it funneled up to 75% of its China product sales; (b) A.O. Smith had used UTP to engage in channel stuffing by artificially inflating inventories purportedly sold through distributors that were not based on consumer demand, thereby approximately doubling the normal level of inventory at such distributors; (c) A.O. Smith had used its UTP relationship to artificially inflate the sales figures it reported to investors by as much as 8% and to conceal worsening sales trends that the Company was experiencing in China; (d) A.O. Smith’s sales growth had been primarily in lower margin products as its higher priced products were being undercut by competition in “second-tier” Chinese cities, causing the Company to experience significant margin pressures; (e) A.O. Smith had increased its cash reserves in China to over $530 million in furtherance of its channel stuffing and sales manipulation scheme, encumbering the Company’s ability to repatriate the cash or use it for capital expenditures; and (f) as a result of (a)-(e) above, A.O. Smith’s business, operations, and prospects were significantly worse than publicly represented and the Company was poised for sales and earnings declines in China, its most important international market.\n\nTo learn more about the A.O. Smith class action go to: go to https:\/\/bespc.com\/aos\/.\n\nBragar Eagel & Squire, P.C. is a New York-based law firm concentrating in commercial and securities litigation.  For additional information about Bragar Eagel & Squire, P.C. please go to www.bespc.com.  Attorney advertising.  Prior results do not guarantee similar outcomes.\n\nContacts\n\nBragar Eagel & Squire, P.C.\n\nBrandon Walker, Esq.\n\nMelissa Fortunato, Esq.\n\n(212) 355-4648\n\ninvestigations@bespc.com\n\nwww.bespc.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/22\/1872666\/0\/en\/Bragar-Eagel-Squire-P-C-Reminds-Investors-That-Class-Action-Lawsuits-Have-Been-Filed-Against-Livent-Corporation-PriceSmart-Hecla-Mining-Company-and-A-O-Smith-Corporation-and-Encour.html","symbols":["AOS.US","HL.US","LTHM.US","PSMT.US"],"tags":["BRAGAR EAGEL & SQUIRE","CLASS ACTION","LEGAL","LIVENT CORPORATION","SHAREHOLDER ALERT","STOCKS"],"sentiment":{"polarity":-0.992,"neg":0.102,"neu":0.844,"pos":0.054}},{"date":"2019-06-20T13:48:00+00:00","title":"SHAREHOLDER ALERT: BE S KSHB LTHM: The Law Offices of Vincent Wong Reminds Investors of Important Class Action Deadlines","content":"NEW YORK, June  20, 2019  (GLOBE NEWSWIRE) -- The Law Offices of Vincent Wong announce that class actions have commenced on behalf of shareholders of the following companies. If you suffered a loss you have until the lead plaintiff deadline to request that the court appoint you as lead plaintiff.\n\nBloom Energy Corporation (NYSE: BE)\r\n Lead Plaintiff Deadline: July 29, 2019\r\n Class Period: on behalf of all persons who purchased or otherwise acquired Bloom Energy common stock pursuant or traceable to Bloom Energy’s July 2018 IPO.\n\nGet additional information about BE: http:\/\/www.wongesq.com\/pslra-1\/bloom-energy-corporation-loss-submission-form?wire=3\n\nSprint Corporation (NYSE: S)\r\n Lead Plaintiff Deadline: June 21, 2019\r\n Class Period: January 31, 2019 and April 16, 2019\n\nGet additional information about S: http:\/\/www.wongesq.com\/pslra-1\/sprint-corporation-loss-submission-form?wire=3\n\nKushCo Holdings, Inc. (OTCMKTS: KSHB)\r\n Lead Plaintiff Deadline: July 1, 2019\r\n Class Period: July 13, 2017 and April 9, 2019\n\nGet additional information about KSHB: http:\/\/www.wongesq.com\/pslra-1\/kushco-holdings-inc-loss-submission-form?wire=3\n\nLivent Corporation (NYSE: LTHM)\r\n Lead Plaintiff Deadline: July 22, 2019\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\n\nGet additional information about LTHM: http:\/\/www.wongesq.com\/pslra-1\/livent-corporation-loss-submission-form?wire=3\n\nTo learn more contact Vincent Wong, Esq. either via email vw@wongesq.com or by telephone at 212.425.1140.\n\nVincent Wong, Esq. is an experienced attorney that has represented investors in securities litigations involving financial fraud and violations of shareholder rights. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nVincent Wong, Esq.\r\n39 East Broadway\r\nSuite 304\r\nNew York, NY 10002\r\nTel. 212.425.1140\r\nFax. 866.699.3880\r\nE-Mail: vw@wongesq.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/20\/1871945\/31847\/en\/SHAREHOLDER-ALERT-BE-S-KSHB-LTHM-The-Law-Offices-of-Vincent-Wong-Reminds-Investors-of-Important-Class-Action-Deadlines.html","symbols":["BE.US","LTHM.US","S.US"],"tags":["CLASS ACTION","THE LAW OFFICES OF VINCENT WONG"],"sentiment":{"polarity":-0.81,"neg":0.056,"neu":0.912,"pos":0.032}},{"date":"2019-06-19T18:02:00+00:00","title":"Livent – LTHM – Kehoe Law Firm, P.C. Investigates Claims on Behalf of Livent Corporation Investors","content":"PHILADELPHIA, June  19, 2019  (GLOBE NEWSWIRE) -- Kehoe Law Firm, P.C. is investigating claims on behalf of investors of Livent Corporation (“Livent” or the “Company”).  The investigation concerns whether Livent (NYSE: LTHM) and certain officers and\/or directors engaged in securities fraud or other unlawful business practices.\n\nOn May 22, 2019, a securities class action lawsuit was filed on behalf of individuals who purchased, or otherwise acquired, Livent securities pursuant and\/or traceable to the registration statement and prospectus issued in connection with Livent’s October 2018 initial public offering (“IPO”).  The class action lawsuit alleges that the Defendants violated the Securities Act of 1933.\n\nLivent investors have until July 22, 2019 to move the Court to seek appointment as lead plaintiff in the securities class action.  Livent shareholders who have suffered losses are encouraged to click Join a Securities Class Action or contact either John Kehoe, Esq, (215) 792-6676, Ext. 801, jkehoe@kehoelawfirm.com or Michael Yarnoff, Esq., (215) 792-6676, Ext. 804, myarnoff@kehoelawfirm.com, info@kehoelawfirm.com, to learn more about the Livent investigation or participating in the class action lawsuit.\n\nAccording to the class action complaint:\n\nIn October 2018, Livent completed its initial public offering (“IPO”), selling 23 million shares of common stock priced at $17.00 per share.  Livent received $369 million from the IPO, net of underwriting discounts and commissions.\n\nOn February 11, 2019, Livent released its fourth quarter 2018 financial results that missed top-line sales targets, citing difficulties negotiating contracts with existing customers.\n\nOn this news, Livent’s stock price fell $0.57 per share, over 4%, to close at $12.55 per share on February 12, 2019.\n\nOn May 8, 2019, Livent announced disappointing financial results for the first quarter of 2019, citing further customer issues.\n\nOn this news, Livent’s stock price fell $1.70 per share, nearly 16%, to close at $9.03 per share on May 8, 2019.\n\nFurther, the class action alleges that Livent’s IPO Registration Statement was false and misleading and omitted to state material adverse facts. Specifically, the Livent Defendants failed to disclose to investors: (1) that a supply contract with Nemaska Lithium Inc. had been terminated; (2) that, as a result, Livent would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) that Livent had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) that Livent’s margins were squeezed due to the customer's increased orders; and (5) that, as a result of the foregoing, the Livent Defendants' positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nLivent shareholders who suffered losses are encouraged to click Join a Securities Class Action or contact either John Kehoe, Esq, (215) 792-6676, Ext. 801, jkehoe@kehoelawfirm.com or Michael Yarnoff, Esq., (215) 792-6676, Ext. 804, myarnoff@kehoelawfirm.com, info@kehoelawfirm.com, to learn more about the Livent investigation or participating in the class action lawsuit.\n\nKehoe Law Firm, P.C., with offices in New York and Philadelphia, is a multidisciplinary, plaintiff–side law firm dedicated to protecting investors from securities fraud, breaches of fiduciary duties, and corporate misconduct.  Combined, the partners at Kehoe Law Firm have served as Lead Counsel or Co-Lead Counsel in cases that have recovered more than $10 billion on behalf of institutional and individual investors.","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/19\/1871462\/0\/en\/Livent-LTHM-Kehoe-Law-Firm-P-C-Investigates-Claims-on-Behalf-of-Livent-Corporation-Investors.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","KEHOE LAW FIRM"],"sentiment":{"polarity":-0.735,"neg":0.098,"neu":0.808,"pos":0.094}},{"date":"2019-06-19T00:13:00+00:00","title":"CLASS ACTION REMINDERS for FND, LTHM, PSMT, and AOS: Hagens Berman Reminds Investors of Class Actions on Behalf of Shareholders","content":"SAN FRANCISCO, June  18, 2019  (GLOBE NEWSWIRE) -- Hagens Berman Sobol Shapiro LLP reminds FND, LTHM, PSMT, and AOS investors that class action lawsuits have commenced on behalf of investors against the following public companies and lead plaintiff filing deadlines are approaching.\n\nFloor & Decor Holdings, Inc. (NYSE: FND)\r\n Class Period: May 23, 2018 - August 1, 2018\r\nLead Plaintiff Deadline: July 19, 2019\r\nDate Filed: May 20, 2019\r\nPhone: 510-725-3000\r\nEmail:FND@hbsslaw.com\r\nFor more information:https:\/\/www.hbsslaw.com\/cases\/FND\n\nAccording to the complaint, Defendants misled investors by misrepresenting and concealing declining sales trends that would ultimately result in the reduction of its fiscal 2018 sales and adjusted earnings per share guidance.\n\n“We’re focused on investors’ losses and the extent to which Defendants may have misled investors about the Company’s asset quality and capital sufficiency,” said Hagens Berman partner Reed Kathrein.\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: October 7, 2018 - May 22, 2019\r\nLead Plaintiff Deadline: July 22, 2019\r\nDate Filed: May 22, 2019\r\nPhone: 510-725-3000\r\nEmail:LTHM@hbsslaw.com\r\nFor more information:https:\/\/www.hbsslaw.com\/cases\/LTHM\n\nAccording to the complaint, Defendants misrepresented and concealed (1) the termination of a supply contract with Nemaska Lithium Inc., and (2) fulfillment of customer contracts using alternative vendors would adversely affect Livent’s revenues and profit margins.\n\n“We’re focused on investors’ losses and the extent to which Defendants’ IPO- and post-IPO statements about the Company’s business may have misled investors,” said Hagens Berman partner Reed Kathrein.\n\nPriceSmart, Inc. (NASDAQ: PSMT)\r\n Class Period: October 26, 2017 - October 25, 2018\r\nLead Plaintiff Deadline: July 22, 2019\r\nDate Filed: May 22, 2019\r\nPhone: 510-725-3000\r\nEmail:PSMT@hbsslaw.com\r\nFor more information:https:\/\/www.hbsslaw.com\/cases\/PSMT\n\nAccording to the complaint, Defendants misled investors by concealing material weaknesses in PriceSmart’s internal controls over financial reporting.  More specifically, Defendants admittedly overstated the Company’s cash and cash equivalent balances during the three, six and nine month periods ended November 30, 2017, February 28, 2018, and May 31, 2018.\n\n“We’re focused on investors’ losses, management’s statements about PriceSmart’s immediate sources of liquidity, circumstances surrounding the CEO’s abrupt departure during October 2018, and whether investors may have been misled,” said Hagens Berman partner Reed Kathrein.\n\nA.O. Smith Corporation (NYSE: AOS)\r\n Class Period: July 26, 2016 - May 16, 2019\r\nLead Plaintiff Deadline: July 19, 2019\r\nDate Filed: May 28, 2019\r\nPhone: 510-725-3000\r\nEmail:AOS@hbsslaw.com\r\nFor more information:https:\/\/www.hbsslaw.com\/cases\/AOS\n\nAccording to the complaint, Defendants concealed A.O. Smith’s use of a distribution partner to artificially inflate the Company’s sales and gross margins in the Chinese market.\n\n“We’re focused on investors’ losses, whether the matters raised by J Capital Research and Spruce Point are correct, and whether investors may have been misled,” said Hagens Berman partner Reed Kathrein.\n\nAbout Hagens Berman\r\n Hagens Berman is law firm with nine offices in eight cities around the country and eighty attorneys representing investors, whistleblowers, workers and consumers in complex litigation.  More about the firm and its successes is located at hbsslaw.com.  For the latest news visit our newsroom or follow us on Twitter at @classactionlaw.\n\nContact:\r\nReed Kathrein, 510-725-3000","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/19\/1870894\/32716\/en\/CLASS-ACTION-REMINDERS-for-FND-LTHM-PSMT-and-AOS-Hagens-Berman-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders.html","symbols":["AOS.US","FND.US","LTHM.US","PSMT.US"],"tags":["AOS CLASS ACTION","CLASS ACTION","FND CLASS ACTION","HAGENS BERMAN SOBOL SHAPIRO LLP","LTHM CLASS ACTION","PSMT CLASS ACTION"],"sentiment":{"polarity":-0.599,"neg":0.056,"neu":0.9,"pos":0.044}},{"date":"2019-06-18T19:56:00+00:00","title":"LEAD PLAINTIFF DEADLINE ALERT: Faruqi & Faruqi, LLP Encourages Investors Who Suffered Losses Exceeding $50,000 Investing In Livent Corporation To Contact The Firm","content":"NEW YORK, June  18, 2019  (GLOBE NEWSWIRE) -- Faruqi & Faruqi, LLP, a leading national securities law firm, reminds investors in Livent Corporation (\"Livent\" or the \"Company\")(NYSE:LTHM) of the July 22, 2019 deadline to seek the role of lead plaintiff in a federal securities class action that has been filed against the Company.\n\nIf you invested in Livent stock or options pursuant and\/or traceable to the Company's October 2018 initial public offering (\"IPO\") and would like to discuss your legal rights, click here: www.faruqilaw.com\/LTHM. There is no cost or obligation to you.\n\nYou can also contact us by calling Richard Gonnello toll free at 877-247-4292 or at 212-983-9330 or by sending an e-mail to rgonnello@faruqilaw.com.\n\nCONTACT:\r\n FARUQI & FARUQI, LLP \r\n 685 Third Avenue, 26th Floor \r\n New York, NY 10017 \r\n Attn:  Richard Gonnello, Esq. \r\n rgonnello@faruqilaw.com \r\n Telephone: (877) 247-4292 or (212) 983-9330\n\nThe lawsuit has been filed in the U.S. District Court for the Eastern District of Pennsylvania on behalf of all those who purchased Livent securities pursuant and\/or traceable to the Company's October 2018 IPO. The case, Nikolov v. Livent Corporation et al., No. 19-cv-19-cv-02218-CFK was filed on May 22, 2019 and has been assigned to Judge Chad F. Kenney.\n\nThe lawsuit focuses on whether the Company and its executives violated federal securities laws by failing to disclose to investors: (1) that a supply contract with Nemaska Lithium Inc. had been terminated; (2) that, as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) that the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) that the Company's margins were squeezed due to the customer's increased orders; and (5) that, as a result of the foregoing, Defendants' positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nSince Livent's October 2018 IPO, the Company's share price has declined from its IPO price of $17 by approximately 60%.\n\nThe court-appointed lead plaintiff is the investor with the largest financial interest in the relief sought by the class who is adequate and typical of class members who directs and oversees the litigation on behalf of the putative class. Any member of the putative class may move the Court to serve as lead plaintiff through counsel of their choice, or may choose to do nothing and remain an absent class member. Your ability to share in any recovery is not affected by the decision to serve as a lead plaintiff or not.\n\nFaruqi & Faruqi, LLP also encourages anyone with information regarding Livent's conduct to contact the firm, including whistleblowers, former employees, shareholders and others.\n\nAttorney Advertising. The law firm responsible for this advertisement is Faruqi & Faruqi, LLP (www.faruqilaw.com). Prior results do not guarantee or predict a similar outcome with respect to any future matter. We welcome the opportunity to discuss your particular case. All communications will be treated in a confidential manner.","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/18\/1870780\/683\/en\/LEAD-PLAINTIFF-DEADLINE-ALERT-Faruqi-Faruqi-LLP-Encourages-Investors-Who-Suffered-Losses-Exceeding-50-000-Investing-In-Livent-Corporation-To-Contact-The-Firm.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","FARUQI & FARUQI LLP"],"sentiment":{"polarity":0.977,"neg":0.052,"neu":0.841,"pos":0.107}},{"date":"2019-06-18T17:43:00+00:00","title":"Livent Class Action Deadline: Bernstein Liebhard LLP Announces That Approximately Five Weeks Remain to Make a Motion for Lead Plaintiff in a Securities Class Action Lawsuit Against the Livent Corporation – LTHM","content":"NEW YORK, June  18, 2019  (GLOBE NEWSWIRE) -- Bernstein Liebhard LLP, a nationally acclaimed investor rights law firm, announced that approximately five weeks remain to make a motion to serve as a lead plaintiff in a class action pending against the Livent Corporation (“Livent,” “LTHM” or the “Company”) (NYSE: LTHM) alleging claims on behalf of those who purchased or acquired Livent shares pursuant to or traceable to Livent’s initial public offering (“IPO”) on or around October 12, 2018.\n\nIf you purchased Livent securities, and\/or would like to discuss your legal rights and options, please visit Livent LTHM Shareholder Class Action Lawsuit or contact Matthew Guarnero toll free at (877) 779-1414 or MGuarnero@bernlieb.com.\n\nThe complaint, which is pending in the United States District Court for the Eastern District of Pennsylvania, alleges that Defendants violated the Securities Act of 1933. If you wish to serve as lead plaintiff in the Livent Securities Class Action you must move the Court no later than July 22, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. Your ability to share in any recovery does not require that you serve as lead plaintiff. If you choose to take no action, you may remain an absent class member.\n\nAccording to the lawsuit, Defendants made false and\/or misleading statements in the offering documents relating to the IPO, including failing to disclose that: (i) a supply contract with Nemaska Lithium Inc. had been terminated; (ii) the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (iii) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (iv) the Company’s margins were squeezed due to that customer’s increased orders; and (v) as a result of the foregoing, Defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nOn February 11, 2019, Livent released its fourth quarter 2018 financial results that missed top line sales targets, citing difficulties negotiating contracts with existing customers. On this news, Livent’s share price fell $0.57, over 4%, to close at $12.55 per share on February 12, 2019.\n\nOn May 8, 2019, Livent announced disappointing financial results for first quarter 2019, citing further customer issues. On this news, the Company’s share price fell $1.70, nearly 16%, to close at $9.03 per share on May 8, 2019.\n\nIf you purchased Livent securities, and\/or would like to discuss your legal rights and options, please visit https:\/\/www.bernlieb.com\/cases\/livent-corporation-lthm-class-action-lawsuit-fraud-stock-133\/ or contact Matthew Guarnero toll free at (877) 779-1414 or MGuarnero@bernlieb.com.\n\nSince 1993, Bernstein Liebhard LLP has recovered over $3.5 billion for its clients. In addition to representing individual investors, the Firm has been retained by some of the largest public and private pension funds in the country to monitor their assets and pursue litigation on their behalf. As a result of its success litigating hundreds of lawsuits and class actions, the Firm has been named to The National Law Journal’s “Plaintiffs’ Hot List” thirteen times and listed in The Legal 500 for ten consecutive years.\n\nATTORNEY ADVERTISING. © 2019 Bernstein Liebhard LLP. The law firm responsible for this advertisement is Bernstein Liebhard LLP, 10 East 40th Street, New York, New York 10016, (212) 779-1414. The lawyer responsible for this advertisement in the State of Connecticut is Michael S. Bigin.  Prior results do not guarantee or predict a similar outcome with respect to any future matter.\n\nContact Information\n\nMatthew Guarnero\r\n Bernstein Liebhard LLP\r\nhttps:\/\/www.bernlieb.com\r\n (877) 779-1414\r\nMGuarnero@bernlieb.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/18\/1870581\/0\/en\/Livent-Class-Action-Deadline-Bernstein-Liebhard-LLP-Announces-That-Approximately-Five-Weeks-Remain-to-Make-a-Motion-for-Lead-Plaintiff-in-a-Securities-Class-Action-Lawsuit-Against-.html","symbols":["LTHM.US"],"tags":["BERNSTEIN LIEBHARD LLP","CLASS ACTION"],"sentiment":{"polarity":0.984,"neg":0.068,"neu":0.808,"pos":0.125}},{"date":"2019-06-18T13:28:00+00:00","title":"CLASS ACTION UPDATE for MOMO, LTHM, CLDR and ZUO: Levi & Korsinsky, LLP Reminds Investors of Class Actions on Behalf of Shareholders","content":"NEW YORK, June  18, 2019  (GLOBE NEWSWIRE) -- Levi & Korsinsky, LLP announces that class action lawsuits have commenced on behalf of shareholders of the following publicly-traded companies. Shareholders interested in serving as lead plaintiff have until the deadlines listed to petition the court and further details about the cases can be found at the links provided. There is no cost or obligation to you.\n\nMomo Inc. (NASDAQ: MOMO)\r\n Class Period: April 21, 2014 - April 29, 2019\r\nLead Plaintiff Deadline: July 15, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/momo-inc-loss-form?wire=3\n\nThe lawsuit alleges: Momo Inc. made materially false and\/or misleading statements and\/or failed to disclose that: (i) Momo’s compliance procedures and controls were inadequate to prevent, inter alia, illicit financial reporting activity; (ii) Momo’s social and dating app, Tantan, was materially noncompliant with PRC law and\/or regulations; (iii) Tantan was consequently at an increased risk of being removed from Chinese app stores at the direction of Chinese governmental authorities; and (iv) as a result, Momo’s public statements were materially false and misleading at all relevant times.\n\nTo learn more about the Momo Inc. class action contact jlevi@levikorsinsky.com.\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\nLead Plaintiff Deadline: July 22, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/livent-corporation-loss-form?wire=3\n\nThe lawsuit alleges that, during the class period, Livent Corporation made materially false and\/or misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5)  as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent Corporation class action contact jlevi@levikorsinsky.com.\n\nCloudera, Inc. (NYSE: CLDR)\r\n Class Period: April 28, 2017 - June 5, 2019\r\nLead Plaintiff Deadline: August 6, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/cloudera-inc-loss-form?wire=3\n\nThe lawsuit alleges: Cloudera, Inc. made materially false and\/or misleading statements throughout the class period and\/or failed to disclose that: (i) Cloudera was finding it increasingly difficult to identify large enterprises interested in adopting the Company’s Hadoop-based  platform; (ii) Cloudera needed to expend an increasing amount of capital on sales and marketing activities to generate new revenues, even as new revenue opportunities were diminishing; and (iii) Cloudera had materially diminished sales opportunities and prospects and could not generate annual positive cash flows.\n\nTo learn more about the Cloudera, Inc. class action contact jlevi@levikorsinsky.com.\n\nZuora, Inc. (NYSE: ZUO)\r\n Class Period: April 12, 2018 - May 30, 2019\r\nLead Plaintiff Deadline: August 13, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/zuora-inc-loss-form?wire=3\n\nThe lawsuit alleges: Zuora, Inc. made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company  would  focus  on  implementing  RevPro  for  new  customers  ahead  of  the  deadline  to  comply  with  accounting  standard  ASC  606;  (2)  as  a  result,  the  Company  lacked  adequate  resources  to  integrate  RevPro  with  the  core  business;  (3) the  Company  would  focus  on  RevPro integration a year after the acquisition closed; (4) delays in integrating RevPro would materially impact the business; (5)  the market for RevPro was limited to customers seeking to implement  new  accounting  standards  such  as  ASC  606;  (6)  after  the  deadline  for  ASC  606  compliance passed, demand for RevPro was reasonably likely to decline; and (7) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Zuora, Inc. class action contact jlevi@levikorsinsky.com.\n\nYou have until the lead plaintiff deadlines to request the court appoint you as lead plaintiff. Your ability to share in any recovery doesn’t require that you serve as a lead plaintiff.\r\n\r\nLevi & Korsinsky is a national firm with offices in New York, California, Connecticut, and Washington D.C. The firm’s attorneys have extensive expertise and experience representing investors in securities litigation and have recovered hundreds of millions of dollars for aggrieved shareholders. Attorney advertising. Prior results do not guarantee similar outcomes.\r\n\r\n\r\nCONTACT:\r\nLevi & Korsinsky, LLP\r\nJoseph E. Levi, Esq.\r\n55 Broadway, 10th Floor\r\nNew York, NY 10006\r\njlevi@levikorsinsky.com\r\nTel: (212) 363-7500\r\nFax: (212) 363-7171\r\nwww.zlk.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/18\/1870404\/3080\/en\/CLASS-ACTION-UPDATE-for-MOMO-LTHM-CLDR-and-ZUO-Levi-Korsinsky-LLP-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders.html","symbols":["CLDR.US","LTHM.US","MOMO.US","ZUO.US"],"tags":["CLASS ACTION","LEVI & KORSINSKY","LLP"],"sentiment":{"polarity":-0.934,"neg":0.084,"neu":0.854,"pos":0.063}},{"date":"2019-06-17T17:30:00+00:00","title":"INVESTOR ACTION ALERT: The Schall Law Firm Announces the Filing of a Class Action Lawsuit Against Livent Corporation and Encourages Investors with Losses in Excess of $100,000 to Contact the Firm","content":"LOS ANGELES, June  17, 2019  (GLOBE NEWSWIRE) -- The Schall Law Firm, a national shareholder rights litigation firm, announces the filing of a class action lawsuit against Livent Corporation (“Livent” or “the Company”) (NYSE: LTHM) for violations of the federal securities laws.\n\nInvestors who purchased the Company’s shares pursuant to and\/or traceable to the Company’s Initial Public Offering in October 2018 (the “IPO”) are encouraged to contact the firm before July 22, 2019.\n\nIf you are a shareholder who suffered a loss, click here to participate.\n\nWe also encourage you to contact Brian Schall, or Sherin Mahdavian, of the Schall Law Firm, 1880 Century Park East, Suite 404, Los Angeles, CA 90067, at 424-303-1964, to discuss your rights free of charge. You can also reach us through the firm's website at www.schallfirm.com, or by email at brian@schallfirm.com.\n\nThe class, in this case, has not yet been certified, and until certification occurs, you are not represented by an attorney. If you choose to take no action, you can remain an absent class member.\n\nAccording to the Complaint, the Company made false and misleading statements to the market. Livent’s supply contract with Nemaska Lithium Inc. was terminated. As a result, the Company was forced to fulfill customer contracts using different vendors with unfavorable terms, reducing revenues and lowering margins. Livent had a long-standing contract to supply lithium hydroxide to a customer at a significantly lower price than its existing contacts. When the customer increased its orders, the Company’s margins were further squeezed. Based on these facts, the Company’s public statements were false and materially misleading throughout the IPO period. When the market learned the truth about Livent, investors suffered damages.\n\nJoin the case to recover your losses.\n\nThe Schall Law Firm represents investors around the world and specializes in securities class action lawsuits and shareholder rights litigation.\n\nThis press release may be considered Attorney Advertising in some jurisdictions under the applicable law and rules of ethics.\n\nCONTACT:\n\nThe Schall Law Firm\r\n Brian Schall, Esq.,\r\n Rina Restaino, Esq.,\r\nwww.schallfirm.com\r\nOffice: 310-301-3335\r\nCell: 424-303-1964\r\ninfo@schallfirm.com\n\nSOURCE:\n\nThe Schall Law Firm","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/17\/1869850\/0\/en\/INVESTOR-ACTION-ALERT-The-Schall-Law-Firm-Announces-the-Filing-of-a-Class-Action-Lawsuit-Against-Livent-Corporation-and-Encourages-Investors-with-Losses-in-Excess-of-100-000-to-Con.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","LAWSUIT","LIVENT","LTHM","SCHALL LAW","SCHALL LAW FIRM","SHAREHOLDERS"],"sentiment":{"polarity":-0.926,"neg":0.111,"neu":0.819,"pos":0.07}},{"date":"2019-06-17T13:12:00+00:00","title":"The Klein Law Firm Reminds Investors of Class Actions on Behalf of Shareholders of BE, INVVY, DLNG and LTHM","content":"NEW YORK, June  17, 2019  (GLOBE NEWSWIRE) -- The Klein Law Firm announces that class action complaints have been filed on behalf of shareholders of the following companies. If you suffered a loss you have until the lead plaintiff deadline to request that the court appoint you as lead plaintiff.\n\nBloom Energy Corporation (NYSE: BE)\r\n Class Period: on behalf of all persons who purchased or otherwise acquired Bloom Energy common stock pursuant or traceable to Bloom Energy’s July 2018 IPO.\r\n Lead Plaintiff Deadline: July 29, 2019\n\nThe complaint alleges that Bloom Energy's Registration Statement was materially misleading as it failed to disclose known events and trends that were severely affecting the Company’s business and that made investment in Bloom Energy significantly riskier than presented in the Registration Statement. In particular, the Registration Statement failed to disclose that the Company was experiencing material construction delays. These construction delays would cause system deployments (or “acceptances” as Defendants referred to them) to fall significantly below even the low end of the Company’s previously announced guidance. While the Registration Statement purported to warn of risks that “may arise,” which could materially affect the Company, in actuality these material negative events were already occurring. As a result, the representations and purported risk disclosures were false and misleading because, by the time of the IPO, construction delays had already impacted or would soon impact Bloom Energy’s ability to deliver acceptances in line with its guidance.\n\nGet additional information about the BE lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/bloom-energy-corporation-loss-submission-form?wire=3\n\nIndivior PLC (OTCMKTS: INVVY)\r\n Class Period: March 10, 2015 to April 9, 2019\r\n Lead Plaintiff Deadline: June 24, 2019\n\nThe lawsuit alleges Indivior PLC made materially false and\/or misleading statements and\/or failed to disclose during the class period that: (1) Indivior and its executives engaged in an illicit nationwide scheme to increase prescriptions of Suboxone Film; (2) Indivior illegally obtained billions of dollars in revenue from Suboxone Film prescriptions by deceiving health care providers and health care benefit programs; (3) as a result of the aforementioned misconduct, Indivior would face felony charges; and (4) due to the foregoing, Defendants’ statements about its business, operations, and prospects, were materially false and misleading and\/or lacked a reasonable basis at all relevant times.\n\nGet additional information about the INVVY lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/indivior-plc-loss-submission-form?wire=3\n\nDynagas LNG Partners LP (NYSE: DLNG)\r\n Class Period: February 16, 2018 to March 21, 2019\r\n Lead Plaintiff Deadline: July 16, 2019\n\nThe complaint alleges that throughout the class period Dynagas LNG Partners LP made materially false and\/or misleading statements and\/or failed to disclose that: the terms of the Company’s long-term contracts on its liquid natural gas ships, Arctic Aurora and Ob River, were unfavorable and resulted in the Company's inability to sustain its quarterly distributions. As a result of the Defendants’ false and misleading statements and omissions, Dynagas securities traded at artificially inflated prices during the Class Period. Such inflation was removed when it was revealed that the Arctic Aurora and the Ob River were commencing employment under new extended charter contracts which were at lower rates compared to the previous charter contracts, thereby undermining the Company’s ability to make future distributions.\n\nGet additional information about the DLNG lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/dynagas-lng-partners-lp-loss-submission-form?wire=3\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\n Lead Plaintiff Deadline: July 22, 2019\n\nThe lawsuit alleges that Livent Corporation made materially false and\/or misleading statements and\/or failed to disclose: (1) that a supply contract with Nemaska Lithium Inc. had been terminated; (2) that, as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) that the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) that the Company's margins were squeezed due to the customer's increased orders; and (5) that, as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nGet additional information about the LTHM lawsuit: http:\/\/www.kleinstocklaw.com\/pslra-1\/livent-corporation-loss-submission-form?wire=3\n\nYour ability to share in any recovery doesn’t require that you serve as a lead plaintiff. There is no cost or obligation to you. If you suffered a loss during the class period and wish to obtain additional information, please contact J. Klein, Esq. by telephone at 212-616-4899 or visit the webpages provided.\n\nJ. Klein, Esq. represents investors and participates in securities litigations involving financial fraud throughout the nation. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nJ. Klein, Esq.\r\nEmpire State Building\r\n350 Fifth Avenue\r\n59th Floor\r\nNew York, NY 10118\r\njk@kleinstocklaw.com\r\nTelephone: (212) 616-4899\r\nFax: (347) 558-9665\r\nwww.kleinstocklaw.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/17\/1869682\/0\/en\/The-Klein-Law-Firm-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders-of-BE-INVVY-DLNG-and-LTHM.html","symbols":["BE.US","DLNG.US","LTHM.US"],"tags":["CLASS ACTION","THE KLEIN LAW FIRM"],"sentiment":{"polarity":-0.994,"neg":0.131,"neu":0.802,"pos":0.067}},{"date":"2019-06-16T19:27:00+00:00","title":"LTHM INVESTOR ALERT: Rosen, a Highly Ranked Law Firm, Announces the Filing of Securities Class Action Lawsuit Against Livent Corporation; Encourages Investors with Over $100K in Losses to Contact the Firm – LTHM","content":"NEW YORK, June  16, 2019  (GLOBE NEWSWIRE) -- Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on behalf of purchasers of the securities of Livent Corporation (NYSE: LTHM) pursuant and\/or traceable to Livent’s false and\/or misleading registration statement and prospectus (collectively, the “Registration Statement”) issued in connection with Livent’s initial public offering completed in October 2018 (the “IPO”). The lawsuit seeks to recover damages for Livent investors under the federal securities laws.\n\nTo join the Livent class action, go to http:\/\/www.rosenlegal.com\/cases-register-1579.html or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action.\n\nNO CLASS HAS YET BEEN CERTIFIED IN THE ABOVE ACTION. UNTIL A CLASS IS CERTIFIED, YOU ARE NOT REPRESENTED BY COUNSEL UNLESS YOU RETAIN ONE. YOU MAY RETAIN COUNSEL OF YOUR CHOICE. YOU MAY ALSO REMAIN AN ABSENT CLASS MEMBER AND DO NOTHING AT THIS POINT. AN INVESTOR’S ABILITY TO SHARE IN ANY POTENTIAL FUTURE RECOVERY IS NOT DEPENDENT UPON SERVING AS LEAD PLAINTIFF.\n\nAccording to the lawsuit, the Registration Statement was false and\/or contained misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) Livent would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) Livent had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (4) Livent’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\n\nA class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than July 22, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. If you wish to join the litigation, go to http:\/\/www.rosenlegal.com\/cases-register-1579.html or to discuss your rights or interests regarding this class action, please contact Phillip Kim, Esq. of Rosen Law Firm toll free at 866-767-3653 or via e-mail at pkim@rosenlegal.com or cases@rosenlegal.com.\n\nFollow us for updates on LinkedIn: https:\/\/www.linkedin.com\/company\/the-rosen-law-firm, on Twitter: https:\/\/twitter.com\/rosen_firm or on Facebook: https:\/\/www.facebook.com\/rosenlawfirm\/.\n\nRosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 3 each year since 2013.   Rosen Law Firm has secured hundreds of millions of dollars for investors.\n\nContact Information:\r\n Laurence Rosen, Esq.\r\n Phillip Kim, Esq.\r\n The Rosen Law Firm, P.A.\r\n 275 Madison Avenue, 34th Floor\r\n New York, NY  10016\r\n Tel: (212) 686-1060\r\n Toll Free: (866) 767-3653\r\n Fax: (212) 202-3827\r\n lrosen@rosenlegal.com\r\n pkim@rosenlegal.com\r\n cases@rosenlegal.com\r\n www.rosenlegal.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/16\/1869309\/673\/en\/LTHM-INVESTOR-ALERT-Rosen-a-Highly-Ranked-Law-Firm-Announces-the-Filing-of-Securities-Class-Action-Lawsuit-Against-Livent-Corporation-Encourages-Investors-with-Over-100K-in-Losses-.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","THE ROSEN LAW FIRM PA"],"sentiment":{"polarity":0.867,"neg":0.091,"neu":0.8,"pos":0.109}},{"date":"2019-06-15T02:11:00+00:00","title":"Bragar Eagel & Squire, P.C. Reminds Investors That Class Action Lawsuits Have Been Filed Against RCI, Livent, PriceSmart, and Hecla Mining and Encourages Investors to Contact the Firm","content":"NEW YORK, June  14, 2019  (GLOBE NEWSWIRE) -- Bragar Eagel & Squire, P.C. reminds investors that class action lawsuits have been commenced on behalf of stockholders of RCI Hospitality Holdings, Inc., Livent Corporation, PriceSmart, Inc., and Hecla Mining Company.  Stockholders have until the deadlines listed below to petition the court to serve as lead plaintiff.  Additional information about each case can be found at the link provided.\n\nRCI Hospitality Holdings, Inc. (NASDAQ: RICK)\n\nClass Period: August 10, 2017 - May 10, 2019\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made materially false and\/or misleading statements, as well as failed to disclose material adverse facts about the company’s business, operations, and prospects.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) the company engaged in numerous transactions with the CEO, including lending him significant sums of money; (2) these practices were reasonably likely to lead to regulatory scrutiny of the company; (3) as a result of investigations into the company’s governance, the company would be unable to timely file its financial statements; and (4) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects were materially false and\/or misleading and\/or lacked a reasonable basis.\n\nTo learn more about the RCI class action go to: http:\/\/bespc.com\/rick\/.\n\nLivent Corporation (NYSE: LTHM)\n\nClass Period: Pursuant to and\/or traceable to the Initial Public Offering (“IPO”) on or about October 12, 2018\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that the Registration Statement was false and misleading and omitted to state material adverse facts.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the company’s existing contracts; (4) the company’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent class action go to: http:\/\/bespc.com\/lthm\/.\n\nPriceSmart, Inc. (NASDAQ: PSMT)\n\nClass Period: October 26, 2017 - October 25, 2018\n\nLead Plaintiff Deadline: July 22, 2019\n\nThe complaint alleges that throughout the Class Period, defendants made materially false and\/or misleading statements, as well as failed to disclose material adverse facts about the company’s business, operations, and prospects.  Specifically, the complaint alleges that defendants failed to disclose to investors that: (1) the company’s omni-channel business strategy had failed to reach key operating goals; (2) the company’s South America distribution strategy had failed to realize key cost saving goals; (3) the company had invested Trinidad and Tobago dollars into certificates of deposits with financial institutions; (4) these investments had been improperly classified as cash and cash equivalents; (5) the relevant corrections would materially impact financial statements; (6) there was a material weakness in the company’s internal controls over financial reporting; (7) increasing competition negatively impacted the company’s revenue and profitability; and (8) as a result of the foregoing, defendants’ positive statements about the company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the PriceSmart class action go to: http:\/\/bespc.com\/pricesmart\/.\n\nHecla Mining Company (NYSE: HL)\n\nClass Period: March 19, 2018 - May 8, 2019\n\nLead Plaintiff Deadline: July 23, 2019\n\nThe complaint alleges that throughout the Class Period, defendants falsely and misleadingly represented that the Nevada operations would be “accretive” and cash flow positive, or at the very least “self-funding.”  Specifically, the complaint alleges that defendants were aware from their extensive due diligence that the Nevada operations had material problems in terms of excessive water, equipment availability, achieving enough development to have consistent production, and lack of characterization of ore types, among other things.\n\nTo learn more about the Hecla class action go to: http:\/\/bespc.com\/hl\/.\n\nBragar Eagel & Squire, P.C. is a New York-based law firm concentrating in commercial and securities litigation.  For additional information about Bragar Eagel & Squire, P.C. please go to www.bespc.com.  Attorney advertising.  Prior results do not guarantee similar outcomes.\n\nContacts\n\nBragar Eagel & Squire, P.C.\r\nBrandon Walker, Esq.\r\nMelissa Fortunato, Esq.\r\n(212) 355-4648\r\ninvestigations@bespc.com\r\nwww.bespc.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/15\/1869278\/0\/en\/Bragar-Eagel-Squire-P-C-Reminds-Investors-That-Class-Action-Lawsuits-Have-Been-Filed-Against-RCI-Livent-PriceSmart-and-Hecla-Mining-and-Encourages-Investors-to-Contact-the-Firm.html","symbols":["HL.US","LTHM.US","PSMT.US","RICK.US"],"tags":["BRAGAR EAGEL & SQUIRE","CLASS ACTION","HECLA MINING COMPANY","INC","LIVENT CORPORATION","PRICESMART","RCI HOSPITALITY HOLDINGS"],"sentiment":{"polarity":-0.986,"neg":0.104,"neu":0.837,"pos":0.059}},{"date":"2019-06-14T19:00:00+00:00","title":"Jumia Technologies AG (JMIA), Floor & Decor Holdings, Inc. (FND) & Livent Corporation (LTHM) - Bronstein, Gewirtz & Grossman, LLC Reminds Investors of Class Actions","content":"NEW YORK, June  14, 2019  (GLOBE NEWSWIRE) -- Attorney Advertising -- Bronstein, Gewirtz & Grossman, LLC reminds investors that a class action lawsuit has been filed against the following publicly-traded companies. You can review a copy of the Complaints by visiting the links below or you may contact Peretz Bronstein, Esq. or his Investor Relations Analyst, Yael Hurwitz of Bronstein, Gewirtz & Grossman, LLC at 212-697-6484. If you suffered a loss, you can request that the Court appoint you as lead plaintiff.  Your ability to share in any recovery doesn't require that you serve as a lead plaintiff. A lead plaintiff acts on behalf of all other class members in directing the litigation. The lead plaintiff can select a law firm of its choice. An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\n\nJumia Technologies AG (NASDAQ: JMIA)\r\nClass Period: April 12, 2019 - May 9, 2019\r\nDeadline: July 15, 2019 For more info:www.bgandg.com\/jmia\n\nThe complaint alleges that throughout the Class Period, defendants made false and\/or misleading statements and\/or failed to disclose that: (1) Jumia had materially overstated its active customers and active merchants; (2) Jumia’s representations about its orders, order cancellations, undelivered orders and returned orders lacked a sufficient factual basis and materially overstated Jumia’s sales; (3) Jumia failed to sufficiently disclose related party transactions; (4) Jumia’s financial statements were presented in violation of applicable accounting standards; and (5) as a result of the foregoing, defendants’ positive statements about Jumia’s business, operations, and prospects, were materially misleading and lacked a reasonable basis.\n\nFloor & Decor Holdings, Inc. (NYSE: FND)\r\nClass Period: May 23, 2018 - August 1, 2018,\r\nDeadline: July 19, 2019 For more info:www.bgandg.com\/fnd\n\nThe complaint alleges that throughout the Floor & Decor’s May 24, 2018 Secondary Offering documents included false and misleading statements. Specifically, the complaint alleges that the defendants knew but failed to disclose that the company had already begun to experience declining sales trends that would ultimately result in the reduction of its fiscal 2018 sales and adjusted earnings per share guidance, which the company publicly increased in May 2018. While the company’s stock was artificially inflated, insiders sold more than 10.3 million shares of Floor & Decor common stock, including shares sold in the May 24, 2018 Secondary Offering.\n\nLivent Corporation (NYSE: LTHM)\r\nClass Period: Livent securities purchased pursuant and\/or traceable to the company’s initial public offering completed in October 2018 (the “IPO” or the “Offering”).\r\nDeadline: July 22, 2019 For more info:www.bgandg.com\/lthm\n\nThe lawsuit alleges that the Registration Statement was false and\/or contained misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) Livent would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) Livent had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of Livent’s existing contracts; (4) Livent’s margins were squeezed due to the customer’s increased orders; and (5) as a result of the foregoing, defendants’ positive statements about Livent’s business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis. When the true details entered the market, the lawsuit claims that investors suffered damages.\n\nContact:\r\nBronstein, Gewirtz & Grossman, LLC\r\n Peretz Bronstein or Yael Hurwitz \r\n212-697-6484 | info@bgandg.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/14\/1869153\/9788\/en\/Jumia-Technologies-AG-JMIA-Floor-Decor-Holdings-Inc-FND-Livent-Corporation-LTHM-Bronstein-Gewirtz-Grossman-LLC-Reminds-Investors-of-Class-Actions.html","symbols":["FND.US","JMIA.US","LTHM.US"],"tags":["BRONSTEIN","CLASS ACTION","GEWIRTZ & GROSSMAN","LLC"],"sentiment":{"polarity":-0.94,"neg":0.108,"neu":0.812,"pos":0.08}},{"date":"2019-06-14T13:34:00+00:00","title":"SHAREHOLDER ALERT: BV S EQBK LTHM: The Law Offices of Vincent Wong Reminds Investors of Important Class Action Deadlines","content":"NEW YORK, June  14, 2019  (GLOBE NEWSWIRE) -- The Law Offices of Vincent Wong announce that class actions have commenced on behalf of shareholders of the following companies. If you suffered a loss you have until the lead plaintiff deadline to request that the court appoint you as lead plaintiff.\n\nBrightView Holdings, Inc. (NYSE: BV)\r\n Lead Plaintiff Deadline: June 14, 2019\r\n Class Period: Purchasers of common stock pursuant to the IPO completed around July 2, 2018\n\nGet additional information about BV: http:\/\/www.wongesq.com\/pslra-1\/brightview-holdings-inc-loss-submission-form?wire=3\n\nSprint Corporation (NYSE: S)\r\n Lead Plaintiff Deadline: June 21, 2019\r\n Class Period: January 31, 2019 and April 16, 2019\n\nGet additional information about S: http:\/\/www.wongesq.com\/pslra-1\/sprint-corporation-loss-submission-form?wire=3\n\nEquity Bancshares, Inc. (NASDAQ: EQBK)\r\n Lead Plaintiff Deadline: July 12, 2019\r\n Class Period: May 11, 2018 and April 22, 2019\n\nGet additional information about EQBK: http:\/\/www.wongesq.com\/pslra-1\/equity-bancshares-inc-loss-submission-form?wire=3\n\nLivent Corporation (NYSE: LTHM)\r\n Lead Plaintiff Deadline: July 22, 2019\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\n\nGet additional information about LTHM: http:\/\/www.wongesq.com\/pslra-1\/livent-corporation-loss-submission-form?wire=3\n\nTo learn more contact Vincent Wong, Esq. either via email vw@wongesq.com or by telephone at 212.425.1140.\n\nVincent Wong, Esq. is an experienced attorney that has represented investors in securities litigations involving financial fraud and violations of shareholder rights. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nVincent Wong, Esq.\r\n39 East Broadway\r\nSuite 304\r\nNew York, NY 10002\r\nTel. 212.425.1140\r\nFax. 866.699.3880\r\nE-Mail: vw@wongesq.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/14\/1869009\/31847\/en\/SHAREHOLDER-ALERT-BV-S-EQBK-LTHM-The-Law-Offices-of-Vincent-Wong-Reminds-Investors-of-Important-Class-Action-Deadlines.html","symbols":["BV.US","EQBK.US","LTHM.US","S.US"],"tags":["CLASS ACTION","THE LAW OFFICES OF VINCENT WONG"],"sentiment":{"polarity":-0.89,"neg":0.059,"neu":0.924,"pos":0.017}},{"date":"2019-06-14T00:18:00+00:00","title":"CLASS ACTION REMINDERS for INVVY, AAC, LTHM, PSMT: Hagens Berman Reminds Investors of Class Actions on Behalf of Shareholders","content":"SAN FRANCISCO, June  13, 2019  (GLOBE NEWSWIRE) -- Hagens Berman Sobol Shapiro LLP reminds INVVY, AAC, LTHM and PSMT investors that class action lawsuits have commenced on behalf of investors in the following companies and lead plaintiff filing deadlines are approaching.\n\nIndivior PLC (OTC BB: INVVY)\r\n Class Period: March 10, 2015 - April 9, 2019\r\nLead Plaintiff Deadline: June 24, 2019\r\nDate Filed: April 23, 2019\r\nPhone: 510-725-3000\r\nEmail:INVVY@hbsslaw.com\r\nFor more information:https:\/\/www.hbsslaw.com\/cases\/INVVY\n\nAccording to the complaint, Defendants misled investors by concealing: (1) Indivior and its executives engaged in an illicit nationwide scheme to increase prescriptions of Suboxone Film; (2) Indivior illegally obtained billions of dollars in revenue from Suboxone Film prescriptions by deceiving health care providers and health care benefit programs; and, (3) as a result of Defendants’ misconduct, Indivior would face felony charges.\n\n“We’re focused on investors’ losses and the extent to which investors may have been misled,” said Hagens Berman partner Reed Kathrein.\n\nAAC Holdings, Inc. (NYSE: AAC)\r\n Class Period: March 8, 2017 - April 15, 2019\r\nLead Plaintiff Deadline: July 15, 2019\r\nDate Filed: May 16, 2019\r\nPhone: 510-725-3000\r\nEmail:AAC@hbsslaw.com\r\nFor more information:https:\/\/www.hbsslaw.com\/cases\/AAC\n\nAccording to the complaint, Defendants misled investors in part by concealing (1) AAC’s internal controls over financial reporting were inadequate, and (2) AAC misstated historical financial and operating reports.\n\n“We’re focused on investors’ losses, Defendants’ revenue recognition practices, and the extent to which investors may have been misled,” said Hagens Berman partner Reed Kathrein.\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: October 7, 2018 - May 22, 2019\r\nLead Plaintiff Deadline: July 22, 2019\r\nDate Filed: May 22, 2019\r\nPhone: 510-725-3000\r\nEmail:LTHM@hbsslaw.com\r\nFor more information:https:\/\/www.hbsslaw.com\/cases\/LTHM\n\nAccording to the complaint, Defendants misrepresented and concealed (1) the termination of a supply contract with Nemaska Lithium Inc., and (2) fulfillment of customer contracts using alternative vendors would adversely affect Livent’s revenues and profit margins.\n\n“We’re focused on investors’ losses and the extent to which Defendants’ IPO- and post-IPO statements about the Company’s business may have misled investors,” said Hagens Berman partner Reed Kathrein.\n\nPriceSmart, Inc. (NASDAQ: PSMT)\r\n Class Period: October 26, 2017 - October 25, 2018\r\nLead Plaintiff Deadline: July 22, 2019\r\nDate Filed: May 22, 2019\r\nPhone: 510-725-3000\r\nEmail:PSMT@hbsslaw.com\r\nFor more information:https:\/\/www.hbsslaw.com\/cases\/PSMT\n\nAccording to the complaint, Defendants misled investors by concealing material weaknesses in PriceSmart’s internal controls over financial reporting.  More specifically, Defendants admittedly overstated the Company’s cash and cash equivalent balances during the three, six and nine month periods ended November 30, 2017, February 28, 2018, and May 31, 2018.\n\n“We’re focused on investors’ losses, management’s statements about PriceSmart’s immediate sources of liquidity, circumstances surrounding the CEO’s abrupt departure during October 2018, and whether investors may have been misled,” said Hagens Berman partner Reed Kathrein.\n\nAbout Hagens Berman\r\n Hagens Berman is law firm with nine offices in eight cities around the country and eighty attorneys representing investors, whistleblowers, workers and consumers in complex litigation.  More about the firm and its successes is located at hbsslaw.com.  For the latest news visit our newsroom or follow us on Twitter at @classactionlaw.\n\nContact:\r\nReed Kathrein, 510-725-3000","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/14\/1868771\/32716\/en\/CLASS-ACTION-REMINDERS-for-INVVY-AAC-LTHM-PSMT-Hagens-Berman-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders.html","symbols":["AAC.US","LTHM.US","PSMT.US"],"tags":["AAC","AAC SECURITIES FRAUD","CLASS ACTION","HAGENS BERMAN SOBOL SHAPIRO LLP","INVVY","INVVY SECURITIES FRAUD","LTHM","LTHM SECURITIES FRAUD","PSMT","PSMT SECURITIES FRAUD"],"sentiment":{"polarity":-0.226,"neg":0.067,"neu":0.876,"pos":0.058}},{"date":"2019-06-12T13:54:00+00:00","title":"CLASS ACTION UPDATE for NOK, MOMO, LTHM and PYX: Levi & Korsinsky, LLP Reminds Investors of Class Actions on Behalf of Shareholders","content":"NEW YORK, June  12, 2019  (GLOBE NEWSWIRE) -- Levi & Korsinsky, LLP announces that class action lawsuits have commenced on behalf of shareholders of the following publicly-traded companies. Shareholders interested in serving as lead plaintiff have until the deadlines listed to petition the court and further details about the cases can be found at the links provided. There is no cost or obligation to you.\n\nNokia Corporation (NYSE: NOK)\r\n Class Period: April 15, 2015 - March 21, 2019\r\nLead Plaintiff Deadline: June 19, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/nokia-corporation-loss-form?wire=3\n\nAbout the lawsuit: Nokia Corporation allegedly made materially false and\/or misleading statements during the class period and\/or failed to disclose that: (i) Alcatel-Lucent S.A. (\"Alcatel\") maintained insufficient internal controls and was materially non-compliant in its business practices; (ii) Nokia had failed to conduct adequate due diligence into Alcatel prior to its acquisition; (iii) subsequent to the completion of Nokia’s acquisition of Alcatel, the Company maintained insufficient internal controls over the integration of Alcatel’s businesses; (iv) as a result of the foregoing, at all relevant times, Nokia was at risk of serious criminal and civil penalties; and (v) as a result, the Company’s public statements were materially false and misleading at all relevant times.\n\nTo learn more about the Nokia Corporation class action contact jlevi@levikorsinsky.com.\n\nMomo Inc. (NASDAQ: MOMO)\r\n Class Period: April 21, 2014 - April 29, 2019\r\nLead Plaintiff Deadline: July 15, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/momo-inc-loss-form?wire=3\n\nAbout the lawsuit: During the class period, Momo Inc. allegedly made materially false and\/or misleading statements and\/or failed to disclose that: (i) Momo’s compliance procedures and controls were inadequate to prevent, inter alia, illicit financial reporting activity; (ii) Momo’s social and dating app, Tantan, was materially noncompliant with PRC law and\/or regulations; (iii) Tantan was consequently at an increased risk of being removed from Chinese app stores at the direction of Chinese governmental authorities; and (iv) as a result, Momo’s public statements were materially false and misleading at all relevant times.\n\nTo learn more about the Momo Inc. class action contact jlevi@levikorsinsky.com.\n\nLivent Corporation (NYSE: LTHM)\r\n Class Period: on behalf of persons and entities that purchased or otherwise acquired Livent securities pursuant and\/or traceable to initial public offering on or around October 11, 2018.\r\nLead Plaintiff Deadline: July 22, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/livent-corporation-loss-form?wire=3\n\nAbout the lawsuit: Livent Corporation allegedly made materially false and\/or misleading statements and\/or failed to disclose that: (1) a supply contract with Nemaska Lithium Inc. had been terminated; (2) as a result, the Company would be forced to fulfill its customer contracts using alternative vendors at reduced revenues and lower margins; (3) the Company had a long-standing contract to supply lithium hydroxide to a customer at a much lower price than any of the Company's existing contracts; (4) the Company's margins were squeezed due to the customer's increased orders; and (5) as a result of the foregoing, Defendants positive statements about the Company's business, operations, and prospects, were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Livent Corporation class action contact jlevi@levikorsinsky.com.\n\nPyxus International, Inc. (NYSE: PYX)\r\n Class Period: on behalf of stockholders who purchased Pyxus (f\/k\/a Alliance One International, Inc. (AOI)) securities between June 7, 2018 and November 8, 2018, inclusive.\r\nLead Plaintiff Deadline: August 6, 2019\r\n Join the action: https:\/\/www.zlk.com\/pslra-1\/pyxus-international-inc-f-k-a-alliance-one-international-inc-loss-form?wire=3\n\nAbout the lawsuit: Throughout the class period, Pyxus International, Inc. allegedly made materially false and\/or misleading statements and\/or failed to disclose that: (1) the Company was experiencing longer shipping cycles; (2) as a result, the Company’s financial results would be materially affected; (3) the Company lacked adequate internal control over financial reporting; (4) the Company’s accounting policies were reasonably likely to lead to regulatory scrutiny; and (5) as a result of the foregoing, Defendants’ positive statements about the Company’s business, operations, and prospects were materially misleading and\/or lacked a reasonable basis.\n\nTo learn more about the Pyxus International, Inc. class action contact jlevi@levikorsinsky.com.\n\nYou have until the lead plaintiff deadlines to request the court appoint you as lead plaintiff. Your ability to share in any recovery doesn’t require that you serve as a lead plaintiff.\n\nLevi & Korsinsky is a national firm with offices in New York, California, Connecticut, and Washington D.C. The firm’s attorneys have extensive expertise and experience representing investors in securities litigation and have recovered hundreds of millions of dollars for aggrieved shareholders. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nCONTACT:\r\nLevi & Korsinsky, LLP\r\nJoseph E. Levi, Esq.\r\n55 Broadway, 10th Floor\r\nNew York, NY 10006\r\njlevi@levikorsinsky.com\r\nTel: (212) 363-7500\r\nToll Free: (877) 363-5972\r\nFax: (212) 363-7171\r\nwww.zlk.com","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/12\/1867672\/3080\/en\/CLASS-ACTION-UPDATE-for-NOK-MOMO-LTHM-and-PYX-Levi-Korsinsky-LLP-Reminds-Investors-of-Class-Actions-on-Behalf-of-Shareholders.html","symbols":["LTHM.US","MOMO.US","NOK.US","PYX.US"],"tags":["CLASS ACTION","LEVI & KORSINSKY","LLP"],"sentiment":{"polarity":-0.971,"neg":0.091,"neu":0.848,"pos":0.061}},{"date":"2019-06-11T14:51:00+00:00","title":"INVESTOR ACTION NOTICE: The Schall Law Firm Announces the Filing of a Class Action Lawsuit Against Livent Corporation and Encourages Investors with Losses in Excess of $100,000 to Contact the Firm","content":"LOS ANGELES, June  11, 2019  (GLOBE NEWSWIRE) -- The Schall Law Firm, a national shareholder rights litigation firm, announces the filing of a class action lawsuit against Livent Corporation (“Livent” or “the Company”) (NYSE: LTHM) for violations of the federal securities laws.\n\nInvestors who purchased the Company’s shares pursuant to and\/or traceable to the Company’s Initial Public Offering in October 2018 (the “IPO”) are encouraged to contact the firm before July 22, 2019.\n\nIf you are a shareholder who suffered a loss, click here to participate.\n\nWe also encourage you to contact Brian Schall, or Sherin Mahdavian, of the Schall Law Firm, 1880 Century Park East, Suite 404, Los Angeles, CA 90067, at 424-303-1964, to discuss your rights free of charge. You can also reach us through the firm's website at www.schallfirm.com, or by email at brian@schallfirm.com.\n\nThe class, in this case, has not yet been certified, and until certification occurs, you are not represented by an attorney. If you choose to take no action, you can remain an absent class member.\n\nAccording to the Complaint, the Company made false and misleading statements to the market. Livent’s supply contract with Nemaska Lithium Inc. was terminated. As a result, the Company was forced to fulfill customer contracts using different vendors with unfavorable terms, reducing revenues and lowering margins. Livent had a long-standing contract to supply lithium hydroxide to a customer at a significantly lower price than its existing contacts. When the customer increased its orders, the Company’s margins were further squeezed. Based on these facts, the Company’s public statements were false and materially misleading throughout the IPO period. When the market learned the truth about Livent, investors suffered damages.\n\nJoin the case to recover your losses.\n\nThe Schall Law Firm represents investors around the world and specializes in securities class action lawsuits and shareholder rights litigation.\n\nThis press release may be considered Attorney Advertising in some jurisdictions under the applicable law and rules of ethics.\n\nCONTACT:\n\nThe Schall Law Firm\r\n Brian Schall, Esq.,\r\n Rina Restaino, Esq.,\r\nwww.schallfirm.com\r\nOffice: 310-301-3335\r\nCell: 424-303-1964\r\ninfo@schallfirm.com\n\nSOURCE:\n\nThe Schall Law Firm","link":"https:\/\/www.globenewswire.com\/news-release\/2019\/06\/11\/1867060\/0\/en\/INVESTOR-ACTION-NOTICE-The-Schall-Law-Firm-Announces-the-Filing-of-a-Class-Action-Lawsuit-Against-Livent-Corporation-and-Encourages-Investors-with-Losses-in-Excess-of-100-000-to-Co.html","symbols":["LTHM.US"],"tags":["CLASS ACTION","LAWSUIT","LIVENT","LTHM","SCHALL LAW","SCHALL LAW FIRM","SHAREHOLDERS"],"sentiment":{"polarity":-0.926,"neg":0.111,"neu":0.819,"pos":0.07}}]