[{"date":"2022-07-27T19:56:07+00:00","title":"Hide Out in These 3 Dividend Stocks in 2022","content":"(1:00) - Finding High Paying Dividend Stocks To Benefit Your Portfolio (5:45) - Breaking Down The Stock Screener: Stocks To Keep On Your Radar (22:10) - Episode Roundup:  WMT, SQN, PBR, EPR Podcast@Zacks.com\n\nWelcome to Episode #324 of the Zacks Market Edge Podcast.\n\nEvery week, host and Zacks stock strategist, Tracey Ryniec, will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life.\n\nThis week, Tracey is going solo to talk where you can hide out amidst 2022’s stock market volatility. Is there anywhere?\n\nEnergy used to be the go-to “safe” sector but those stocks have sold off big over the last 6 weeks. Even stocks known to be “defensive” like Walmart might not be in 2022.\n\nScreening for Growth Stocks with High Dividends\n\nTracey ran a screen that looked for increasing earnings growth, a Zacks Rank of #1 (Strong Buy), #2 (Buy) or #3 (Hold) and a dividend yielding over 5%.\n\nIt’s a tough combination but it yielded 36 stocks.\n\nStripping out the #3 (Hold) stocks, left just 7 stocks with the highest Zacks Ranks. Just 2 stocks were Zacks Rank #1s, with growth and with a dividend over 5%.\n\nThat’s an exclusive club.\n\nHiding Out in Dividend Stocks\n\n1. Sociedad Quimica y Minera de Chile SQM\n\nSociedad Quimica y Minera is a Chilean chemical company whose products include fertilizers, iodine, and lithium. Sociedad Quimica y Minera is the largest lithium producer in the world after tripling production over the last 3 years.\n\nShares have soared in 2022, up 87%, but are still cheap with a forward P\/E of just 8.9 as earnings are on the rise. It’s a Zacks Rank #1 (Strong Buy).\n\nSociedad Quimica y Minera is paying a big dividend. Zacks says it’s yielding 9.7% but it varies each quarter.\n\nSociedad Quimica y Minera reports earnings on Aug 17. Is it time to get in?\n\n2. Petrobras PBR\n\nPetrobras is a large Brazilian oil company. It’s also a Zacks Rank #1 (Strong Buy) as earnings are expected to be up this year.\n\nStory continues\n\nPetrobras shares are up just 13.6% year-to-date on fears about government pressures to keep gasoline prices down. But that makes them dirt cheap, with a forward P\/E of just 2.5.\n\nIt is paying an incredible dividend thanks to rising energy prices with Zacks saying the yield is 24.9%. Yes, 24.9%.\n\nBut like SQM above, it may vary each quarter.\n\nIs Petrobras a risk you should take?\n\n3. EPR Properties EPR\n\nEPR Properties is a REIT which owns 355 properties in 44 states and Canada specializing in experiences and connections. That means golf entertainment complexes, casinos, e-gaming, concert venues and climbing gyms.\n\nShares are up 10% year-to-date and are cheap with a forward P\/E of just 11.\n\nEPR Properties is expected to see earnings growth of 46% in 2022 as the economy reopens from the COVID restrictions and people want to travel and be out of their homes. It’s a Zacks Rank #2 (Buy).\n\nEPR pays a monthly dividend which is expected to be $3.30 per share annualized which is a yield of 6.4%.\n\nShould you consider a REIT like EPR Properties for the income?\n\nWhat Else Should You Know About Hiding Out in Dividend Stocks?\n\nTune into this week’s podcast to find out.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nPetroleo Brasileiro S.A. Petrobras (PBR) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nEPR Properties (EPR) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/hide-3-dividend-stocks-2022-195607153.html","symbols":["EPR.US","PBR-A.US","QYM.F","SQM.US"],"tags":["DIVIDEND STOCKS","EARNINGS GROWTH","EPR PROPERTIES","PBR","SOCIEDAD QUIMICA Y MINERA","STRONG BUY","TRACEY RYNIEC","ZACKS MARKET EDGE","ZACKS RANK"],"sentiment":{"polarity":0.996,"neg":0.033,"neu":0.846,"pos":0.121}},{"date":"2022-07-27T11:18:11+00:00","title":"Best Growth Stocks to Buy for July 27th","content":"Here are three stocks with buy ranks and strong growth characteristics for investors to consider today, July 27th:\n\nSociedad Quimica y Minera SQM: This company which produces fertilizer and iodine and manufactures industrial chemicals and iodine derivative products and sells its products in over 60 countries throughout the world, carries a Zacks Rank #1(Strong Buy), and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 34.4% over the last 60 days.\n\nSociedad Quimica y Minera S.A. Price and Consensus Sociedad Quimica y Minera S.A. Price and Consensus\n\nSociedad Quimica y Minera S.A. price-consensus-chart | Sociedad Quimica y Minera S.A. Quote\n\nSociedad Quimica y Minera has a PEG ratio of 0.50 compared with 0.61 for the industry. The company possesses a Growth Score of A.\n\nSociedad Quimica y Minera S.A. PEG Ratio (TTM) Sociedad Quimica y Minera S.A. PEG Ratio (TTM)\n\nSociedad Quimica y Minera S.A. peg-ratio-ttm | Sociedad Quimica y Minera S.A. Quote\n\nPebblebrook Hotel Trust PEB: This internally managed hotel investment company organized to acquire and invest in hotel properties located primarily in large United States cities with an emphasis on the major coastal markets, carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 24.2% over the last 60 days.\n\nPebblebrook Hotel Trust Price and Consensus Pebblebrook Hotel Trust Price and Consensus\n\nPebblebrook Hotel Trust price-consensus-chart | Pebblebrook Hotel Trust Quote\n\nPebblebrook Hotel Trust has a PEG ratio of 0.73 compared with 3.10 for the industry. The company possesses a Growth Score of B.\n\nPebblebrook Hotel Trust PEG Ratio (TTM) Pebblebrook Hotel Trust PEG Ratio (TTM)\n\nPebblebrook Hotel Trust peg-ratio-ttm | Pebblebrook Hotel Trust Quote\n\nDelek US Holdings DK: This Brentwood, TN-based company which is an independent refiner, transporter, and marketer of petroleum products, carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 93.5% over the last 60 days.\n\nDelek US Holdings, Inc. Price and Consensus Delek US Holdings, Inc. Price and Consensus\n\nDelek US Holdings, Inc. price-consensus-chart | Delek US Holdings, Inc. Quote\n\nStory continues\n\nDelek US Holdings has a PEG ratio of 0.19 compared with 0.47 for the industry. The company possesses a Growth Score of B.\n\nDelek US Holdings, Inc. PEG Ratio (TTM) Delek US Holdings, Inc. PEG Ratio (TTM)\n\nDelek US Holdings, Inc. peg-ratio-ttm | Delek US Holdings, Inc. Quote\n\nSee the full list of top ranked stocks here.\n\nLearn more about the Growth score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nDelek US Holdings, Inc. (DK) : Free Stock Analysis Report\r\n \r\nPebblebrook Hotel Trust (PEB) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-growth-stocks-buy-july-111811399.html","symbols":["DEH.F","DK.US","PEB-PE.US","PEB-PF.US","PEB.US","QYM.F","SQM.US"],"tags":["CONSENSUS ESTIMATE","MINERA S.A","PEBBLEBROOK HOTEL TRUST","PEBBLEBROOK HOTEL TRUST PRICE","PEG RATIO","SOCIEDAD QUIMICA Y MINERA","SOCIEDAD QUIMICA Y MINERA S.A. PRICE","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.997,"neg":0,"neu":0.855,"pos":0.145}},{"date":"2022-07-26T21:50:09+00:00","title":"SQM (SQM) Dips More Than Broader Markets: What You Should Know","content":"SQM (SQM) closed the most recent trading day at $93.64, moving -1.86% from the previous trading session. This move lagged the S&P 500's daily loss of 1.15%. Elsewhere, the Dow lost 0.71%, while the tech-heavy Nasdaq lost 0.08%.\n\nHeading into today, shares of the chemicals company had gained 3.06% over the past month, outpacing the Basic Materials sector's loss of 7.87% and the S&P 500's gain of 1.44% in that time.\n\nWall Street will be looking for positivity from SQM as it approaches its next earnings report date. The company is expected to report EPS of $3.11, up 903.23% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $2.03 billion, up 245.35% from the prior-year quarter.\n\nSQM's full-year Zacks Consensus Estimates are calling for earnings of $10.71 per share and revenue of $8.51 billion. These results would represent year-over-year changes of +422.44% and +197.34%, respectively.\n\nInvestors might also notice recent changes to analyst estimates for SQM. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\n\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 12.92% higher. SQM currently has a Zacks Rank of #1 (Strong Buy).\n\nDigging into valuation, SQM currently has a Forward P\/E ratio of 8.91. This valuation marks a premium compared to its industry's average Forward P\/E of 4.8.\n\nStory continues\n\nAlso, we should mention that SQM has a PEG ratio of 0.5. This metric is used similarly to the famous P\/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. SQM's industry had an average PEG ratio of 0.57 as of yesterday's close.\n\nThe Fertilizers industry is part of the Basic Materials sector. This industry currently has a Zacks Industry Rank of 47, which puts it in the top 19% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nYou can find more information on all of these metrics, and much more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/sqm-sqm-dips-more-broader-215009057.html","symbols":["QYM.F","SQM.US"],"tags":["ESTIMATE REVISIONS","S&P 500","STRONG BUY","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.988,"neg":0.016,"neu":0.896,"pos":0.088}},{"date":"2022-07-25T16:16:04+00:00","title":"Newmont's (NEM) Earnings and Revenues Lag Estimates in Q2","content":"Newmont Corporation NEM reported net income from continuing operations of $379 million or 48 cents per share in second-quarter 2022, down from $640 million or 80 cents per share in the year-ago quarter.\n\nBarring one-time items, adjusted earnings were 46 cents per share that missed the Zacks Consensus Estimate of 60 cents.\n\nNewmont reported revenues of $3,058 million, almost flat year over year.  The figure missed the Zacks Consensus Estimate by 0.5%. Higher average realized gold prices and copper sales volume were partly offset by reduced average realized co-product metal prices.\n\nNewmont Corporation Price, Consensus and EPS Surprise Newmont Corporation Price, Consensus and EPS Surprise\n\nNewmont Corporation price-consensus-eps-surprise-chart | Newmont Corporation Quote\n\nOperational Highlights\n\nNewmont's attributable gold production in the second quarter increased roughly 3.4% year over year to around1.5 million ounces in the quarter.\n\nAverage realized prices of gold rose 0.7% year over year to $1,836 per ounce.\n\nThe company’s costs applicable to sales (CAS) for gold were $932 per ounce, up 23.4% year over year. The increase was mainly driven by higher direct operating costs resulting from higher labor costs and increased commodity inputs, including higher fuel and energy costs.\n\nAll-in sustaining costs (AISC) for gold were up 15.8% year over year to $1,199 per ounce, mainly due to higher CAS per gold equivalent ounce.\n\nRegional Performance\n\nNorth America: Second-quarter attributable gold production in North America was 316,000 ounces, down 20% year over year. Gold CAS in the region was $1,124 per ounce, up 46% year over year.\n\nSouth America: Attributable gold production in South America was 210,000 ounces, up 11% year over year. Gold CAS in the region rose 36% on a year-over-year basis to $982 per ounce.\n\nAustralia: Attributable gold in the region was 366,000 ounces, up 22% year over year. Gold CAS in the region was down 7% year over year to $710 per ounce.\n\nAfrica: Production in the region totaled 243,000 ounces of gold in the quarter, up 20% year over year. Gold CAS was $838 per ounce, up 10% year over year.\n\nStory continues\n\nNevada: Production totaled 290,000 ounces of gold in the quarter, up 2% year over year. Gold CAS was $1,035 per ounce, up 37% year over year.\n\nFinancial Position\n\nThe company ended the quarter with cash and cash equivalents of $4,307 million, down 6% year over year. At the end of the quarter, the company had long-term debt of $5,568 million, up 11.6% year over year.\n\nNet cash from continuing operations amounted to $1,033 million. Free cash flow totaled $514 million in the second quarter.\n\nOutlook\n\nFor 2022, Newmont expects attributable gold production of 6 million ounces. The company also expects gold CAS to be $900 per ounce and AISC to be $1,150 per ounce.\n\nNewmont’s cost guidance reflects the impact of lower production volumes and higher direct operating costs related to labor, energy, consumables and supplies due to sustained inflationary pressures.\n\nPrice Performance\n\nNewmont’s shares have declined 14.9% in the past year compared with a 29.5% fall of the industry. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank & Key Picks\n\nNewmont currently carries a Zacks Rank #3 (Hold).\n\nSome better-ranked stocks in the basic materials space are Albemarle Corporation ALB, Cabot Corporation CBT and Sociedad Quimica y Minera de Chile S.A. SQM.\n\nAlbemarle has a projected earnings growth rate of 241.8% for the current year. The Zacks Consensus Estimate for ALB's current-year earnings has been revised 21.5% upward in the past 60 days.\n\nAlbemarle’s earnings beat the Zacks Consensus Estimate in each of the last four quarters. It has a trailing four-quarter earnings surprise of roughly 22.5%, on average. ALB has gained around 13.7% in a year and currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nCabot, currently sporting a Zacks Rank #1 (Strong Buy), has an expected earnings growth rate of 22.5% for the current year. The Zacks Consensus Estimate for CBT's earnings for the current year has been revised 6% upward in the past 60 days.\n\nCabot’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 16.2%. CBT has gained around 28.6% over a year.\n\nSociedad has a projected earnings growth rate of 422.4% for the current year. The Zacks Consensus Estimate for SQM’s current-year earnings has been revised 75.3% upward in the past 60 days.\n\nSociedad’s earnings beat the Zacks Consensus Estimate in two of the trailing four quarters, the average being 28.2%. SQM has gained 89.6% in a year. The company sports a Zacks Rank #1.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nNewmont Corporation (NEM) : Free Stock Analysis Report\r\n \r\nAlbemarle Corporation (ALB) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nCabot Corporation (CBT) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/newmonts-nem-earnings-revenues-lag-161604445.html","symbols":["ALB.US","AMC.F","CBT.F","CBT.US","NEM.US","NGT.TO","NMM.F","NMM.XETRA","QYM.F","SQM.US"],"tags":["CONSENSUS ESTIMATE","GOLD PRICES","GOLD PRODUCTION","NEWMONT CORPORATION","ZACKS CONSENSUS ESTIMATE","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.993,"neg":0.013,"neu":0.913,"pos":0.074}},{"date":"2022-07-25T11:50:11+00:00","title":"Best Growth Stocks to Buy for July 25th","content":"Here are three stocks with buy ranks and strong growth characteristics for investors to consider today, July 25th:\n\nSociedad Quimica y Minera SQM: This company which produces fertilizer and iodine and manufactures industrial chemicals and iodine derivative products and sells its products in over 60 countries throughout the world, carries a Zacks Rank #1(Strong Buy), and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 34.4% over the last 60 days.\n\nSociedad Quimica y Minera S.A. Price and Consensus Sociedad Quimica y Minera S.A. Price and Consensus\n\nSociedad Quimica y Minera S.A. price-consensus-chart | Sociedad Quimica y Minera S.A. Quote\n\nSociedad Quimica y Minera has a PEG ratio of 0.48 compared with 0.60 for the industry. The company possesses a Growth Score of A.\n\nSociedad Quimica y Minera S.A. PEG Ratio (TTM) Sociedad Quimica y Minera S.A. PEG Ratio (TTM)\n\nSociedad Quimica y Minera S.A. peg-ratio-ttm | Sociedad Quimica y Minera S.A. Quote\n\nDelek US Holdings DK: This Brentwood, TN-based company which is an independent refiner, transporter, and marketer of petroleum products, carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 66.3% over the last 60 days.\n\nDelek US Holdings, Inc. Price and Consensus Delek US Holdings, Inc. Price and Consensus\n\nDelek US Holdings, Inc. price-consensus-chart | Delek US Holdings, Inc. Quote\n\nDelek US Holdings has a PEG ratio of 0.21 compared with 0.47 for the industry. The company possesses a Growth Score of B.\n\nDelek US Holdings, Inc. PEG Ratio (TTM) Delek US Holdings, Inc. PEG Ratio (TTM)\n\nDelek US Holdings, Inc. peg-ratio-ttm | Delek US Holdings, Inc. Quote\n\nPebblebrook Hotel Trust PEB: This internally managed hotel investment company organized to acquire and invest in hotel properties located primarily in large United States cities with an emphasis on the major coastal markets, carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 24.2% over the last 60 days.\n\nPebblebrook Hotel Trust Price and Consensus Pebblebrook Hotel Trust Price and Consensus\n\nPebblebrook Hotel Trust price-consensus-chart | Pebblebrook Hotel Trust Quote\n\nStory continues\n\nPebblebrook Hotel Trust has a PEG ratio of 0.72 compared with 3.09 for the industry. The company possesses a Growth Score of B.\n\nPebblebrook Hotel Trust PEG Ratio (TTM) Pebblebrook Hotel Trust PEG Ratio (TTM)\n\nPebblebrook Hotel Trust peg-ratio-ttm | Pebblebrook Hotel Trust Quote\n\nSee the full list of top ranked stocks here.\n\nLearn more about the Growth score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nDelek US Holdings, Inc. (DK) : Free Stock Analysis Report\r\n \r\nPebblebrook Hotel Trust (PEB) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-growth-stocks-buy-july-115011093.html","symbols":["DEH.F","DK.US","PEB-PE.US","PEB-PF.US","PEB.US","QYM.F","SQM.US"],"tags":["CONSENSUS ESTIMATE","DELEK US HOLDINGS","MINERA S.A","PEBBLEBROOK HOTEL TRUST","PEBBLEBROOK HOTEL TRUST PRICE","PEG RATIO","SOCIEDAD QUIMICA Y MINERA","SOCIEDAD QUIMICA Y MINERA S.A. PRICE","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.997,"neg":0,"neu":0.855,"pos":0.145}},{"date":"2022-07-22T15:58:03+00:00","title":"Valmont (VMI) Earnings &amp; Revenues Surpass Estimates in Q2","content":"Valmont Industries, Inc. VMI registered profits of $76.1 million or $3.53 per share in second-quarter 2022, up from $62.1 million or $2.89 per share in the year-ago quarter.\n\nBarring one-time items, adjusted earnings were $3.70 per share in the reported quarter, beating the Zacks Consensus Estimate of $3.29.\n\nRevenues in the quarter were $1,135.5 million, up 26.9% year over year. The figure surpassed the Zacks Consensus Estimate of $992.1 million.  Sales were driven by favorable pricing and higher volumes.\n\nValmont Industries, Inc. Price, Consensus and EPS Surprise Valmont Industries, Inc. Price, Consensus and EPS Surprise\n\nValmont Industries, Inc. price-consensus-eps-surprise-chart | Valmont Industries, Inc. Quote\n\nSegment Highlights\n\nSales in the Infrastructure segment increased 23.9% year over year to $765 million in the reported quarter. This upside was backed by favorable pricing globally and increased volumes, especially for renewable energy, telecommunication and Transmission, Distribution and Substation products.\n\nSales in the Agriculture segment rose 34% year over year to $377.8 million. The uptick was driven by increased average selling prices of irrigation equipment globally and higher volumes, especially in North America and Brazil.\n\nFinancial Position\n\nValmont ended the second quarter with cash and cash equivalents of $154.6 million, down 22.4% year over year. Long-term debt stood at around $995.6 million, up 15.6% year over year.\n\nCash flows from operating activities were $68 million for 26 weeks ended Jun 25, 2022, down from $70.2 million for the same period a year ago (as of Jun 26, 2021).\n\nThe company returned $21.5 million to shareholders through dividends and share buybacks during the quarter.\n\nOutlook\n\nValmont revised its outlook for 2022. It expects net sales growth for 2022 in the range of 20-21% year over year, up from 11-17% expected earlier. The company expects earnings per share (EPS) in the range of $12.90-$13.30 for the year, up from $12.30-$12.80 expected earlier. Adjusted EPS are now projected in the band of $13.60-$14, up from the prior forecast of $13-$13.50.\n\nStory continues\n\nValmont projects capital expenditures in the range of $110-$120 million for 2022.\n\nThe company raised its outlook due to strong first-half results and several otherpositive drivers. These include a record backlog of $2 billion, reflecting continued strong, global market drivers across its businesses.\r\nThe company is well positioned to drive sustainable, profitable growth and deliver long-term value to its shareholders.\n\nPrice Performance\n\nThe company’s shares have increased 8.1% in the past year compared with a 12.3% rise of the industry. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank & Key Picks\n\nValmont currently carries a Zacks Rank #4 (Sell).\n\nSome better-ranked stocks in the basic materials space are Albemarle Corporation ALB, Cabot Corporation CBT and Sociedad Quimica y Minera de Chile S.A. SQM.\n\nAlbemarle has a projected earnings growth rate of 241.8% for the current year. The Zacks Consensus Estimate for ALB's current-year earnings has been revised 21.5% upward in the past 60 days.\n\nAlbemarle’s earnings beat the Zacks Consensus Estimate in each of the last four quarters. It has a trailing four-quarter earnings surprise of roughly 22.5%, on average. ALB has gained around 18.5% in a year and currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nCabot, currently sporting a Zacks Rank #1 (Strong Buy), has an expected earnings growth rate of 22.5% for the current year. The Zacks Consensus Estimate for CBT's earnings for the current year has been revised 6% upward in the past 60 days.\n\nCabot’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 16.2%. CBT has gained around 30.7% over a year.\n\nSociedad has a projected earnings growth rate of 422.4% for the current year. The Zacks Consensus Estimate for SQM’s current-year earnings has been revised 75.3% upward in the past 60 days.\n\nSociedad’s earnings beat the Zacks Consensus Estimate in two of the trailing four quarters, the average being 28.2%. SQM has gained 94.3% in a year. The company sports a Zacks Rank #1.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nValmont Industries, Inc. (VMI) : Free Stock Analysis Report\r\n \r\nAlbemarle Corporation (ALB) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nCabot Corporation (CBT) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/valmont-vmi-earnings-revenues-surpass-155803630.html","symbols":["ALB.US","AMC.F","CBT.F","CBT.US","QYM.F","SQM.US","VI1.F","VMI.US"],"tags":["CONSENSUS ESTIMATE","EARNINGS PER SHARE","INC","REPORTED QUARTER","VALMONT INDUSTRIES","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.997,"neg":0.007,"neu":0.872,"pos":0.121}},{"date":"2022-07-21T15:43:03+00:00","title":"Freeport's (FCX) Earnings and Sales Miss Estimates in Q2","content":"Freeport-McMoRan Inc. FCX recorded net income (attributable to common stock) of $840 million or 57 cents per share in second-quarter 2022, down from $1,083 million or 73 cents in the year-ago quarter.\n\nBarring one-time items, adjusted earnings per share came in at 58 cents, missing the Zacks Consensus Estimate of 76 cents.\n\nRevenues declined roughly 5.8% year over year to $5,416 million. The figure missed the Zacks Consensus Estimate of $6,407.8 million.\n\nFreeportMcMoRan Inc. Price, Consensus and EPS Surprise FreeportMcMoRan Inc. Price, Consensus and EPS Surprise\n\nFreeportMcMoRan Inc. price-consensus-eps-surprise-chart | FreeportMcMoRan Inc. Quote\n\nOperational Update\n\nCopper production rose 17.7% year over year to 1,075 million pounds in the second quarter.\n\nConsolidated sales from mines rose 17% year over year to 1,087 million pounds of copper. The company sold 476,000 ounces of gold and 20 million pounds of molybdenum during the quarter.\n\nConsolidated average unit net cash costs per pound of copper were $1.41, down about 4.7% year over year. The downside was caused by higher sales volume and by-product credits.\n\nThe average realized price for copper was $4.03 per pound, down roughly 7.1% year over year. The average realized price per ounce for gold increased around 1.8% year over year to $1,827. The average realized price per pound for molybdenum was $19.44, up around 48.3% year over year.\n\nFinancial Position\n\nCash and cash equivalents at the end of the second quarter were $9,492 million, up 17.6% year over year. The company’s long-term debt was $10,054 million, up around 10.8% year over year.\n\nCash flows provided by operations were $3,312 million for the six months ended Jun 30, 2022.\n\nGuidance\n\nFor 2022, Freeport anticipates consolidated sales volumes to be roughly 4.2 billion pounds of copper.\n\nThe company also expects gold sales volumes of 1.7 million ounces for 2022. It also expects sales of 80 million pounds of molybdenum for the year.\n\nFor the third quarter of 2022, Freeport expects sales volumes to be 1 billion pounds of copper, 400,000 ounces of gold and 21 million pounds of molybdenum.\n\nStory continues\n\nPrice Performance\n\nFreeport’s shares have dropped 17.9% in the past year compared with a 24.3% decline of the industry. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank & Key Picks\n\nFreeport currently carries a Zacks Rank #3 (Hold).\n\nSome better-ranked stocks in the basic materials space are Albemarle Corporation ALB, Cabot Corporation CBT and Sociedad Quimica y Minera de Chile S.A. SQM.\n\nAlbemarle has a projected earnings growth rate of 239.1% for the current year. The Zacks Consensus Estimate for ALB's current-year earnings has been revised 20.5% upward in the past 60 days.\n\nAlbemarle’s earnings beat the Zacks Consensus Estimate in each of the last four quarters. It has a trailing four-quarter earnings surprise of roughly 22.5%, on average. ALB has gained around 13.9% in a year and currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nCabot, currently sporting a Zacks Rank #1 (Strong Buy), has an expected earnings growth rate of 22.5% for the current year. The Zacks Consensus Estimate for CBT's earnings for the current year has been revised 6% upward in the past 60 days.\n\nCabot’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 16.2%. CBT has gained around 32% over a year.\n\nSociedad has a projected earnings growth rate of 422.4% for the current year. The Zacks Consensus Estimate for SQM’s current-year earnings has been revised 75.3% upward in the past 60 days.\n\nSociedad’s earnings beat the Zacks Consensus Estimate in two of the trailing four quarters, the average being 28.2%. SQM has gained 77.4% in a year. The company sports a Zacks Rank #1.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nFreeportMcMoRan Inc. (FCX) : Free Stock Analysis Report\r\n \r\nAlbemarle Corporation (ALB) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nCabot Corporation (CBT) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/freeports-fcx-earnings-sales-miss-154303258.html","symbols":["ALB.US","AMC.F","CBT.F","CBT.US","FCX.MX","FCX.US","FPMB.F","QYM.F","SQM.US"],"tags":["ALBEMARLE CORPORATION","CONSENSUS ESTIMATE","EARNINGS PER SHARE","FREEPORT","FREEPORT-MCMORAN INC","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.99,"neg":0.013,"neu":0.914,"pos":0.073}},{"date":"2022-07-21T15:30:03+00:00","title":"Steel Dynamics' (STLD) Earnings and Sales Top Estimates in Q2","content":"Steel Dynamics, Inc. STLD logged a net income of $1.2 billion or $6.44 per share in second-quarter 2022, up from $702.3 million or $3.32 in the year-ago quarter.\n\nBarring one-time items, adjusted earnings per share came in at $6.73, topping the Zacks Consensus Estimate of $6.34.\n\nNet sales in the quarter increased roughly 39% year over year to a record $6,212.9 million. The figure beat the Zacks Consensus Estimate of $6,066.3 million.\n\nSteel Dynamics, Inc. Price, Consensus and EPS Surprise Steel Dynamics, Inc. Price, Consensus and EPS Surprise\n\nSteel Dynamics, Inc. price-consensus-eps-surprise-chart | Steel Dynamics, Inc. Quote\n\nSegment Highlights\n\nNet sales in the company's steel operations rose around 28.1% year over year to $4,142 million in the reported quarter. Operating income increased roughly 8.8% year over year to $1,106.7 million. The average product selling price for the unit rose around 19.1% year over year to $1,539 per ton in the reported quarter. The company had record steel shipments of around 3.1 million tons.\n\nThe company's steel fabrication operations raked in sales of around $1,085.8 million, up around 228.2% year over year. The segment posted an operating income of $599.2 million compared with an operating income of $28.5 million in the year-ago quarter.\n\nNet sales in metals recycling operations increased around 12.9% year over year to $649.7 million. Operating income increased roughly 13.1% year over year to $57.6 million.\n\nFinancial Position\n\nSteel Dynamics ended the second quarter with cash and cash equivalents of $1,007 million, down around 10% from the year-ago quarter’s levels. Long-term debt declined to $3,011.1 million from $3,016.5 millionin the year-ago quarter.\n\nThe company generated around $1 billion cash flow from operations in the second quarter.\n\nOutlook\n\nSteel Dynamics stated that customer order entry activity remains healthy across all businesses. It is seeing strong steel order activity from automotive, construction, and industrial sectors and improvement in energy despite weakening flat roll steel pricing.Order backlog remains at near-record volumes and forward pricing levels at its steel fabrication operations.\n\nStory continues\n\nSteel Dynamics also stated that operations continue to ramp up at its Sinton Flat Roll Steel Milland achieved run rates of 80%. It expects to realize meaningful improvement for the balance of the year.\n\nIt recently announced a planned investment in a new state-of-the-art low-carbon aluminum flat rolled mill continues its strategic growth. It is aligned with its core steelmaking and recycling platforms, benefits many existing customers, and provides for future value creation. STLD is well-placed for sustainable long-term growth and value creation, the company noted.\n\nPrice Performance\n\nShares of Steel Dynamics have gained 15.2% in the past year against a 20.3% decline of the industry. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank & Other Key Picks\n\nSteel Dynamics currently carries a Zacks Rank #5 (Strong Sell).\n\nSome better-ranked stocks in the basic materials space are Albemarle Corporation ALB, Cabot Corporation CBT and Sociedad Quimica y Minera de Chile S.A. SQM.\n\nAlbemarle has a projected earnings growth rate of 239.1% for the current year. The Zacks Consensus Estimate for ALB's current-year earnings has been revised 20.5% upward in the past 60 days.\n\nAlbemarle’s earnings beat the Zacks Consensus Estimate in each of the last four quarters. It has a trailing four-quarter earnings surprise of roughly 22.5%, on average. ALB has gained around 13.9% in a year and currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nCabot, currently sporting a Zacks Rank #1, has an expected earnings growth rate of 22.5% for the current year. The Zacks Consensus Estimate for CBT's earnings for the current year has been revised 6% upward in the past 60 days.\n\nCabot’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 16.2%. CBT has gained around 32% over a year.\n\nSociedad has a projected earnings growth rate of 422.4% for the current year. The Zacks Consensus Estimate for SQM’s current-year earnings has been revised 75.3% upward in the past 60 days.\n\nSociedad’s earnings beat the Zacks Consensus Estimate in two of the trailing four quarters, the average being 28.2%. SQM has gained 77.4% in a year. The company sports a Zacks Rank #1.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSteel Dynamics, Inc. (STLD) : Free Stock Analysis Report\r\n \r\nAlbemarle Corporation (ALB) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nCabot Corporation (CBT) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/steel-dynamics-stld-earnings-sales-153003706.html","symbols":["ALB.US","AMC.F","CBT.F","CBT.US","QYM.F","SD5.F","SQM.US","STLD.MX","STLD.US"],"tags":["CONSENSUS ESTIMATE","EARNINGS PER SHARE","FABRICATION OPERATIONS","OPERATING INCOME","REPORTED QUARTER","STEEL DYNAMICS","ZACKS CONSENSUS ESTIMATE","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.998,"neg":0.003,"neu":0.855,"pos":0.142}},{"date":"2022-07-21T10:30:18+00:00","title":"3 Undervalued Lithium Stocks to Buy Now","content":"Although the burgeoning electric vehicle industry organically excites investors, the reality is that infrastructural plays may be more reliable in the long run. Therefore, those who anticipate the broader electrification of mobility may want to focus their attention on undervalued lithium stocks to buy now.\n\nFirst, the companies that mine and produce lithium enjoy a remarkably strong demand profile. As Time recently stated, prices for the underlying commodity are up 400%. Further, experts note that supply will get worse before it gets better, creating significant implications for the EV market. Since EVs can’t go anywhere without lithium, this dynamic fosters a cynically compelling backdrop for undervalued lithium stocks to buy now.\n\nSecond, while acquiring individual EV manufacturers may yield the greatest profitability potential, this strategy comes with one major caveat: you’ve got to guess correctly. With the number of sector participants constantly rising, it’s difficult to predict who will ultimately come out on top.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\n7 Cheap Stocks That Are Trading at a Discount\n\nBut with undervalued lithium stocks to buy, you’re dealing with broader needs rather than specific consumer tastes. Therefore, this indirect approach to EVs could drive more confidence to investors.\n\nTicker Company Current Price LTHM Livent Corporation $22.64 SQM Sociedad Química y Minera de Chile S.A. $88.76 PILBF Pilbara Minerals Limited $1.73\n\nUndervalued Lithium Stocks: Livent (LTHM) Livent Corporation logo on a phone screen. LTHM stock.\n\nSource: Ralf Liebhold \/ Shutterstock\n\nBilled as a lithium technology partner, Livent (NYSE:LTHM) leverages its material science expertise to provide solutions across various industries and applications. Primarily, the company is focused on energy storage and battery systems, providing ultra-pure lithium hydroxide monohydrate. In addition, the company delivers polymer products that empower industrial applications.\n\nWhile Livent suffered an off-year because of the coronavirus pandemic, it’s rapidly making up for lost time. In 2021, the company generated $420.4 million in revenue, which was up over 8% from 2019’s result. Further, in the first quarter of 2022, Livent posted sales of $143.5 million, representing a gain of over 56% against the year-ago level.\n\nStory continues\n\nCompared to other companies in the space, Livent is putting up solid metrics against key benchmarks. For instance, its net margin of 11.6% is notably above the chemicals industry median of 7%. While shares are down about 7% year-to-date, LTHM makes an interesting case for undervalued lithium stocks to buy as demand for targeted solutions pick up.\n\nSociedad Quimica y Minera de Chile (SQM) Sociedad Quimica y Minera (SQM) logo displayed on a mobile phone with the company's web page on it\n\nSource: madamF \/ Shutterstock.com\n\nOne of the powerhouses in the lithium arena, Sociedad Quimica y Minera de Chile (NYSE:SQM) has geography as a key advantage. A Chilean chemicals firm, its home market represents the second-largest producer of lithium. Further, U.S. relations with Chile is a net positive.\n\nIn fact, the State Department notes on its website that “Chile is one of the United States’ strongest partners in Latin America and a leader in promoting respect for the rule of law, economic stability, education, environmental protection, human rights, and sustainable development.” With the world seemingly going mad, it’s nice to have international partners you can depend on.\n\nBetter yet, SQM knows how to deliver the goods. Again, 2020 was a rough time for the company. However, it bounced back in 2021 with sales of $2.86 billion, up 47% from 2019’s result. Also, SQM is off to a flying start in 2022, with Q1 sales of $2 billion up nearly quadruple that of the year-ago quarter’s tally.\n\nSQM encountered some softening over the past month, which makes it intriguing as one of the undervalued lithium stocks to buy on account of its financial robustness.\n\nUndervalued Lithium Stocks: Pilbara Minerals (PILBF) A photo of a kangaroo on the beach at Cape Le Grand National Park in Australia.\n\nSource: John Crux \/ Shutterstock.com\n\nBased in Australia, Pilbara Minerals (OTCMKTS:PILBF) is a pure-play lithium company. According to the company’s website, Pilbara owns 100% of the world’s largest, independent hard-rock lithium operation. As with SQM above, Pilbara enjoys a geographic advantage.\n\nFirst, Australia is one of the closest allies of the U.S. and western nations, an important partner in the eastern hemisphere. Second, Australia is a natural resource powerhouse, being the world’s largest producer of opal and the largest exporter of coal. Of course, it’s an important source of several other commodities, including lithium.\n\nNow, it’s important to point out that PILBF is really what most folks would call a penny stock. As well, shares have dropped 32% in 2022. Nevertheless, against a basket of valuation metrics, PILBF is considered significantly undervalued.\n\nAlthough nominal revenues have been muted, the company has really picked up steam in 2021. For the half-year period ended Dec. 31, 2021, Pilbara generated $208.7 million in revenue, up 369% against the year-ago comparison. Therefore, if you want to take a speculative shot with undervalued lithium stocks to buy, PILBF could be interesting.\n\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live The Best $1 Investment You Can Make Today Early Bitcoin Millionaire Reveals His Next Big Crypto Trade “On Air” Cash Holders Could Get Hit Hard THIS FRIDAY\n\nThe post 3 Undervalued Lithium Stocks to Buy Now appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/3-undervalued-lithium-stocks-buy-103018964.html","symbols":["8LV.F","LTHM.US","QYM.F","SQM.US"],"tags":["LITHIUM HYDROXIDE","LITHIUM STOCKS","LIVENT","PILBARA","PILBARA MINERALS","SOCIEDAD QUíMICA Y MINERA DE CHILE","UNDERVALUED"],"sentiment":{"polarity":0.997,"neg":0.024,"neu":0.865,"pos":0.111}},{"date":"2022-07-20T21:50:09+00:00","title":"SQM (SQM) Stock Sinks As Market Gains: What You Should Know","content":"SQM (SQM) closed the most recent trading day at $88.76, moving -0.54% from the previous trading session. This change lagged the S&P 500's 0.59% gain on the day. Elsewhere, the Dow gained 0.15%, while the tech-heavy Nasdaq lost 0.02%.\n\nHeading into today, shares of the chemicals company had lost 4.65% over the past month, outpacing the Basic Materials sector's loss of 9.96% and lagging the S&P 500's gain of 7.25% in that time.\n\nSQM will be looking to display strength as it nears its next earnings release. In that report, analysts expect SQM to post earnings of $3.11 per share. This would mark year-over-year growth of 903.23%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $2.03 billion, up 245.35% from the year-ago period.\n\nSQM's full-year Zacks Consensus Estimates are calling for earnings of $10.71 per share and revenue of $8.51 billion. These results would represent year-over-year changes of +422.44% and +197.34%, respectively.\n\nInvestors should also note any recent changes to analyst estimates for SQM. These revisions typically reflect the latest short-term business trends, which can change frequently. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\n\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 12.92% higher within the past month. SQM currently has a Zacks Rank of #1 (Strong Buy).\n\nValuation is also important, so investors should note that SQM has a Forward P\/E ratio of 8.33 right now. This represents a premium compared to its industry's average Forward P\/E of 4.59.\n\nStory continues\n\nIt is also worth noting that SQM currently has a PEG ratio of 0.47. The PEG ratio is similar to the widely-used P\/E ratio, but this metric also takes the company's expected earnings growth rate into account. Fertilizers stocks are, on average, holding a PEG ratio of 0.54 based on yesterday's closing prices.\n\nThe Fertilizers industry is part of the Basic Materials sector. This group has a Zacks Industry Rank of 55, putting it in the top 22% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nYou can find more information on all of these metrics, and much more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/sqm-sqm-stock-sinks-market-215009083.html","symbols":["QYM.F","SQM.US"],"tags":["ESTIMATE REVISIONS","S&P 500","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.989,"neg":0.015,"neu":0.891,"pos":0.094}},{"date":"2022-07-20T15:02:03+00:00","title":"ATI Inks Multi-Year Supply Agreement With GKN Aerospace","content":"ATI Inc. ATI reached a new multi-year agreement with GKN Aerospace to supply high-value titanium materials used in the production of commercial and military airframes. GKN is a leading global tier-one aerospace supplier.\n\nATI will provide the majority share of titanium plate and sheet products to GKN. Shipments are projected to start in the third quarter of 2022. ATI expects delivery tracking to rise with market demand.\n\nATI stated that this agreement considerably expands its longstanding relationship with GKN. It is honored to partner with GKN as it secures a long-term supply of materials vital to its success as a leading innovator.\n\nThe latest demonstration of ATI's transformation focuses on high-value materials for its aerospace and defense markets. ATI noted that its world-class melting, rolling and finishing capabilities provide GKN with the quality, delivery and service it needs to serve its commercial and military customers.\n\nATI, in its last earnings call, stated that it projects continued growth in its most significant end markets. The company’s lean cost structures will help it improve earnings and margins from the year-ago quarter’s levels amid the prevailing environment. It expects to continue improving inventory efficiency, balanced with ensuring an adequate supply of input materials to achieve growth.\n\nATI Inc. Price and Consensus ATI Inc. Price and Consensus\n\nATI Inc. price-consensus-chart | ATI Inc. Quote\n\nZacks Rank & Other Key Picks\n\nATI currently sports a Zacks Rank #1 (Strong Buy).\n\nSome other top-ranked stocks in the basic materials space are Albemarle Corporation ALB, Cabot Corporation CBT and Sociedad Quimica y Minera de Chile S.A. SQM.\n\nAlbemarle has a projected earnings growth rate of 239.1% for the current year. The Zacks Consensus Estimate for ALB's current-year earnings has been revised 20.5% upward in the past 60 days.\n\nAlbemarle’s earnings beat the Zacks Consensus Estimate in each of the last four quarters. It has a trailing four-quarter earnings surprise of roughly 22.5%, on average. ALB has gained around 11.2% in a year and currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nStory continues\n\nCabot, currently sporting a Zacks Rank #1, has an expected earnings growth rate of 22.5% for the current year. The Zacks Consensus Estimate for CBT's earnings for the current year has been revised 6% upward in the past 60 days.\n\nCabot’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 16.2%. CBT has gained around 28.6% over a year.\n\nSociedad has a projected earnings growth rate of 422.4% for the current year. The Zacks Consensus Estimate for SQM’s current-year earnings has been revised 75.3% upward in the past 60 days.\n\nSociedad’s earnings beat the Zacks Consensus Estimate in two of the trailing four quarters, the average being 28.2%. SQM has gained 82.1% in a year. The company sports a Zacks Rank #1.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nATI Inc. (ATI) : Free Stock Analysis Report\r\n \r\nAlbemarle Corporation (ALB) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nCabot Corporation (CBT) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/ati-inks-multi-supply-agreement-150203517.html","symbols":["ALB.US","AMC.F","CBT.F","CBT.US","QYM.F","SQM.US"],"tags":["ALBEMARLE CORPORATION","ATI INC","CABOT CORPORATION","CONSENSUS ESTIMATE","GKN AEROSPACE","ZACKS RANK"],"sentiment":{"polarity":0.997,"neg":0.003,"neu":0.855,"pos":0.142}},{"date":"2022-07-20T13:40:01+00:00","title":"Is Nutrien (NTR) Stock Outpacing Its Basic Materials Peers This Year?","content":"Investors interested in Basic Materials stocks should always be looking to find the best-performing companies in the group. Nutrien (NTR) is a stock that can certainly grab the attention of many investors, but do its recent returns compare favorably to the sector as a whole? A quick glance at the company's year-to-date performance in comparison to the rest of the Basic Materials sector should help us answer this question.\n\nNutrien is a member of the Basic Materials sector. This group includes 242 individual stocks and currently holds a Zacks Sector Rank of #12. The Zacks Sector Rank considers 16 different sector groups. The average Zacks Rank of the individual stocks within the groups is measured, and the sectors are listed from best to worst.\n\nThe Zacks Rank emphasizes earnings estimates and estimate revisions to find stocks with improving earnings outlooks. This system has a long record of success, and these stocks tend to be on track to beat the market over the next one to three months. Nutrien is currently sporting a Zacks Rank of #2 (Buy).\n\nOver the past 90 days, the Zacks Consensus Estimate for NTR's full-year earnings has moved 19.2% higher. This means that analyst sentiment is stronger and the stock's earnings outlook is improving.\n\nBased on the latest available data, NTR has gained about 4.3% so far this year. At the same time, Basic Materials stocks have lost an average of 13.3%. This shows that Nutrien is outperforming its peers so far this year.\n\nAnother stock in the Basic Materials sector, SQM (SQM), has outperformed the sector so far this year. The stock's year-to-date return is 77%.\n\nIn SQM's case, the consensus EPS estimate for the current year increased 75.3% over the past three months. The stock currently has a Zacks Rank #1 (Strong Buy).\n\nLooking more specifically, Nutrien belongs to the Fertilizers industry, which includes 7 individual stocks and currently sits at #55 in the Zacks Industry Rank. On average, this group has gained an average of 17% so far this year, meaning that NTR is slightly underperforming its industry in terms of year-to-date returns. SQM is also part of the same industry.\n\nNutrien and SQM could continue their solid performance, so investors interested in Basic Materials stocks should continue to pay close attention to these stocks.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nNutrien Ltd. (NTR) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/nutrien-ntr-stock-outpacing-basic-134001178.html","symbols":["N7T.F","NTR.TO","NTR.US","QYM.F","SQM.US"],"tags":["BASIC MATERIALS","NTR","NUTRIEN","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.994,"neg":0.022,"neu":0.851,"pos":0.127}},{"date":"2022-07-20T12:01:12+00:00","title":"Best Growth Stocks to Buy for July 20th","content":"Here are three stocks with buy ranks and strong growth characteristics for investors to consider today, July 20th:\n\nSociedad Quimica y Minera SQM: This company which produces fertilizer and iodine and manufactures industrial chemicals and iodine derivative products and sells its products in over 60 countries throughout the world, carries a Zacks Rank #1(Strong Buy), and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 54.6% over the last 60 days.\n\nSociedad Quimica y Minera S.A. Price and Consensus Sociedad Quimica y Minera S.A. Price and Consensus\n\nSociedad Quimica y Minera S.A. price-consensus-chart | Sociedad Quimica y Minera S.A. Quote\n\nSociedad Quimica y Minera has a PEG ratio of 0.47 compared with 0.59 for the industry. The company possesses a Growth Score of A.\n\nSociedad Quimica y Minera S.A. PEG Ratio (TTM) Sociedad Quimica y Minera S.A. PEG Ratio (TTM)\n\nSociedad Quimica y Minera S.A. peg-ratio-ttm | Sociedad Quimica y Minera S.A. Quote\n\nGreif GEF: This company which is a leading global producer of industrial packaging products and services with manufacturing facilities located in over 40 countries, carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 17.9% over the last 60 days.\n\nGreif, Inc. Price and Consensus Greif, Inc. Price and Consensus\n\nGreif, Inc. price-consensus-chart | Greif, Inc. Quote\n\nGreif has a PEG ratio of 0.87 compared with 1.46 for the industry. The company possesses a Growth Score of B.\n\nGreif, Inc. PEG Ratio (TTM) Greif, Inc. PEG Ratio (TTM)\n\nGreif, Inc. peg-ratio-ttm | Greif, Inc. Quote\n\nICL Group ICL: This company which is engaged in the fertilizer and specialty chemical sectors and operates in segments including Fertilizers, Industrial Products and Performance Products, carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 18.0% over the last 60 days.\n\nICL Group Ltd. Price and Consensus ICL Group Ltd. Price and Consensus\n\nICL Group Ltd. price-consensus-chart | ICL Group Ltd. Quote\n\nICL Group has a PEG ratio of 0.96 compared with 0.99 for the industry. The company possesses a Growth Score of B.\n\nStory continues\n\nICL Group Ltd. PEG Ratio (TTM) ICL Group Ltd. PEG Ratio (TTM)\n\nICL Group Ltd. peg-ratio-ttm | ICL Group Ltd. Quote\n\nSee the full list of top ranked stocks here.\n\nLearn more about the Growth score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nGreif, Inc. (GEF) : Free Stock Analysis Report\r\n \r\nICL Group Ltd. (ICL) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-growth-stocks-buy-july-120112628.html","symbols":["GEF-B.US","GEF.US","QYM.F","SQM.US"],"tags":["CONSENSUS ESTIMATE","MINERA S.A","PEG RATIO","SOCIEDAD QUIMICA Y MINERA","SOCIEDAD QUIMICA Y MINERA S.A. PRICE","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.987,"neg":0,"neu":0.92,"pos":0.08}},{"date":"2022-07-13T13:35:55+00:00","title":"What Does Sociedad Química y Minera de Chile S.A.'s (NYSE:SQM) Share Price Indicate?","content":"Today we're going to take a look at the well-established Sociedad Química y Minera de Chile S.A. (NYSE:SQM). The company's stock saw a decent share price growth in the teens level on the NYSE over the last few months. With many analysts covering the large-cap stock, we may expect any price-sensitive announcements have already been factored into the stock’s share price. But what if there is still an opportunity to buy? Let’s take a look at Sociedad Química y Minera de Chile’s outlook and value based on the most recent financial data to see if the opportunity still exists.\n\nCheck out our latest analysis for Sociedad Química y Minera de Chile\n\nIs Sociedad Química y Minera de Chile still cheap?\n\nThe share price seems sensible at the moment according to my price multiple model, where I compare the company's price-to-earnings ratio to the industry average. In this instance, I’ve used the price-to-earnings (PE) ratio given that there is not enough information to reliably forecast the stock’s cash flows. I find that Sociedad Química y Minera de Chile’s ratio of 17.68x is trading slightly above its industry peers’ ratio of 15.58x, which means if you buy Sociedad Química y Minera de Chile today, you’d be paying a relatively reasonable price for it. And if you believe that Sociedad Química y Minera de Chile should be trading at this level in the long run, then there should only be a fairly immaterial downside vs other industry peers. Furthermore, it seems like Sociedad Química y Minera de Chile’s share price is quite stable, which means there may be less chances to buy low in the future now that it’s priced similarly to industry peers. This is because the stock is less volatile than the wider market given its low beta.\n\nWhat does the future of Sociedad Química y Minera de Chile look like? earnings-and-revenue-growth\n\nInvestors looking for growth in their portfolio may want to consider the prospects of a company before buying its shares. Buying a great company with a robust outlook at a cheap price is always a good investment, so let’s also take a look at the company's future expectations. Sociedad Química y Minera de Chile's earnings over the next few years are expected to double, indicating a very optimistic future ahead. This should lead to stronger cash flows, feeding into a higher share value.\n\nStory continues\n\nWhat this means for you:\n\nAre you a shareholder? SQM’s optimistic future growth appears to have been factored into the current share price, with shares trading around industry price multiples. However, there are also other important factors which we haven’t considered today, such as the track record of its management team. Have these factors changed since the last time you looked at SQM? Will you have enough conviction to buy should the price fluctuate below the industry PE ratio?\n\nAre you a potential investor? If you’ve been keeping tabs on SQM, now may not be the most optimal time to buy, given it is trading around industry price multiples. However, the optimistic forecast is encouraging for SQM, which means it’s worth further examining other factors such as the strength of its balance sheet, in order to take advantage of the next price drop.\n\nWith this in mind, we wouldn't consider investing in a stock unless we had a thorough understanding of the risks. When we did our research, we found 3 warning signs for Sociedad Química y Minera de Chile (1 makes us a bit uncomfortable!) that we believe deserve your full attention.\n\nIf you are no longer interested in Sociedad Química y Minera de Chile, you can use our free platform to see our list of over 50 other stocks with a high growth potential.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nJoin A Paid User Research Session\r\nYou’ll receive a US$30 Amazon Gift card for 1 hour of your time while helping us build better investing tools for the individual investors like yourself. Sign up here","link":"https:\/\/finance.yahoo.com\/news\/does-sociedad-qu-mica-y-133555535.html","symbols":["QYM.F","SQM.US"],"tags":["INDUSTRY PEERS","INDUSTRY PRICE","SHARE PRICE","SOCIEDAD QUíMICA Y MINERA DE CHILE"],"sentiment":{"polarity":0.998,"neg":0.023,"neu":0.842,"pos":0.135}},{"date":"2022-07-13T10:15:10+00:00","title":"Sociedad Quimica (SQM) Shares Pop 61% YTD: What's Driving It?","content":"Sociedad Quimica y Minera de Chile S.A.’s SQM shares have shot up 61.3% so far this year, outperforming the industry’s rise of 10%. The company has also topped the S&P 500’s roughly 20% decline over the same period.\r\n\r\nLet’s dive into the factors behind this Zacks Rank #1 (Strong Buy) stock’s price appreciation. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWhat’s Driving the Stock?\n\nSociedad Quimica is gaining from favorable trends in the lithium market underpinned by strong electric vehicle sales. The expansion of lithium operations is also supporting the company’s lithium sales volumes. Strong demand and limited supply are also boosting lithium prices. The company envisions global lithium market to growth at least 30% in 2022. It expects sales volumes to exceed 140,000 metric tons this year.\r\n\r\nIodine volumes are also being supported by growing demand following the post-pandemic recovery. The company also expects iodine prices to continue to rise in the coming quarters. Global potassium prices are also have been driven by the shortage of potassium-based fertilizers. This is driving prices in the company’s potassium business lines.\r\n\r\nHigher realized prices and strong demand are driving the company’s results as witnessed in the first quarter of 2022. Revenues from the company’s Lithium and Derivatives segment surged more than tenfold year over year in the first quarter, driven by strong lithium sales volumes and prices. The Specialty Plant Nutrients segment also saw a 42% increase in sales in the quarter on the back of higher prices.\r\n\r\nEarnings estimates for Sociedad Quimica have also been going up over the past two months, reflecting analysts’ optimism. The Zacks Consensus Estimate for Sociedad Quimica for 2022 has increased around 75.3%. The consensus estimate for second-quarter 2022 has also been revised roughly 120.6% upward over the same time frame.\r\n\r\nThe Zacks Consensus Estimate for earnings for 2022 for Sociedad Quimica is currently pegged at $10.71, reflecting an expected year-over-year growth of 422.4%. Earnings are also expected to register a 903.2% growth in second-quarter 2022.\n\nSociedad Quimica y Minera S.A. Price and Consensus Sociedad Quimica y Minera S.A. Price and Consensus\n\nSociedad Quimica y Minera S.A. price-consensus-chart | Sociedad Quimica y Minera S.A. Quote\n\nStocks to Consider\n\nOther top-ranked stocks worth considering in the basic materials space include Albemarle Corporation ALB, Cabot Corporation CBT and Allegheny Technologies Inc. ATI.\r\n\r\nAlbemarle has a projected earnings growth rate of 231.7% for the current year. The Zacks Consensus Estimate for ALB’s current-year earnings has been revised 26.5% upward in the past 60 days. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nAlbemarle’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 20%. ALB has gained roughly 7% in a year. The company flaunts a Zacks Rank #1.\r\n\r\nCabot, currently carrying a Zacks Rank #1, has an expected earnings growth rate of 22.5% for the current fiscal year. The Zacks Consensus Estimate for CBT's earnings for the current fiscal has been revised 2.5% upward in the past 60 days.\r\n\r\nCabot’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 16.2%. CBT has gained around 14% over a year.\r\n\r\nAllegheny, currently sporting a Zacks Rank #1, has a projected earnings growth rate of 1,046.2% for the current year. The Zacks Consensus Estimate for ATI's current-year earnings has been revised 18.3% upward in the past 60 days.\r\n\r\nAllegheny’s earnings beat the Zacks Consensus Estimate in the last four quarters. It has a trailing four-quarter earnings surprise of roughly 128.9%, on average. ATI shares are up around 8% in a year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nATI Inc. (ATI) : Free Stock Analysis Report\r\n \r\nAlbemarle Corporation (ALB) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nCabot Corporation (CBT) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/sociedad-quimica-sqm-shares-pop-101510114.html","symbols":["ALB.US","AMC.F","ATD.F","ATI.US","CBT.F","CBT.US","QYM.F","SQM.US"],"tags":["ALBEMARLE CORPORATION","CONSENSUS ESTIMATE","SOCIEDAD QUIMICA","SOCIEDAD QUIMICA Y MINERA","SOCIEDAD QUíMICA Y MINERA DE CHILE","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.997,"neg":0.012,"neu":0.864,"pos":0.124}},{"date":"2022-07-12T21:50:09+00:00","title":"SQM (SQM) Dips More Than Broader Markets: What You Should Know","content":"In the latest trading session, SQM (SQM) closed at $81.33, marking a -1.63% move from the previous day. This change lagged the S&P 500's 0.92% loss on the day. Elsewhere, the Dow lost 0.62%, while the tech-heavy Nasdaq added 0.05%.\n\nComing into today, shares of the chemicals company had lost 10.74% in the past month. In that same time, the Basic Materials sector lost 22.01%, while the S&P 500 lost 1%.\n\nInvestors will be hoping for strength from SQM as it approaches its next earnings release. On that day, SQM is projected to report earnings of $3.11 per share, which would represent year-over-year growth of 903.23%. Meanwhile, our latest consensus estimate is calling for revenue of $1.73 billion, up 194.81% from the prior-year quarter.\n\nSQM's full-year Zacks Consensus Estimates are calling for earnings of $10.71 per share and revenue of $8.51 billion. These results would represent year-over-year changes of +422.44% and +197.34%, respectively.\n\nInvestors should also note any recent changes to analyst estimates for SQM. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\n\nOur research shows that these estimate changes are directly correlated with near-term stock prices. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\n\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 34.47% higher. SQM is currently a Zacks Rank #1 (Strong Buy).\n\nDigging into valuation, SQM currently has a Forward P\/E ratio of 7.72. For comparison, its industry has an average Forward P\/E of 4.4, which means SQM is trading at a premium to the group.\n\nStory continues\n\nWe can also see that SQM currently has a PEG ratio of 0.44. This popular metric is similar to the widely-known P\/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Fertilizers was holding an average PEG ratio of 0.51 at yesterday's closing price.\n\nThe Fertilizers industry is part of the Basic Materials sector. This industry currently has a Zacks Industry Rank of 72, which puts it in the top 29% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nMake sure to utilize Zacks.com to follow all of these stock-moving metrics, and more, in the coming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/sqm-sqm-dips-more-broader-215009929.html","symbols":["GSPC.INDX","QYM.F","SQM.US"],"tags":["STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.991,"neg":0.025,"neu":0.87,"pos":0.105}},{"date":"2022-07-06T13:00:01+00:00","title":"Looking for Stocks with Positive Earnings Momentum? Check Out These 2 Basic Materials Names","content":"Wall Street watches a company's quarterly report closely to understand as much as possible about its recent performance and what to expect going forward. Of course, one figure often stands out among the rest: earnings.\n\nThe earnings figure itself is key, but a beat or miss on the bottom line can sometimes be just as, if not more, important. Therefore, investors should consider paying close attention to these earnings surprises, as a big beat can help a stock climb even higher.\n\n2 Stocks to Add to Your Watchlist\n\nThe Zacks Expected Surprise Prediction, or ESP, works by locking in on the most up-to-date analyst earnings revisions because they can be more accurate than estimates from weeks or even months before the actual release date. The thinking is pretty straightforward: analysts who provide earnings estimates closer to the report are likely to have more information. With this in mind, the Expected Surprise Prediction compares the Most Accurate Estimate (being the most recent) against the overall Zacks Consensus Estimate. The percentage difference provides the ESP figure.\n\nThe last thing we will do today, now that we have a grasp on the ESP and how powerful of a tool it can be, is to look at a qualifying stock. Celanese (CE) holds a Zacks Rank #3 at the moment and its Most Accurate Estimate comes in at $4.51 a share 22 days away from its upcoming earnings release on July 28, 2022.\n\nBy taking the percentage difference between the $4.51 Most Accurate Estimate and the $4.48 Zacks Consensus Estimate, Celanese has an Earnings ESP of 0.69%.\n\nCE is just one of a large group of Basic Materials stocks with a positive ESP figure. SQM (SQM) is another qualifying stock you may want to consider.\n\nSQM, which is readying to report earnings on August 18, 2022, sits at a Zacks Rank #1 (Strong Buy) right now. It's Most Accurate Estimate is currently $4.08 a share, and SQM is 43 days out from its next earnings report.\n\nThe Zacks Consensus Estimate for SQM is $2.75, and when you take the percentage difference between that number and its Most Accurate Estimate, you get the Earnings ESP figure of 48.5%.\n\nStory continues\n\nCE and SQM's positive ESP figures tell us that both stocks have a good chance at beating analyst expectations in their next earnings report.\n\nFind Stocks to Buy or Sell Before They're Reported\n\nUse the Zacks Earnings ESP Filter to turn up stocks with the highest probability of positively, or negatively, surprising to buy or sell before they're reported for profitable earnings season trading. Check it out here >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nCelanese Corporation (CE) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/looking-stocks-positive-earnings-momentum-130001579.html","symbols":["CE.US","DG3.F","QYM.F","SQM.US"],"tags":["ACCURATE ESTIMATE","CONSENSUS ESTIMATE","EARNINGS ESTIMATES","PERCENTAGE DIFFERENCE","QUARTERLY REPORT","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.996,"neg":0.014,"neu":0.851,"pos":0.135}},{"date":"2022-07-05T11:40:11+00:00","title":"5 High Earnings Yield Picks for 2H to Beat the Market Blues","content":"S&P 500 suffered the worst first half since 1962, with the index contracting close to 21% during the January-June 2022 period. The massive equity selloff eroded more than $9 trillion in market value in the same time frame, per Bloomberg data. The pullback was triggered by the Russia-Ukraine war, disrupted supply chain systems, sky-high inflation and rising interest rates. Stubborn inflation readings prompted the central bank to get all the more hawkish. Last month, Fed hiked interest rates by 75 bps, the highest increase since 1994. Similar hikes in the remainder of the year are not ruled out.\n\nFed Chairman Powell vowed last week that he would not let the economy slip into a higher interest rate regime even if that calls for hiking interest rates to a level that would put economic growth at risk. Recessionary fears are currently dominating the market mood and until inflation is tamed meaningfully, the problems are likely to persist.\n\nIn such turbulent times, value investing is the key. In value analysis, though price-to-earnings (P\/E) and price-to-sales (P\/S) are most preferred by investors, the underrated earnings yield ratio is also an easy-to-use valuation tool for identifying low-priced stocks with exceptional returns. Cabot Corporation CBT, Range Resources Corporation RRC, Sociedad Quimica y Minera de Chile S.A. SQM, HSBC Holdings plc HSBC and Imperial Oil Ltd. IMO are some high earnings yield value stocks.\n\nUnlock Portfolio Value Through Earnings Yield\n\nAs the global economy is struggling with skyrocketing inflation and low growth, the World Bank has warned of a recession. During times of market weakness, investors might be tempted to resort to panic selling. Contrarily, they should focus on value investing and ferret out fundamentally strong companies that are trading at a discount now. The value investing approach seeks to profit from investing in stocks that appear to be trading at a discount to their intrinsic values. Such stocks are poised to bounce back as and when investors recognize the inherent value of companies.\n\nOne interesting ratio that you can consider for picking attractively valued stocks is earnings yield. The ratio is the inverse of the price-to-earnings (P\/E) ratio and is measured as (Annual Earnings per Share\/Market Price) x 100. While comparing similar stocks, the one with higher earnings yield is more likely to provide better returns, with other factors remaining constant.\n\nEarnings Yield, in fact, has the edge over the popular P\/E ratio as the former facilitates the comparison of the performance of a market index with the 10-year Treasury yield. When the yield of the market index is more than the 10-year Treasury yield, stocks can be considered undervalued in comparison to bonds and vice versa. In such a situation, for value investors, investing in the stock market may be a better option than the bond market.\n\nHowever, it is important to remember that T-bills are risk-free, while stock investments come with a caveat. It would be a good idea to add a risk premium to the Treasury yield while comparing it with the earnings yield of a stock or the overall market.\n\nThe Winning Strategy\n\nWe have set Earnings Yield greater than 10% as our primary screening criterion but it alone cannot be used for picking stocks that have the potential of generating solid returns. So, we have added the following parameters to the screen:\n\nEstimated EPS growth for the next 12 months greater than or equal to the S&P 500: This metric compares the 12-month forward EPS estimate with the 12-month actual EPS.\n\nAverage Daily Volume (20 Day) greater than or equal to 100,000: High trading volume implies that the stock has adequate liquidity.\n\nCurrent Price greater than or equal to $5.\n\nBuy-Rated Stocks: Stocks with a Zacks Rank #1 (Strong Buy) or 2 (Buy) have been known to outperform peers in any type of market environment. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nOur Picks\n\nHere are the five of the 136 stocks that made it through the screen:\n\nCabot: Based in Boston, Cabot is a leading global specialty chemicals and performance materials company. The firm is committed to boosting its specialty compounds business globally. It is riding on several acquisitions, including NSCC Carbon black plant, Shenzhen Sanshun, and Tokai Carbon black plant among others. Healthy cash flows, balance sheet strength and shareholder-friendly moves are positives in Cabot’s story.\n\nThe Zacks Consensus Estimate for Cabot’s fiscal 2022 sales and earnings implies year-over-year growth of 23% and 22.5%, respectively. The consensus mark for EPS has moved north by 5 cents over the past 30 days. Over the trailing four quarters, Cabot surpassed earnings estimates on all occasions, with the average surprise being 16.17%. The stock currently sports a Zacks Rank #1.\n\nRange Resources: Based in Texas, Range Resources is an oil and gas explorer with extensive resources in key regions like Marcellus Shale & North Louisiana. The company is set to reap benefits in the long term from its projects in the Appalachian Basin. As most of its production comprises natural gas, RRC is well-positioned to capitalize on the mounting clean energy demand.The upstream energy firm expects free cash flow to exceed $1.4 billion this year, which could be the highest among the Appalachian players.\n\nThe Zacks Consensus Estimate for RRC’s 2022 sales and earnings implies year-over-year growth of 25% and 142%, respectively. The consensus mark for EPS has moved north by 29 cents over the past 30 days. The stock currently sports a Zacks Rank #1 and has a Value Score of A.\n\nSociedad Quimica: Chile-based Sociedad Quimica produces plant nutrients, iodine, lithium and industrial chemicals. It benefits from being a low-cost producer of potassium chloride, potassium sulfate and potassium nitrate. Higher demand also supports sales volumes in Sociedad Quimica’s specialty plant nutrition business. Rising demand is also backing the higher prices of potassium chloride. SQM is seeing a significant rise in global potassium prices, driven by the shortage of potash and potassium-based fertilizers.\n\nThe Zacks Consensus Estimate for SQM’s 2022 sales and earnings implies year-over-year growth of 165.5% and 363%, respectively. The consensus mark for EPS has moved north by $1.52 over the past 30 days. The stock currently sports a Zacks Rank #1 and has a long-term expected EPS growth rate of 17.7%,\n\nHSBC: London-based HSBC is a major global banking and financial services firm, with $3.02 trillion in assets as of Mar 31, 2022. A strong capital position, initiatives to strengthen digital capabilities, an extensive network and improvement in operating efficiency through business restructuring will likely keep aiding HSBC’s growth.Exit from the U.S. and French retail banking operations is expected to help the company focus on Asia. In sync with this, the acquisition of AXA Singapore insurance assets will expand the company's business in the region.\n\nThe Zacks Consensus Estimate for HSBC’s 2022 sales and earnings implies year-over-year growth of 4.3% and 2%, respectively. The consensus mark for EPS has moved north by 3 cents over the past 60 days. The stock currently carries a Zacks Rank #2 and has a long-term expected EPS growth rate of 21.2%,\n\nImperial Oil: Calgary-based Imperial Oil is one of the largest integrated oil companies in Canada. Strong execution and ramped-up activities in Kearl, Cold Lake and Syncrude projects position the company for solid production growth and are expected to augment its revenues and earnings going forward. Imperial Oil's strong balance sheet, ability to generate cash flow and a shareholder-friendly policy should also favor the stock.\n\nThe Zacks Consensus Estimate for Imperial Oil’s 2022 sales and earnings implies year-over-year growth of 82.2% and 177.3%, respectively. The consensus mark for EPS has moved north by 73 cents over the past 30 days.  The stock currently carries a Zacks Rank #2 and has a VGM Score of A.\n\nYou can get the rest of the stocks on this list by signing up now for a 2-week free trial to the Research Wizard stock picking and backtesting software. You can also create your own strategies and test them first before making investments.\n\nThe Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.\n\nClick here to sign up for a free trial to the Research Wizard today.\n\nDisclosure: Officers, directors and\/or employees of Zacks Investment Research may own or have sold short securities and\/or hold long and\/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and\/or hold long and\/or short positions in options that are mentioned in this material.\n\nDisclosure: Performance information for Zacks’ portfolios and strategies are available at: https:\/\/www.zacks.com\/performance.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nRange Resources Corporation (RRC) : Free Stock Analysis Report\r\n \r\nImperial Oil Limited (IMO) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nCabot Corporation (CBT) : Free Stock Analysis Report\r\n \r\nHSBC Holdings plc (HSBC) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/5-high-earnings-yield-picks-114011800.html","symbols":["0005.HK","CBT.F","CBT.US","HBC1.F","HBC1.XETRA","HBC2.F","HBCYF.US","HSBA.LSE","HSBC.US","IMO.TO","IMO.US","IMP.F","QYM.F","RAX.F","RRC.US","SQM.US"],"tags":["CABOT CORPORATION","EARNINGS YIELD","HSBC","HSBC HOLDINGS PLC","IMPERIAL OIL","INVESTING IN STOCKS","RANGE RESOURCES","SOCIEDAD QUIMICA","VALUE INVESTING"],"sentiment":{"polarity":1,"neg":0.021,"neu":0.816,"pos":0.163}},{"date":"2022-07-05T09:48:09+00:00","title":"Sociedad Quimica (SQM) Stock Up 73% in 6 Months: Here's Why","content":"Sociedad Quimica y Minera de Chile S.A.’s SQM shares have popped 72.6% over the past six months. The company has outperformed its industry’s rise of 18.6% over the same time frame. It has also topped the S&P 500’s roughly 20% decline over the same period.\r\n\r\nLet’s take a look into the factors that are driving this a Zacks Rank #1 (Strong Buy) stock. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWhat’s Favoring SQM?\n\nSociedad Quimica is benefiting from being the low-cost producer of potassium chloride, potassium sulfate and potassium nitrate. Higher realized prices and strong demand are driving its results as witnessed in the first quarter of 2022.\r\n\r\nRevenues from the company’s Lithium and Derivatives segment surged more than tenfold year over year in the first quarter, driven by strong lithium sales volumes and prices. The Specialty Plant Nutrients segment also saw a 42% increase in sales in the quarter on the back of higher prices.\r\n\r\nSociedad Quimica is gaining from favorable trends in the lithium market underpinned by strong electric vehicle sales. The expansion of lithium operations is also supporting the company’s lithium sales volumes. Strong demand and limited supply are also boosting lithium prices. The company envisions global lithium market to growth at least 30% in 2022. It expects sales volumes to exceed 140,000 metric tons this year.\r\n\r\nIodine volumes are also being supported by growing demand following the post-pandemic recovery. The company also expects iodine prices to continue to rise in the coming quarters. Global potassium prices are also have been driven by the shortage of potassium-based fertilizers. This is driving prices in the company’s potassium business lines.\r\n\r\nEarnings estimates for Sociedad Quimica have also been going up over the past two months, reflecting analysts’ optimism. The Zacks Consensus Estimate for Sociedad Quimica for 2022 has increased around 55%. The consensus estimate for second-quarter 2022 has also been revised roughly 95% upward over the same time frame.\r\n\r\nThe Zacks Consensus Estimate for earnings for 2022 for Sociedad Quimica is currently pegged at $9.49, reflecting an expected year-over-year growth of 362.9%. Earnings are also expected to register a 787.1% growth in second-quarter 2022.\n\nSociedad Quimica y Minera S.A. Price and Consensus Sociedad Quimica y Minera S.A. Price and Consensus\n\nSociedad Quimica y Minera S.A. price-consensus-chart | Sociedad Quimica y Minera S.A. Quote\n\nStocks to Consider\n\nOther top-ranked stocks worth considering in the basic materials space include Albemarle Corporation ALB, Cabot Corporation CBT and Allegheny Technologies Inc. ATI.\r\n\r\nAlbemarle has a projected earnings growth rate of 231.7% for the current year. The Zacks Consensus Estimate for ALB’s current-year earnings has been revised 112.4% upward in the past 60 days. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nAlbemarle’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 20%. ALB has rallied roughly 22% in a year. The company flaunts a Zacks Rank #1.\r\n\r\nCabot, currently carrying a Zacks Rank #1, has an expected earnings growth rate of 22.5% for the current fiscal year. The Zacks Consensus Estimate for CBT's earnings for the current fiscal has been revised 6% upward in the past 60 days.\r\n\r\nCabot’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 16.2%. CBT has gained around 13% over a year.\r\n\r\nAllegheny has a projected earnings growth rate of 1,076.9% for the current year. The Zacks Consensus Estimate for ATI's current-year earnings has been revised 40.4% upward in the past 60 days.\r\n\r\nAllegheny’s earnings beat the Zacks Consensus Estimate in the last four quarters. It has a trailing four-quarter earnings surprise of roughly 128.9%, on average. ATI has gained around 10% in a year and currently sports a Zacks Rank #1.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nAllegheny Technologies Incorporated (ATI) : Free Stock Analysis Report\r\n \r\nAlbemarle Corporation (ALB) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nCabot Corporation (CBT) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/sociedad-quimica-sqm-stock-73-094809178.html","symbols":["ALB.US","AMC.F","ATD.F","ATI.US","CBT.F","CBT.US","QYM.F","SQM.US"],"tags":["ALBEMARLE CORPORATION","CONSENSUS ESTIMATE","SOCIEDAD QUIMICA","SOCIEDAD QUIMICA Y MINERA","SOCIEDAD QUíMICA Y MINERA DE CHILE","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.997,"neg":0.012,"neu":0.872,"pos":0.117}},{"date":"2022-06-30T21:50:09+00:00","title":"SQM (SQM) Dips More Than Broader Markets: What You Should Know","content":"SQM (SQM) closed the most recent trading day at $83.53, moving -0.91% from the previous trading session. This change lagged the S&P 500's daily loss of 0.88%. Meanwhile, the Dow lost 0.82%, and the Nasdaq, a tech-heavy index, added 0.08%.\n\nHeading into today, shares of the chemicals company had lost 16.32% over the past month, outpacing the Basic Materials sector's loss of 16.65% and lagging the S&P 500's loss of 8.06% in that time.\n\nWall Street will be looking for positivity from SQM as it approaches its next earnings report date. On that day, SQM is projected to report earnings of $2.75 per share, which would represent year-over-year growth of 787.1%. Our most recent consensus estimate is calling for quarterly revenue of $1.71 billion, up 190.8% from the year-ago period.\n\nFor the full year, our Zacks Consensus Estimates are projecting earnings of $9.49 per share and revenue of $7.6 billion, which would represent changes of +362.93% and +165.55%, respectively, from the prior year.\n\nAny recent changes to analyst estimates for SQM should also be noted by investors. These revisions typically reflect the latest short-term business trends, which can change frequently. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\n\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\n\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 19.08% higher. SQM is currently sporting a Zacks Rank of #1 (Strong Buy).\n\nInvestors should also note SQM's current valuation metrics, including its Forward P\/E ratio of 8.89. This represents a premium compared to its industry's average Forward P\/E of 4.81.\n\nStory continues\n\nAlso, we should mention that SQM has a PEG ratio of 0.5. This popular metric is similar to the widely-known P\/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. SQM's industry had an average PEG ratio of 0.56 as of yesterday's close.\n\nThe Fertilizers industry is part of the Basic Materials sector. This group has a Zacks Industry Rank of 17, putting it in the top 7% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nBe sure to follow all of these stock-moving metrics, and many more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/sqm-sqm-dips-more-broader-215009276.html","symbols":["QYM.F","SQM.US"],"tags":["ESTIMATE REVISIONS","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.989,"neg":0.029,"neu":0.871,"pos":0.1}},{"date":"2022-06-28T12:12:45+00:00","title":"Those who invested in Sociedad Química y Minera de Chile (NYSE:SQM) three years ago are up 230%","content":"Sociedad Química y Minera de Chile S.A. (NYSE:SQM) shareholders have seen the share price descend 18% over the month. But that doesn't change the fact that the returns over the last three years have been very strong. In fact, the share price is up a full 203% compared to three years ago. After a run like that some may not be surprised to see prices moderate. The thing to consider is whether the underlying business is doing well enough to support the current price.\n\nLet's take a look at the underlying fundamentals over the longer term, and see if they've been consistent with shareholders returns.\n\nSee our latest analysis for Sociedad Química y Minera de Chile\n\nWhile the efficient markets hypothesis continues to be taught by some, it has been proven that markets are over-reactive dynamic systems, and investors are not always rational. By comparing earnings per share (EPS) and share price changes over time, we can get a feel for how investor attitudes to a company have morphed over time.\n\nSociedad Química y Minera de Chile was able to grow its EPS at 44% per year over three years, sending the share price higher. This EPS growth is remarkably close to the 45% average annual increase in the share price. This suggests that sentiment and expectations have not changed drastically. Au contraire, the share price change has arguably mimicked the EPS growth.\n\nThe graphic below depicts how EPS has changed over time (unveil the exact values by clicking on the image). earnings-per-share-growth\n\nIt is of course excellent to see how Sociedad Química y Minera de Chile has grown profits over the years, but the future is more important for shareholders. It might be well worthwhile taking a look at our freereport on how its financial position has changed over time.\n\nWhat About Dividends?\n\nAs well as measuring the share price return, investors should also consider the total shareholder return (TSR). The TSR incorporates the value of any spin-offs or discounted capital raisings, along with any dividends, based on the assumption that the dividends are reinvested. Arguably, the TSR gives a more comprehensive picture of the return generated by a stock. In the case of Sociedad Química y Minera de Chile, it has a TSR of 230% for the last 3 years. That exceeds its share price return that we previously mentioned. The dividends paid by the company have thusly boosted the total shareholder return.\n\nStory continues\n\nA Different Perspective\n\nWe're pleased to report that Sociedad Química y Minera de Chile shareholders have received a total shareholder return of 105% over one year. And that does include the dividend. That's better than the annualised return of 26% over half a decade, implying that the company is doing better recently. Someone with an optimistic perspective could view the recent improvement in TSR as indicating that the business itself is getting better with time. It's always interesting to track share price performance over the longer term. But to understand Sociedad Química y Minera de Chile better, we need to consider many other factors. To that end, you should be aware of the  2 warning signs  we've spotted with Sociedad Química y Minera de Chile .\n\nIf you would prefer to check out another company -- one with potentially superior financials -- then do not miss this freelist of companies that have proven they can grow earnings.\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on US exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.","link":"https:\/\/finance.yahoo.com\/news\/those-invested-sociedad-qu-mica-121245334.html","symbols":["QYM.F","SQM.US"],"tags":["SHARE PRICE","SOCIEDAD QUíMICA Y MINERA DE CHILE","TOTAL SHAREHOLDER RETURN","TSR"],"sentiment":{"polarity":0.998,"neg":0.016,"neu":0.842,"pos":0.142}},{"date":"2022-06-23T11:43:11+00:00","title":"Here's Why You Should Buy Sociedad Quimica (SQM) Stock Right Now","content":"Sociedad Quimica y Minera de Chile S.A.’s SQM stock looks promising at the moment. The company’s shares have soared roughly 80% over the past six months. It is benefiting from higher prices across its business lines and healthy demand.\r\n\r\nWe are positive on the company’s prospects and believe that the time is right for you to add the stock to the portfolio as it looks promising and is poised to carry the momentum ahead.\r\n\r\nSociedad Quimica carries a Zacks Rank #1 (Strong Buy) and a VGM Score of B. Our research shows that stocks with a VGM Score of A or B, combined with a Zacks Rank #1 or 2 (Buy), offer the best investment opportunities for investors.\r\n\r\nLet’s take a look into the factors that make Sociedad Quimica an attractive choice for investors right now.\n\nPrice Performance\n\nShares of Sociedad Quimica have surged 93.9% over the past year against the 46.2% rise of its industry. It has also outperformed the S&P 500’s roughly 11.3% decline over the same period. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nEstimates Northbound\n\nOver the past two months, the Zacks Consensus Estimate for Sociedad Quimica for 2022 has increased around 55%. The consensus estimate for second-quarter 2022 has also been revised roughly 95% upward over the same time frame. The favorable estimate revisions instill investor confidence in the stock.\n\nSolid Growth Prospects\n\nThe Zacks Consensus Estimate for earnings for 2022 for Sociedad Quimica is currently pegged at $9.49, reflecting an expected year-over-year growth of 362.9%. Earnings are also expected to register a 787.1% growth in second-quarter 2022.\n\nUpbeat Prospects\n\nSociedad Quimica is benefiting from being the low-cost producer of potassium chloride, potassium sulfate and potassium nitrate. Higher realized prices and strong demand are driving its results as witnessed in the first quarter of 2022.\r\n\r\nRevenues from the company’s Lithium and Derivatives segment surged more than tenfold year over year in the first quarter, driven by strong lithium sales volumes and prices. The Specialty Plant Nutrients segment also saw a 42% increase in sales in the quarter on the back of higher prices.\r\n\r\nSociedad Quimica is gaining from favorable trends in the lithium market underpinned by strong electric vehicle sales. The expansion of lithium operations is also supporting the company’s lithium sales volumes. Strong demand and limited supply are also boosting lithium prices. The company envisions global lithium market to growth at least 30% in 2022. It expects sales volumes to exceed 140,000 metric tons this year.\r\n\r\nIodine volumes are also being supported by growing demand following the post-pandemic recovery. The company also expects iodine prices to continue to rise in the coming quarters. Global potassium prices are also have been driven by the shortage of potassium-based fertilizers. This is driving prices in the company’s potassium business lines.\n\nStory continues\n\nSociedad Quimica y Minera S.A. Price and Consensus Sociedad Quimica y Minera S.A. Price and Consensus\n\nSociedad Quimica y Minera S.A. price-consensus-chart | Sociedad Quimica y Minera S.A. Quote\n\nStocks to Consider\n\nOther top-ranked stocks worth considering in the basic materials space include Nutrien Ltd. NTR, Albemarle Corporation ALB and Cabot Corporation CBT.\r\n\r\nNutrien, sporting a Zacks Rank #1, has an expected earnings growth rate of 174.6% for the current year. The Zacks Consensus Estimate for NTR's current-year earnings has been revised 22.9% upward over the last 60 days. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nNutrien beat the Zacks Consensus Estimate for earnings in three of the last four quarters while missed once. It has a trailing four-quarter earnings surprise of roughly 5.8%, on average. NTR has rallied roughly 42% in a year.\r\n\r\nAlbemarle has a projected earnings growth rate of 231.7% for the current year. The Zacks Consensus Estimate for ALB’s current-year earnings has been revised 116.1% upward in the past 60 days.\r\n\r\nAlbemarle’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 22.5%. ALB has rallied roughly 30% in a year. The company flaunts a Zacks Rank #1.\r\n\r\nCabot, currently carrying a Zacks Rank #1, has an expected earnings growth rate of 22.5% for the current fiscal year. The Zacks Consensus Estimate for CBT's earnings for the current fiscal has been revised 6% upward in the past 60 days.\r\n\r\nCabot’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average being 16.2%. CBT has gained around 9% over a year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/heres-why-buy-sociedad-quimica-114311615.html","symbols":["ALB.US","AMC.F","CBT.F","CBT.US","N7T.F","NTR.TO","NTR.US","QYM.F","SQM.US"],"tags":["CONSENSUS ESTIMATE","SOCIEDAD QUIMICA","SOCIEDAD QUIMICA Y MINERA","SOCIEDAD QUíMICA Y MINERA DE CHILE","STRONG BUY","ZACKS CONSENSUS ESTIMATE","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.998,"neg":0.015,"neu":0.857,"pos":0.129}},{"date":"2022-06-21T18:16:51+00:00","title":"IBD Stock Of The Day: Lithium Play SQM Springs Bullishly Off Key Level","content":"SQM, or Sociedad Quimica y Minera de Chile, is IBD Stock Of The Day as the lithium play revs up output faster than rivals.","link":"https:\/\/finance.yahoo.com\/m\/9d4fd859-f4f2-3992-a11a-f42cb4c08a93\/ibd-stock-of-the-day%3A-lithium.html","symbols":["QYM.F","SQM.US"],"tags":["CF INDUSTRIES","LITHIUM CARBONATE","LITHIUM HYDROXIDE","SQM STOCK","STOCK MARKET"],"sentiment":{"polarity":0.34,"neg":0,"neu":0.902,"pos":0.098}},{"date":"2022-06-17T12:45:17+00:00","title":"7 Lithium Stocks to Sell if You Believe the Boom Is Over","content":"Top investment bank Goldman Sachs believes that the bull market for lithium is over. The bank sees prices on a downward trajectory for the next couple of years, with a substantial correction from today’s levels.\n\nMoreover, it is of the view that today’s lithium prices are a “fundamental mispricing [that] has, in turn, generated an outsized supply response well ahead of the demand trend in focus.” Consequently, the report led to a selloff in lithium stocks with massive losses across the board.\n\n7 Tempting Tech Stocks to Pull the Trigger on Now\n\nIt is imperative to understand that the macro-economic elements weakening the outlook on stocks will subside at some point. However, with lower demand, the demand for materials needed, including lithium, is dropping at an incredible pace. Therefore, here are seven lithium stocks you should probably avoid now.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nPLL Piedmont Lithium $49.27 CBAT CBAK Energy Technology $1.03 SLI Standard Lithium $3.9 LIACF American Lithium $1.415 TSLA Tesla $628.84 ALB Albemarle Corporation $199.33 SQM Sociedad Quimica y Minera de Chile $87.57\n\nPiedmont Lithium (PLL)  Graphic of Lithium scientific symbol (Li) in the shape of a big white gear with construction equipment and mountain around it\n\nSource: GrAl \/ Shutterstock.com\n\nPiedmont Lithium (NASDAQ:PLL) aims to become an integrated lithium producer but might wind up being nothing more of a lithium processor.\n\nIts primary project is located in Gaston County, North Carolina, where it expects to produce roughly 30,000 metric tons of lithium hydroxide from more than 200,000 tons of spodumene each year. However, Piedmont’s regulatory troubles have gotten it in hot water, which cast a shadow of uncertainty on its future.\n\nThe company doesn’t have permits for its project from either the state or the local government. Moreover, it faces strong opposition from the Gaston County Board, which is responsible for granting permission to develop the mine. Despite everything hanging in the balance, PLL stock trades at a lofty valuation.\n\nStory continues\n\nCBAK Energy Technology (CBAT) A magnifying glass zooms in on the website for CBAK Energy Technology (CBAT)\n\nSource: Pavel Kapysh \/ Shutterstock.com\n\nCBAK Energy Technology (NASDAQ:CBAT) is an EV lithium-ion battery producer in Mainland China. The market is remarkably competitive, full of smaller competitors that continue gobbling up CBAK’s market share.\n\nMoreover, the company’s clientele market share is limited to a few customers, which account for over 50% of its sales. Hence, losing one customer will result in a huge blow to its fundamentals. Additionally, our stock has fallen out of favor with its investors, having shed over 70% of its value in the past 12 months.\n\nRecently, CBAK announced its acquisition of a troubled battery materials supplier in Hitrans Lithium Battery Technology. CBAK claims that Hirans generated roughly four times its revenues during the first nine months of last year.\n\n7 Unstoppable Stocks to Own in 2022\n\nHowever, filings have shown that the acquired company’s financials are extremely weak, with large cash deficits. Hence, with plenty of uncertainties surrounding its business, CBAK stock remains a highly risky bet in its sector.\n\nLithium Stocks: Standard Lithium (SLI) a pile of lithium. Lithium Stocks\n\nSource: Bjoern Wylezich\/ShutterStock.com\n\nStandard Lithium (NYSEAMERICAN:SLI) develops extraction technologies that can effectively utilize bromine extraction infrastructure to produce battery-ready lithium salts.\n\nThough it’s still early days in the development of its plant, there is significant potential for creating a massive lithium source down the line.\n\nStrong evidence supports the need for Lithium due to the proliferation of EVs and battery storage. Therefore, the risk lies in its execution abilities and production process. SLI expects a whopping $1 billion in capital expenditures based on $4 billion in project returns.\n\nFeasibility information is lacking, which has led to massive uncertainty surrounding the stock. Moreover, it only has $100 million in cash at this time, which points to future dilution and debt increases.\n\nAmerican Lithium (LIACF) lithium (LI) on the periodic table. Lithium Stocks\n\nSource: Shutterstock\n\nAmerican Lithium (OTCMKTS:LIACF) focuses on developing leading lithium projects in the Americas. It’s a penny stock that gained incredibly in 2020 from multiple catalysts.\n\nHowever, the movement in stock price wasn’t related to the company fundamentals. The company is a pre-revenue business that needs constant cash flow injections to stay afloat. Naturally, it could pay off in the long run if it hits big in the coming years. However, the chances of its success seem minimal at this time.\n\nLithium demand is expected to rise at a staggering pace over the next several years. Analysts at McKinsey report that demand for lithium could rise from an estimated 500,000 metric tons in 2021 to three to four million metric tons by 2030.\n\n7 Nasdaq Stocks to Buy and Hold Forever\n\nHence, American Lithium and other lithium producers will continue to float up and down regardless of their competencies and quality of fundamentals.\n\nLithium Stocks: Tesla (TSLA) Tesla, Inc. (TSLA) logo displayed on a phone in front of a blurred image of Elon Musk\n\nSource: Rokas Tenys \/ Shutterstock.com\n\nTesla (NASDAQ:TSLA) is an O.G. in the EV sector which has also been the most successful business in the burgeoning niche.\n\nUnlike several EV start-ups that have emerged over the past couple of years, it’s a business that continues to thrive and is delivering real cars to real people. Its fundamentals are impressive from top to bottom, and have kicked into overdrive of late.\n\nWith the rising metal prices, Elon Musk recently tweeted about Tesla getting into the lithium mining and refining business. Musk said that though there is no shortage of lithium, the pace of refinement is slow. Moreover, the “Price of lithium has gone to insane levels.” It remains to be seen how successful the business might turn out to be in terms of improving supply and limiting costs.\n\nNevertheless, TSLA stock’s meteoric price remains a bone of contention, with it trading over 50 times enterprise value to EBITDA.\n\nAlbemarle Corporation (ALB) Albemarle (ALB) logo on a mobile phone screen\n\nSource: IgorGolovniov\/Shutterstock.com\n\nAlbemarle Corporation (NYSE:ALB) is a leading lithium conglomerate business that has been one of the most consistent performers in its niche. Its operations are highly diversified from a geographic standpoint, which gives it the edge over its competition.\n\nMoreover, the variety of locations it operates in gives it a unique advantage in dealing with different governments.  The stability of its business is linked to the stability of its mines, which has plenty to do ALB’s relationship with various governments.  Nevertheless, it has established itself as a juggernaut in the sector, and it’s in the best position to capitalize on the demand for lithium.\n\n7 Great Dividend Stocks Under $25\n\nThere are, however, plenty of risks to consider with ALB stock. Firstly, it trades at a nosebleed valuation of 4.70 times forward sales estimates. Moreover, it is always at the mercy of governments and institutions, which could significantly hamper its business.\n\nLithium Stocks: Sociedad Quimica y Minera de Chile (SQM) Sociedad Quimica y Minera (SQM) logo displayed on a mobile phone with the company's web page on it. Lithium Stocks\n\nSource: madamF \/ Shutterstock.com\n\nSociedad Quimica y Minera de Chile (NYSE:SQM) is a specialty chemicals company involved in producing and distributing plant nutrients and derivatives. Its nutrients and minerals are in use for various applications, including batteries and lithium derivatives. Moreover, it’s been a top performer in the sector, growing sales and EBITDA by over 100% on a year-over-year basis.\n\nThough there’s plenty to like about SQM, Chilean lithium faces immense political risks. Social Convergence, a left-leaning party, recently won the elections in Chile, and the parliament subsequently voted to repeal the current constitution.\n\nSQM enjoyed a privileged position under the old constitution. The consensus is that the new Chilean government will be looking to nationalize the production of copper and lithium. If that’s the case, then SQM and its stockholders could be in a world of trouble.\n\nOn the date of publication, Muslim Farooque did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMore From InvestorPlace\n\n$200 Oil Sooner Than You Think – Buy This Now Stock Prodigy Who Found NIO at $2… Says Buy THIS Early Bitcoin Millionaire Reveals His Next Big Crypto Trade “On Air” It doesn’t matter if you have $500 in savings or $5 million. Do this now.\n\nThe post 7 Lithium Stocks to Sell if You Believe the Boom Is Over appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/7-lithium-stocks-sell-believe-124517092.html","symbols":["5LA1.F","ALB.US","AMC.F","CBAT.US","LI.V","LIACF.US","PLL.AU","PLL.US","QYM.F","SQM.US","TSLA.US"],"tags":["ALBEMARLE CORPORATION","AMERICAN LITHIUM","CBAK ENERGY TECHNOLOGY","LITHIUM HYDROXIDE","LITHIUM STOCKS","PIEDMONT LITHIUM","SOCIEDAD QUíMICA Y MINERA DE CHILE","STANDARD LITHIUM"],"sentiment":{"polarity":0.997,"neg":0.053,"neu":0.854,"pos":0.093}},{"date":"2022-06-10T11:01:27+00:00","title":"Sociedad Química y Minera de Chile (NYSE:SQM) Could Easily Take On More Debt","content":"Warren Buffett famously said, 'Volatility is far from synonymous with risk.' So it seems the smart money knows that debt - which is usually involved in bankruptcies - is a very important factor, when you assess how risky a company is. Importantly, Sociedad Química y Minera de Chile S.A. (NYSE:SQM) does carry debt. But the real question is whether this debt is making the company risky.\n\nWhen Is Debt Dangerous?\n\nDebt is a tool to help businesses grow, but if a business is incapable of paying off its lenders, then it exists at their mercy. In the worst case scenario, a company can go bankrupt if it cannot pay its creditors. However, a more common (but still painful) scenario is that it has to raise new equity capital at a low price, thus permanently diluting shareholders. Of course, debt can be an important tool in businesses, particularly capital heavy businesses. The first step when considering a company's debt levels is to consider its cash and debt together.\n\nCheck out our latest analysis for Sociedad Química y Minera de Chile\n\nWhat Is Sociedad Química y Minera de Chile's Debt?\n\nYou can click the graphic below for the historical numbers, but it shows that as of March 2022 Sociedad Química y Minera de Chile had US$2.62b of debt, an increase on US$1.94b, over one year. However, it does have US$3.29b in cash offsetting this, leading to net cash of US$670.5m. debt-equity-history-analysis\n\nHow Healthy Is Sociedad Química y Minera de Chile's Balance Sheet?\n\nZooming in on the latest balance sheet data, we can see that Sociedad Química y Minera de Chile had liabilities of US$2.49b due within 12 months and liabilities of US$2.77b due beyond that. Offsetting these obligations, it had cash of US$3.29b as well as receivables valued at US$1.19b due within 12 months. So its liabilities outweigh the sum of its cash and (near-term) receivables by US$780.4m.\n\nGiven Sociedad Química y Minera de Chile has a humongous market capitalization of US$27.4b, it's hard to believe these liabilities pose much threat. Having said that, it's clear that we should continue to monitor its balance sheet, lest it change for the worse. Despite its noteworthy liabilities, Sociedad Química y Minera de Chile boasts net cash, so it's fair to say it does not have a heavy debt load!\n\nStory continues\n\nEven more impressive was the fact that Sociedad Química y Minera de Chile grew its EBIT by 391% over twelve months. That boost will make it even easier to pay down debt going forward. There's no doubt that we learn most about debt from the balance sheet. But ultimately the future profitability of the business will decide if Sociedad Química y Minera de Chile can strengthen its balance sheet over time. So if you want to see what the professionals think, you might find this free report on analyst profit forecasts to be interesting.\n\nFinally, a business needs free cash flow to pay off debt; accounting profits just don't cut it. Sociedad Química y Minera de Chile may have net cash on the balance sheet, but it is still interesting to look at how well the business converts its earnings before interest and tax (EBIT) to free cash flow, because that will influence both its need for, and its capacity to manage debt. Looking at the most recent three years, Sociedad Química y Minera de Chile recorded free cash flow of 43% of its EBIT, which is weaker than we'd expect. That weak cash conversion makes it more difficult to handle indebtedness.\n\nSumming up\n\nWe could understand if investors are concerned about Sociedad Química y Minera de Chile's liabilities, but we can be reassured by the fact it has has net cash of US$670.5m. And it impressed us with its EBIT growth of 391% over the last year. So is Sociedad Química y Minera de Chile's debt a risk? It doesn't seem so to us. The balance sheet is clearly the area to focus on when you are analysing debt. But ultimately, every company can contain risks that exist outside of the balance sheet.  We've identified 4 warning signs  with Sociedad Química y Minera de Chile (at least 1 which is concerning)  , and understanding them should be part of your investment process.\n\nAt the end of the day, it's often better to focus on companies that are free from net debt. You can access our special list of such companies (all with a track record of profit growth). It's free.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.","link":"https:\/\/finance.yahoo.com\/news\/sociedad-qu-mica-y-minera-110127664.html","symbols":["QYM.F","SQM.US"],"tags":["BALANCE SHEET","SOCIEDAD QUíMICA Y MINERA DE CHILE"],"sentiment":{"polarity":0.913,"neg":0.123,"neu":0.749,"pos":0.129}},{"date":"2022-06-08T16:07:27+00:00","title":"7 Top-Rated Large-Cap Stocks to Buy and Hold","content":"A time of challenging market conditions (like we’re seeing today) can be a frustrating time to invest. There is, however, a silver lining. A market downturn is a great opportunity to load up on high-quality names. For example, large-cap stocks with strong fundamentals.\n\nWhen stocks overall move lower, that’s the case for both more speculative plays, as well as sturdier opportunities. The latter may not experience as sharp of a plunge as the former. In fact, some of them, like commodities stocks, can perform well, as rising commodities prices outweigh external factors. Still, if you have a long time horizon in mind, you can enter\/add to a position at an ideal price point.\n\n7 Blue-Chip Stocks to Buy for June 2022\n\nSo, what are some examples of such plays? Consider these seven top-rated, large-cap stocks. Each one has the potential to deliver solid returns (via appreciation and dividends) for buy and hold investors.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nTicker Company Current Price CF CF Industries Holdings $91.19 DLTR Dollar Tree $162.51 HSY Hershey Company $211.74 KR Kroger Co. $51.61 OXY Occidental Petroleum $69.87 PAYX Paychex $125.68 SQM Sociedad Quimica Y Minera De Chile S.A. $100.22\n\nCF Industries Holdings (CF)\n\nCF Industries Holdings (NYSE:CF) is a good example of what I was talking about above. Thanks to a boom in commodities prices (in its case, fertilizer), shares are up sharply in what has so far been a down year for stocks.\n\nAs the Russia\/Ukraine conflict has slashed supply of key fertilizer ingredients like ammonia, nitrogen and urea, it’s no surprise CF stock surged earlier this year. More recently, it has been trading sideways, as investors factor in a pullback in spot fertilizer prices. Yet that doesn’t mean CF Industries’ key tailwind is about to bust out.\n\nEven if prices fall from their highs, they’re expected to remain elevated compared to prior year levels. This bodes well for the stock, as it today trades at a heavily discounted valuation (5x estimated 2022 earnings). An established name in this space, it stands to continue to perform well, during today’s boom, and beyond.\n\nStory continues\n\nThis stock earns an “A” rating in my Portfolio Grader.\n\nDollar Tree (DLTR)\n\nLike other stocks in the space, shares in discount retailer Dollar Tree (NASDAQ:DLTR) plunged in mid-May, following underwhelming earnings reports from two of its peers.\n\nHowever, within a week, DLTR stock completely bounced back. The reason? Its strong quarterly earnings report. Reporting strong revenue and earnings growth, demonstrating the market’s fears of inflationary pressures affecting its performance were an overreaction. What does this short-term boost have to do with its bona fides as a long-term buy-and-hold play?\n\nLike some other high-quality discount retailers, it’s thriving despite the challenges presented by today’s high rates of inflation. As this factor has little-to-no impact on its growth, Dollar Tree is well positioned to continue steadily increasing its revenue and earnings. This will enable the stock to continue delivering solid returns. With this, consider it one of the best large-cap stocks out there to make a long-term position.\n\n7 Solar Stocks to Buy and Hold for a Bright Future\n\nThis stock earns an “A” rating in my Portfolio Grader.\n\nHershey Company (HSY)\n\nHershey Company (NYSE:HSY) is a defensive play, with a deep economic moat. It also pays out a steady dividend (forward yield of 1.72%), a payout that has gone up twelve years in a row. All these factors make it the kind of stock you want to own in a down market.\n\nThese safe harbor bona fides also explain why HSY stock is up for the year. In the move to “risk off,” investors have pivoted to venerable names like this one. It also helps that the confectionary giant has also done a great job of adjusting to the impact of rising raw material, labor and transport costs.\n\nWith demand staying robust, despite it passing along costs to the consumer, Hershey raised its full-year sales and earnings forecast in April. More resistant to today’s economic challenges than many other stocks (including some other packaged goods stocks), consider it a buy.\n\nThis stock earns an “A” rating in my Portfolio Grader.\n\nKroger (KR)\n\nGrocery chain operator Kroger (NYSE:KR) is yet another high-quality, large-cap stock that has performed well in 2022. Even after a pullback last month, it’s up around 14.5% year-to-date.\n\nSpeaking of its pullback, the May selloff in KR stock should be seen as a buying opportunity. Why? Its drop was entirely due to the downward pressure put on retailer stocks following the bad quarterly numbers for two large retailers that I referenced above when talking about Dollar Tree.\n\nAlthough Kroger hasn’t yet reported earnings, the sell-side has raised its earnings forecast in recent months. This suggests the company will show, like it did last quarter, that high inflation is not affecting its performance, like it is for other retailers. Only partially bouncing back in recent weeks, you may want to take advantage of this weakness, by starting to accumulate a long-term position in the stock.\n\n7 Blue-Chip Stocks to Buy Now if You Have $250 to Spend\n\nThis stock earns an “A” rating in my Portfolio Grader.\n\nOccidental Petroleum (OXY)\n\nThe sharp rise in oil prices, plus Warren Buffett’s big purchase of shares, have resulted in an epic run for Occidental Petroleum (NYSE:OXY) so far this year. It’s up 125% year-to-date.\n\nHowever, don’t take this to mean you’ve “missed out” on this opportunity. This remains one of the best large-cap stocks out there to make a long-term holding. Why? There are many factors, not just Russia’s invasion of Ukraine, that are behind the spiking of crude oil prices. Prices could stay elevated for longer than expected.\n\nLong-term, there’s something else (not talked about that much) that could mean continued growth for OXY stock. That would be its move into “net-zero” oil. Moving into this area could pay off down the road, if stricter environmental regulations require its use. Benefiting from high oil prices, and with a “green” catalyst hiding in plain sight, it’s a buy.\n\nThis stock earns an “A” rating in my Portfolio Grader.\n\nPaychex (PAYX)\n\nIn contrast to many of the large-cap stocks listed above, Paychex (NASDAQ:PAYX) shares are in the red for 2022, down over 6%. Recession fears are likely putting pressure on this payroll, benefits and HR outsourcing company. After all, recessions mean lower employment, hence lower demand for its services.\n\nBut it’s possible investors are too pessimistic. Providing back office services is essential for the operation of a small or medium-sized enterprise. An economic downturn shouldn’t have an outsized impact on its operating performance.\n\nPAYX stock also has a relatively high dividend (forward yield of 2.58%). Raising its dividend 8 years in a row, over the past five years it has raised its dividend by an average of 8.53% per year. This stock offers a lot for buy-and-hold investors. It provides a steady return through its dividend. In the years ahead, it could also benefit from steady price appreciation.\n\n7 Oversold Stocks to Buy Right Now\n\nThis stock earns an “A” rating in my Portfolio Grader.\n\nSociedad Quimica Y Minera De Chile (SQM)\n\nSociedad Quimica Y Minera De Chile (NYSE:SQM), or SQM for short, is a Chilean fertilizer and mining company. Saying it has been firing on all cylinders lately is an understatement. The company has not only benefited from the boom in fertilizer prices.\n\nA major lithium supplier, it has been benefiting from strong demand, due to its use in the production of electric vehicle (EV) batteries. As a result, its earnings are up substantially. So too, is its stock price. SQM stock is up around 96% since January, and up 112% over the past twelve months.\n\nAfter another big spike late last month, SQM has pulled back. Further weakness may be ahead. However, it has long-term catalysts like the lithium boom on its side. Coupled with a low valuation (forward earnings multiple of 8.8x), and an above-average dividend (4.57%), long-term investors may want to start slowly building up a position.\n\nThis stock earns an “A” rating in my Portfolio Grader.\n\nOn the date of publication, Louis Navellier has positions in CF, KR, and SQM in this article. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article.\n\nThe InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article.\n\nMore From InvestorPlace\n\nStock Prodigy Who Found NIO at $2… Says Buy THIS It doesn’t matter if you have $500 in savings or $5 million. Do this now.  Get in Now on Tiny $3 ‘Forever Battery’ Stock Early Bitcoin Millionaire Reveals His Next Big Crypto Trade “On Air”\n\nThe post 7 Top-Rated Large-Cap Stocks to Buy and Hold appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/7-top-rated-large-cap-160727414.html","symbols":["C4F.F","CF.US","DLTR.MX","DLTR.US","DT3.F","HSY.F","HSY.US","KOG.F","KR.US","OPC.F","OPC.XETRA","OXY.US"],"tags":["COMMODITIES PRICES","DOLLAR TREE","HERSHEY COMPANY","INDUSTRIES HOLDINGS","OCCIDENTAL PETROLEUM","OIL PRICES","QUIMICA Y MINERA DE CHILE"],"sentiment":{"polarity":0.998,"neg":0.039,"neu":0.862,"pos":0.099}},{"date":"2022-06-03T15:27:03+00:00","title":"Zacks.com featured highlights include Driven, Carlisle Companies, Avis, Sociedad Quimica y Minera, and Tenaris","content":"For Immediate Release\n\nChicago, IL – June 3, 2022 – Stocks in this week’s article are Driven Brands Holdings DRVN, Carlisle Companies CSL, Avis Budget Group CAR, Sociedad Quimica y Minera SQM, and Tenaris TS.\n\n5 Stocks Likely to Beat Earnings Estimates\n\nIt is not surprising that before an earnings season, every investor looks for stocks that can beat market expectations. This is because investors always try to position themselves ahead of time and tap stocks that are high-quality in nature.\n\nWhy Is a Positive Earnings Surprise So Important?\n\nHistorically, stocks of companies with solid quarterly earnings (on a nominal basis) tank if they miss or merely meet market expectations. After all, a 20% earnings rise (though apparently looks good) doesn't tell you if earnings growth has been exhibiting a decelerating trend.\n\nAlso, seasonal fluctuations come into play sometimes. If a company's Q1 is seasonally weak and Q4 strong, then it is likely to report a sequential earnings decline. In such cases, growth rates are misleading while judging the true health of a company.\n\nMeanwhile, after much brainstorming and analysis of companies' financials and initiatives, Wall Street analysts project earnings of companies. They in fact club their insights and a company's guidance when deriving an earnings estimate.\n\nThus, outperforming that estimate is almost equivalent to beating the company's own expectation as well as the market perception. And if the margin of earnings surprise is big, it typically drives the stock higher right after the release. Thus, more than anything else, an earnings surprise can push a stock higher.\n\nHow to Find Stocks That Can Beat?\n\nNow, finding stocks that have the potential to beat on the bottom line may be investors' dream but not an easy job. One way to do this is to look at the earnings surprise history of the company.\n\nAn impressive track in this regard generally acts as a catalyst in sending a stock higher. It indicates the company's ability to surpass estimates. And investors generally believe that the company will apply the same secret sauce to execute yet another earning beat in its next release.\n\nStory continues\n\nA handful of criteria has narrowed down the universe from over 7,700 stocks to five.\n\nHere are all five stocks:\n\nDriven Brands Holdings : It is an automotive services company principally in North America. The stock carries a Zacks Rank #1. You can see the complete list of today's Zacks #1 Rank stocks here.\n\nThe average earnings surprise of DRVN for the past four quarters is 30.07%.\n\nCarlisle Companies : The Zacks Rank #1 Carlisle Companies is a diversified, global portfolio of niche brands and businesses with highly engineered and high-margin products.\n\nThe average earnings surprise of CSL for the past four quarters is 23.01%.\n\nAvis Budget Group : The Zacks Rank #1 company operates as a leading vehicle rental operator in North America, Europe and Australasia, with an average rental fleet of nearly 650,000 vehicles.\n\nThe average earnings surprise of CAR for the past four quarters is 102.13%.\n\nSociedad Quimica y Minera : The Zacks Rank #1 company produces fertilizer and iodine and manufactures industrial chemicals and iodine-derivative products.\n\nThe average earnings surprise of SQM for the past four quarters is 28.19%.\n\nTenaris : This is a Zacks Rank #1 company organized in Luxembourg, is a leading manufacturer and supplier of seamless steel pipe products and associated services to the oil and gas, energy and other industries.\n\nThe average earnings surprise of TS for the past four quarters is 62.85%.\n\nYou can get the rest of the stocks on this list by signing up now for your 2-week free trial to the Research Wizard and start using this screen in your own trading. Further, you can also create your own strategies and test them first before taking the investment plunge.\n\nThe Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.\n\nClick here to sign up for a free trial to the Research Wizard today.\n\nFor the rest of this Screen of the Week article please visit Zacks.com at: https:\/\/www.zacks.com\/stock\/news\/1932811\/5-top-stocks-likely-to-beat-earnings-estimates\n\nDisclosure: Officers, directors and\/or employees of Zacks Investment Research may own or have sold short securities and\/or hold long and\/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and\/or hold long and\/or short positions in options that are mentioned in this material.\n\nAbout Screen of the Week\n\nZacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.\n\nStrong Stocks that Should Be in the News\n\nMany are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>.\n\nFollow us on Twitter:  https:\/\/www.twitter.com\/zacksresearch\n\nJoin us on Facebook:  https:\/\/www.facebook.com\/ZacksInvestmentResearch\n\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\n\nContact: Jim Giaquinto\n\nCompany: Zacks.com\n\nPhone: 312-265-9268\n\nEmail: pr@zacks.com\n\nVisit: https:\/\/www.zacks.com\/\n\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com\/disclaimer.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https:\/\/www.zacks.com\/performancefor information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nAvis Budget Group, Inc. (CAR) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nCarlisle Companies Incorporated (CSL) : Free Stock Analysis Report\r\n \r\nTenaris S.A. (TS) : Free Stock Analysis Report\r\n \r\nDriven Brands Holdings Inc. (DRVN) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/zacks-com-featured-highlights-driven-152703728.html","symbols":["CLE.F","CSL.US","DRVN.US","QYM.F","SQM.US"],"tags":["AVIS BUDGET GROUP","CARLISLE COMPANIES","DRIVEN BRANDS HOLDINGS DRVN","EARNINGS SURPRISE","SOCIEDAD QUIMICA Y MINERA","SOCIEDAD QUIMICA Y MINERA SQM","TENARIS","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.999,"neg":0.015,"neu":0.852,"pos":0.133}},{"date":"2022-06-01T22:00:15+00:00","title":"7 Hot Stocks to Buy During the Next Market Crash","content":"The markets aren’t incredibly predictable right now and the typical hot stocks aren’t establishing leadership yet. But that doesn’t mean there aren’t stocks that are worth buying.\n\nThe hot stocks featured here aren’t likely household names, but if you follow my articles with any regularity, many of these may be familiar. These stocks have been doing very well during this mess, largely because they are very focused companies that have been delivering their products to customers reliably for decades.\n\nAnd many of these companies are at the front of the economic chain, helping drive their industries forward without much fanfare from individual consumers.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMany of these companies have been soaring year-to-date (YTD) due to increased demand in their sectors and continually rising prices for their goods and services. But this is a great time to use volatility to your advantage and make a move on these companies when the market turns down again. Because it will turn down again.\n\n7 Best Consumer Staples Stocks to Buy in June (That Pay Dividends!)\n\nStart adding on the dips and you’ll have quite a collection when the volatility ends.\n\nTicker Company Current Price BLDR Builders FirstSource $63.94 CF CF Industries $95.78 CVE Cenovus Energy $23.49 ICL ICL Group $10.73 LNTH Lantheus Holdings $67.64 SQM Sociedad Quimica y Minera de Chile $101.31 WIRE Encore Wire Corp $124.54\n\nBuilders FirstSource (BLDR)\n\nEven as interest rates rise, builders continue to build. This isn’t unusual. And given all the mixed signals we’re seeing in the global economy, it makes perfect sense.\n\nThe economy is overheating (that goes well beyond the U.S.) and we’re sitting at record low levels of unemployment. These aren’t terrible things. So for now, building will continue.\n\nAnd that means Builders FirstSource (NYSE:BLDR) will continue to be a hot stock. It has built a significant footprint supplying builders and developers with the products and services the industry needs to keep up with demand.\n\nStory continues\n\nBLDR stock has been hit hard YTD, losing 24%. But BLDR has still gained 44% in the past 12 months. And that selloff has certainly helped its valuation. Its price-to-earnings ratio is now under 6x.\n\nThis stock has an A rating in my Portfolio Grader.\n\nCF Industries (CF)\n\nAlthough CF Industries (NYSE:CF) has a $21 billion market cap, it’s likely most investors haven’t heard of it before. Well, now is the perfect time to get to know CF.\n\nIt’s a fertilizer company that focuses on nitrogen, ammonia and urea. It also produces ammonium nitrate. These are key products for the agricultural industry around the globe.\n\nCF is a U.S.-based company and has been in business since 1946. It first built a strong relationship with famers in the Midwest and eventually farmers well beyond U.S. shores. Its legacy is also proof that it can weather the booms and busts of the agricultural sector and continue to grow.\n\nCF stock has gained 35% YTD and 73% in the past year. Yet it’s still trading at a P\/E just above 12x and has a 1.7% dividend.\n\n7 Tech Stocks to Buy That Pay Solid Dividends\n\nThis stock has an A rating in my Portfolio Grader.\n\nCenovus Energy (CVE)\n\nUsually in high-profile industries it’s fairly easy to know who the big players are. Everyone talks about them and they end up as the poster children for their respective industries. Energy (NYSE:CVE) has somehow avoided that high-profile status.\n\nBut that doesn’t mean it shouldn’t be considered one of the energy patch’s hot stocks. This Canada-based company has been an energy pioneer. It started operations in 1881. Oil was discovered in the U.S. in Titusville, Pennsylvania in 1859.\n\nThat means CVE wasn’t far behind in its drive to commercialize oil production in Canada. And the fact that it remains a thriving company with a $43 billion market cap is testament to the management of the company over all these decades.\n\nCVE stock has risen 85% YTD and 163% in the past 12 months. Yet it still has a decent P\/E and a 1.5% dividend. But this is a growth story right now, and continued North American demand is going to boost this stock’s fortunes.\n\nThis stock has an A rating in my Portfolio Grader.\n\nICL Group (ICL)\n\nWhen it comes to mining and producing important industrial commodities, much of that work is done abroad, even by most big U.S. chemical and materials companies.\n\nHowever, ICL Group (NYSE:ICL) is an Israel-based company that has a significant global presence, especially in the bromine, potash and magnesium markets. It has mines in Israel — the Negev desert in particular — as well as a number of other countries around the world. Many of its mined chemicals are important components of fertilizers, energy storage and the food industries.\n\nAll these sectors are showing increasing demand intermediate and long term. And given its strategic headquarters, it has easy access to Europe, Asia and Africa.\n\nICL stock has a $14 billion market cap and has been around since 1968. The stock has risen 9% YTD, and 46% in the past 12 months, yet it has a P\/E under 12x.\n\n7 Stocks to Buy to Avoid Being Mauled by a Bear Market\n\nThis stock has an A rating in my Portfolio Grader.\n\nLantheus Holdings (LNTH)\n\nIf there’s one reality that we deal with as we age is the potential onset of cardiovascular disease. Some hardening of the arteries is simply age-related. Some genetic. And some environmental.\n\nAll of those factors put heart disease at the top of the CDC’s list on top killers in 2020. And it usually takes one of the top places every year in the U.S. And that stat isn’t unique to the U.S.\n\nLantheus Holdings (NASDAQ:LNTH) has built its business around diagnostic and therapeutic products and solutions that help healthcare professionals identify disease and improve patient outcomes. Its main line of products are focused on diagnostics for heart, brain, lung and other organs using echocardiography (ECG), nuclear imaging, radiotherapeutics and PET imaging agents.\n\nLNTH stock has a market cap just over $4 billion, but it has been in business since 1956, so it’s a very well established company. That means a lot in the conservative medical sector. It also means LNTH has seen its share of market ups and downs.\n\nThe stock has gained a whopping 170% in the past 12 months, and 127% YTD. Demand has been growing as Covid-19 continues to exacerbate chronic and acute conditions.\n\nThis stock has an A rating in my Portfolio Grader.\n\nSociedad Quimica y Minera de Chile (SQM)\n\nSimilar to ICL, Sociedad Quimica y Minera de Chile (NYSE:SQM) not only launched in 1968 but it’s also a global player in the chemicals sector. Its name translated is the Chemical and Mining Society of Chile. And that’s exactly what it is.\n\nOne of the chemicals it mines is lithium. SQM is on of the world’s largest suppliers of lithium because Chile has significant lithium reserves. This is important not only for the production of energy storage for electric vehicles and renewables, but it’s also in the U.S.’s sphere of influence.\n\nChina has major lithium deposits, but considering the strategic games at play between the U.S. and China, having access to non-Chinese lithium is essential. SQM makes that a reality. Its fertilizer segment is also firing on all cylinders.\n\nThat’s why SQM stock has soared 124% in the past 12 months, and 97% YTD. And it’s why SQM is on our hot stocks list. SQM also still has a 3% dividend yield. Buy in slowly over time.\n\n7 Tech Stocks to Buy That Pay Solid Dividends\n\nThis stock has an A rating in my Portfolio Grader.\n\nEncore Wire Corp (WIRE)\n\nWhen it comes to nearly any type of construction, telecom or infrastructure project the one thing they all have in common is wire. That is also true for numerous consumer devices and durable goods as well.\n\nAnd that’s precisely what Encore Wire Corp (NASDAQ:WIRE) produces: wires of all types for commercial and industrial use. This may seem like a relatively simple business, but it’s as complex and diverse as say, glass manufacturing.\n\nWIRE isn’t a big firm. It has a $2.5 billion market cap, but it’s a very strategic company that should benefit from economic expansion. The stock has gained 49% in the past 12 months, but has lost 12% YTD due to rate increases, among other issues. It’s on the hot stocks list because it’s now on sale and will win big in coming quarters.\n\nThis stock has an A rating in my Portfolio Grader.\n\nOn the date of publication, Louis Navellier has positions in BLDR, CF, CVE, ICL, LNTH, SQM and WIRE in this article. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article.\n\nThe InvestorPlace Research Staff member primarily responsible for this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article.\n\nMore From InvestorPlace\n\nStock Prodigy Who Found NIO at $2… Says Buy THIS It doesn’t matter if you have $500 in savings or $5 million. Do this now.  Get in Now on Tiny $3 ‘Forever Battery’ Stock Early Bitcoin Millionaire Reveals His Next Big Crypto Trade “On Air”\n\nThe post 7 Hot Stocks to Buy During the Next Market Crash appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/7-hot-stocks-buy-during-220015151.html","symbols":["0L8.F","BLDR.US","C4F.F","CF.US","CVE.TO","CVE.US","CXD.F","ICL.TA","ICL.US","LNTH.US","QYM.F","SQM.US"],"tags":["BLDR STOCK","BUILDERS FIRSTSOURCE","CENOVUS ENERGY","ENCORE WIRE CORP","HOT STOCKS","ICL GROUP","INDUSTRIES","MARKET CAP","SOCIEDAD QUíMICA Y MINERA DE CHILE","YEAR-TO-DATE"],"sentiment":{"polarity":0.999,"neg":0.031,"neu":0.855,"pos":0.114}},{"date":"2022-06-01T17:57:00+00:00","title":"Lithium Stock Investing Series: How Is Lithium Mined?","content":"This lithium mining stock investing series kicks off with coverage of the types of lithium mining operations.","link":"https:\/\/finance.yahoo.com\/m\/29e08266-4f74-35f8-8eb5-710867968d39\/lithium-stock-investing.html","symbols":["8LV.F","ALB.US","AMC.F","LTHM.US","QYM.F","SQM.US"],"tags":["LITHIUM CARBONATE","LITHIUM CHLORIDE","LITHIUM HYDROXIDE","LITHIUM MINING","LITHIUM PRODUCERS"],"sentiment":{"polarity":0,"neg":0,"neu":1,"pos":0}},{"date":"2022-05-30T15:40:03+00:00","title":"NTR vs. SQM: Which Stock Should Value Investors Buy Now?","content":"Investors interested in stocks from the Fertilizers sector have probably already heard of Nutrien (NTR) and SQM (SQM). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.\n\nThe best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.\n\nCurrently, both Nutrien and SQM are holding a Zacks Rank of # 1 (Strong Buy). The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that both of these companies have improving earnings outlooks. But this is just one factor that value investors are interested in.\n\nValue investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.\n\nThe Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P\/E ratio, P\/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value.\n\nNTR currently has a forward P\/E ratio of 5.83, while SQM has a forward P\/E of 14.23. We also note that NTR has a PEG ratio of 0.73. This popular figure is similar to the widely-used P\/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. SQM currently has a PEG ratio of 0.80.\n\nAnother notable valuation metric for NTR is its P\/B ratio of 2.15. The P\/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, SQM has a P\/B of 9.22.\n\nThese metrics, and several others, help NTR earn a Value grade of B, while SQM has been given a Value grade of F.\n\nBoth NTR and SQM are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that NTR is the superior value option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nNutrien Ltd. (NTR) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/ntr-vs-sqm-stock-value-154003960.html","symbols":["N7T.F","NTR.TO","NTR.US","QYM.F","SQM.US"],"tags":["EARNINGS ESTIMATES","NTR","VALUE CATEGORY","VALUE INVESTORS","ZACKS RANK"],"sentiment":{"polarity":0.998,"neg":0.005,"neu":0.776,"pos":0.219}},{"date":"2022-05-25T08:31:08+00:00","title":"Zacks Investment Ideas feature highlights: Sociedad Quimica y Minera de Chile","content":"For Immediate Release\n\nChicago, IL – May 25, 2022 – Today, Zacks Investment Ideas feature highlights Sociedad Química y Minera de Chile S.A. SQM.\n\nSurvive Financial Armageddon Using the Zacks Rank\n\nThere's little doubt that what we are witnessing in the stock market right now is a nasty bear market. While the S&P 500 has yet to officially post a close 20% from its peak, the blue-chip index continues to hover right around those levels. The tech-heavy Nasdaq is now down over -30% from its peak last November.\n\nWhereas the coronavirus pandemic-induced plunge was extremely swift (more along the lines of a waterfall decline), this fall in stocks has been fairly orderly and more in sync with what we've seen in past bear markets. There's a myriad of factors that are pulling down equity prices, not least of which is a declining earnings outlook. We've seen many stocks get absolutely punished recently for either missing earnings or guiding weak.\n\nThat's why it's so important to target companies whose earnings picture is actually improving in this market environment. Positive earnings estimate revisions are at the heart of the Zacks Rank, and investors can use this system to find companies that are primed to surge in price – even when most stocks are falling.\n\nThe Zacks Industry Rank assists investors in locating groups of stocks whose earnings outlook is improving. One of the ways we can decide which individual stocks to include in our portfolio is by targeting stocks in different industry groups. This also has the added benefit of helping to diversify our portfolio.\n\nThe Zacks Fertilizers industry currently ranks in the top 2% out of approximately 250 industries. Because this group is ranked in the top half of all industries, we expect it to outperform the market over the next 3 to 6 months. This group has returned 42.48% this year while the market has been in correction mode.\n\nThe projected EPS growth looks particularly promising. By targeting stocks within leading industry groups, we can put the odds in our favor and improve our investing results. Let's take a look at a Zacks Rank #1 (Strong Buy) stock within this top industry.\n\nStory continues\n\nSociedad Química y Minera de Chile S.A.\n\nSociedad Química y Minera produces and distributes specialty plant nutrients and fertilizers globally. SQM provides potassium chloride and sulfate for crops such as corn, rice, wheat, and sugar. The company also manufactures industrial chemicals and iodine derivative products. In addition, SQM offers lithium carbonates for various applications such as materials for batteries, air-conditioning chemicals, and heat-resistant glass. Sociedad Química y Minera was incorporated in 1968 and is headquartered in Santiago, Chile.\n\nSQM has exceeded earnings estimates in each of the past two quarters. The fertilizer producer most recently reported Q1 EPS last week of $2.79, a 126.83% surprise over the $1.23 consensus estimate. The company has delivered a trailing four-quarter average earnings surprise of 28.19%, aiding the stock's 140% return over the past year.\n\nAnalysts are in agreement in terms of earnings revisions and have bolstered estimates across the board. For the current quarter, EPS estimates were raised 83.02% in the past 60 days. The Q2 Zacks Consensus Estimate now stands at $1.94, translating to an astounding 525.81% growth rate relative to the same quarter last year.\n\nFor the full year, analysts have increased EPS estimates by 49.03% in the past 60 days. The Zacks Consensus Estimate is now $6.93, reflecting potential growth of 238.05% versus 2021.\n\nMake sure to put SQM on your watchlist if you haven't already done so.\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nOur 5 best-performing strategies have blown away the S&P's impressive +28.8% gain in 2021. Amazingly, they soared +40.3%, +48.2%, +67.6%, +94.4%, and +95.3%. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps:\/\/www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https:\/\/www.zacks.com\/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/zacks-investment-ideas-feature-highlights-083108490.html","symbols":["GSPC.INDX","QYM.F","SQM.US"],"tags":["CONSENSUS ESTIMATE","INDUSTRY GROUPS","SOCIEDAD QUIMICA Y MINERA","SOCIEDAD QUíMICA Y MINERA DE CHILE S.A","ZACKS INVESTMENT","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.996,"neg":0.026,"neu":0.875,"pos":0.099}},{"date":"2022-05-24T19:00:00+00:00","title":"Gasoline Prices Are Set To Spike This Week","content":"With U.S. drivers preparing for Memorial Day weekend, gasoline demand is set to increase just as inventories continue to drop, pushing prices even higher. News Oil Rig China\n\nThe executive director of the IEA, Fatih Birol, warned that given the current supply\/demand situation, there is only one thing that can stop prices from surging higher and that is Chinese demand remaining weak over the upcoming months.\n\n- According to Platts estimates, China’s April demand plummeted to 13.35 million b\/d, down 11.5% year-on-year, though recovering transportation demand will push May figures back above 14 million b\/d.\n\n- At the peak of lockdown mandates, gasoline and diesel demand in coastal regions dropped by as much as 40%, with a grand total of 45 cities with some form of movement restrictions.\n\n- The market anticipates strong stimulus measures from Beijing that would increase China’s oil demand by 4% year-on-year, adding 600,000 b\/d on the year in the second half of 2022, though this might still be subject to downward revision if the zero-COVID policy remains in place.\n\nMarket Movers\n\n- Jair Bolsonaro, the president of Brazil, fired the CEO of a Petrobras (NYSE:PBR) - the second in two months - after he warned of an impending diesel crisis in the country.\n\n- Ahead of ExxonMobil’s (NYSE:XOM) annual general meeting this Wednesday, UK proxy adviser PIRC urged shareholders to oust Darren Woods as company CEO, saying his continued serving in the role represents a dangerous concentration of power.\n\n- Italy’s ENI (NYSE:E) and France’s TotalEnergies (NYSE:TTE)started the exploratory drilling of a natural gas well in Block 06 offshore Cyprus, almost four years after the 8 TCf Calypso discovery.\n\nTuesday, May 24, 2022\n\nThe combination of physical tightness and robust demand is keeping oil prices near the $110 mark. This week, gasoline prices are likely to garner plenty of attention as inventories continue to drop and US drivers gear up for Memorial Day weekend travel. This is all coming at a time when RBOB futures are seeing record-high levels of backwardation. The prospect of Chinese demand gradually bouncing back and the EU finally agreeing to sanctions on Russian oil is only adding to the upside risk for oil prices.\n\nStory continues\n\nEU Signals Potential Sanctions Breakthrough Soon. The prime ministers of Germany and the Netherlands have announced that the sixth package of EU sanctions on Russia, sanctions that should contain an oil ban, could be reached within a few days, hinting at a potential settlement with Hungary.\n\nWhite House Might Release Diesel SPR Stocks. The Biden Administration is mulling an emergency release of diesel inventories held in the Northeast Home Heating Oil Reserve, roughly 1 million barrels, to tame soaring fuel prices as the national average price of diesel reached $5.56 a gallon.\n\nWeakening European Demand Puts Asia in LNG Driving Seat Again. With European purchases of liquefied natural gas ebbing on the back of stable inventories and warm weather, intensifying pre-summer buying of Asian consumers like China and Japan has been gradually pushing spot prices to $23 per mmBtu, though still some $3\/mmBtu below European TTF figures.\n\nChina Opens Up to Australia. Two years after China’s discontent with Australia led to Beijing banning its coal exports, Chinese prime minister Li Keqiang indicated a willingness to work with the newly-elected government of Labor leader Anthony Albanese, the first senior communication between the countries in two years.\n\nRussia Wants Joint Refineries with BRICS Countries. Russia’s industry minister Denis Manturov flaunted the idea of establishing joint oil and gas refining facilities with other BRICS nations (Brazil, India, China, and South Africa) to ease their dependence on “unreliable partners”.\n\nNorway Just Cannot Restart Arctic LNG Project. Following a fire incident in September 2020, Norwegian oil major Equinor (NYSE:EQNR) has been struggling to bring its Hammerfest LNG plant back, postponing its restart once again to May 27 after a compressor failure.\n\nIran Revives Oman Subsea Gas Project. Iran’s oil ministry is seeking to revive a long-stalled $60 billion project to lay a subsea pipeline that would carry Iranian gas to Oman, delayed by pricing disagreements and the US’ reimposition of sanctions against Teheran in 2018.\n\nRelated: Poland Says Norway Should Share Its “Gigantic” Oil & Gas Profits\n\nPetrobras Mulls Upstream Expansion. Brazil’s state-controlled oil firm Petrobras (NYSE:PBR) will reportedly invest $16 billion over the next five years to stall natural declines at post-salt fields in the Campos Basin, despite increasing pressure from President Bolsonaro to tame runaway fuel prices.\n\nChile Wants Lithium State Firm by Year-End. Chile’s government pledged to establish a state lithium firm by the end of this year, potentially squeezing the market share of Albemarle (NYSE:ALB) and SQM (NYSE:SQM), though recent utterances have hinted at potential private participation in the new company.\n\nArgentina Output Soars to 10-Year Maximum. Argentina’s crude production rose to the highest level since 2011, averaging 578,000 b\/d in April with the share of Vaca Muerta shale output rising to more than 40% of the national total.\n\nGermany Wants to Keep Idled Coal Plants on Standby. Wary of potential power crunches, the German government is planning to keep some 8.5 GW of coal-fired generation capacity that is due to be idled in 2022-2023 in standby mode, with operators compensated from public funds for holding feedstock ready.\n\nTrinidad Wants its Refinery Back. The government of Trinidad and Tobago picked an unnamed bidder to restart and operate its 165,000 b\/d Guaracara refinery, shuttered since November 2018, saying that it would seek to process crude from neighboring Guyana.\n\nUK Mulls Windfall Tax on Oil & Gas. With UK power prices spinning out of control and the price cap set to reach £2,800 ($3,500) in October, the government in London is considering imposing a windfall tax on oil and gas companies that fail to make ‘significant investment’ into renewables.\n\nBy Tom Kool for Oilprice.com\n\nMore Top Reads from Oilprice.com:\n\nBiden Could Tap Diesel Reserve In A Bid To Ease Fuel Crunch Oil Markets Are Bracing For A Slew Of Bullish News World Sees First Global Energy Shock: World Energy Council\n\nRead this article on OilPrice.com","link":"https:\/\/finance.yahoo.com\/news\/gasoline-prices-set-spike-week-190000537.html","symbols":["ALB.US","E.US","EQNR.US","HO.COMM","NG.COMM","PBR-A.US","PBR.US","PBRN.MX","PETR3.SA","PETR4.SA","PJX.F","PJXA.F","PJXB.F","PJXC.F","RB.COMM","SQM.US","TTE.US","XOM.US"],"tags":["CHINA","CHINESE DEMAND","FATIH BIROL","GASOLINE PRICES","INVENTORIES","JAIR BOLSONARO","MEMORIAL DAY WEEKEND","OIL PRICES","PETROBRAS","PRESIDENT OF BRAZIL"],"sentiment":{"polarity":-0.926,"neg":0.079,"neu":0.856,"pos":0.065}},{"date":"2022-05-24T16:59:04+00:00","title":"Survive the Financial Armageddon Using the Zacks Rank","content":"There’s little doubt that what we are witnessing in the stock market right now is a nasty bear market. While the S&P 500 has yet to officially post a close 20% from its peak, the blue-chip index continues to hover right around those levels. The tech-heavy Nasdaq is now down over -30% from its peak last November.\n\nWhereas the coronavirus pandemic-induced plunge was extremely swift (more along the lines of a waterfall decline), this fall in stocks has been fairly orderly and more in sync with what we’ve seen in past bear markets. There’s a myriad of factors that are pulling down equity prices, not least of which is a declining earnings outlook. We’ve seen many stocks get absolutely punished recently for either missing earnings or guiding weak.\n\nThat’s why it’s so important to target companies whose earnings picture is actually improving in this market environment. Positive earnings estimate revisions are at the heart of the Zacks Rank, and investors can use this system to find companies that are primed to surge in price – even when most stocks are falling.\n\nThe Zacks Industry Rank assists investors in locating groups of stocks whose earnings outlook is improving. One of the ways we can decide which individual stocks to include in our portfolio is by targeting stocks in different industry groups. This also has the added benefit of helping to diversify our portfolio.\n\nThe Zacks Fertilizers industry currently ranks in the top 2% out of approximately 250 industries. Because this group is ranked in the top half of all industries, we expect it to outperform the market over the next 3 to 6 months. This group has returned 42.48% this year while the market has been in correction mode. Also note the favorable characteristics for this industry: Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nThe projected EPS growth looks particularly promising. By targeting stocks within leading industry groups, we can put the odds in our favor and improve our investing results. Let’s take a look at a Zacks Rank #1 (Strong Buy) stock within this top industry.\n\nStory continues\n\nSociedad Química y Minera de Chile S.A. (SQM)\n\nSociedad Química y Minera produces and distributes specialty plant nutrients and fertilizers globally. SQM provides potassium chloride and sulfate for crops such as corn, rice, wheat, and sugar. The company also manufactures industrial chemicals and iodine derivative products. In addition, SQM offers lithium carbonates for various applications such as materials for batteries, air-conditioning chemicals, and heat-resistant glass. Sociedad Química y Minera was incorporated in 1968 and is headquartered in Santiago, Chile.\n\nSQM has exceeded earnings estimates in each of the past two quarters. The fertilizer producer most recently reported Q1 EPS last week of $2.79, a 126.83% surprise over the $1.23 consensus estimate. The company has delivered a trailing four-quarter average earnings surprise of 28.19%, aiding the stock’s 140% return over the past year.\n\nSociedad Quimica y Minera S.A. Price, Consensus and EPS Surprise Sociedad Quimica y Minera S.A. Price, Consensus and EPS Surprise\n\nAnalysts are in agreement in terms of earnings revisions and have bolstered estimates across the board. For the current quarter, EPS estimates were raised 83.02% in the past 60 days. The Q2 Zacks Consensus Estimate now stands at $1.94, translating to an astounding 525.81% growth rate relative to the same quarter last year.\n\nFor the full year, analysts have increased EPS estimates by 49.03% in the past 60 days. The Zacks Consensus Estimate is now $6.93, reflecting potential growth of 238.05% versus 2021.\n\nMake sure to put SQM on your watchlist if you haven’t already done so.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/survive-financial-armageddon-using-zacks-165904105.html","symbols":["QYM.F","SQM.US"],"tags":["CONSENSUS ESTIMATE","INDUSTRY GROUPS","SOCIEDAD QUIMICA Y MINERA","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.994,"neg":0.024,"neu":0.874,"pos":0.103}},{"date":"2022-05-23T12:07:12+00:00","title":"Sociedad Quimica (SQM) Q1 Earnings and Sales Trounce Estimates","content":"Sociedad Quimica y Minera de Chile S.A. SQM recorded a profit of $796.1 million or $2.79 per share for first-quarter 2022, up from $68 million 26 cents in the year-ago quarter. Earnings per share for the reported quarter topped the Zacks Consensus Estimate of $1.23.\r\n\r\nThe company registered revenues of $2,019.8 million for the quarter, up nearly fourfold year over year. It also surpassed the Zacks Consensus Estimate of $1,283.7 million.\r\n\r\nThe company gained from higher prices across its business lines with a significant increase in lithium prices in the reported quarter.\n\nSociedad Quimica y Minera S.A. Price, Consensus and EPS Surprise Sociedad Quimica y Minera S.A. Price, Consensus and EPS Surprise\n\nSociedad Quimica y Minera S.A. price-consensus-eps-surprise-chart | Sociedad Quimica y Minera S.A. Quote\n\nSegment Highlights\n\nRevenues from the Lithium and Derivatives segment surged more than tenfold year over year to $1,446.4 million in the reported quarter. The upside was driven by strong lithium sales volumes and prices.\r\n\r\nThe Specialty Plant Nutrients (\"SPN\") segment raked in revenues of $275.3 million, up around 42% year over year. The upside was mainly driven by higher prices.\r\n\r\nRevenues from the Iodine and Derivatives unit came in at $152.4 million, up around 59% year over year. The segment benefited from higher volumes on strong demand recovery as well as higher average prices.\r\n\r\nRevenues from the Potassium Chloride and Potassium Sulfate business jumped around 89% year over year to $114.1 million. Sales were driven by a significant increase in average prices.\r\n\r\nThe Industrial Chemicals unit recorded sales of $27.1 million, down around 26% year over year, hurt by reduced solar salts sales volumes.\n\nFinancials\n\nThe company’s cash and cash equivalents were $5,898.9 million at the end of the quarter, up around 29% on a sequential basis. Long-term debt was $2,567.4 million, down around 0.8% sequentially.\n\nOutlook\n\nMoving ahead, the company envisions global lithium market to growth at least 30% in 2022. It expects sales volumes to exceed 140,000 metric tons this year. The lockdowns in China may somewhat impact volumes in the second quarter, the company noted.\r\n\r\nIn SPN, the company expects sustained supply restrictions and higher prices to impact demand growth in the agricultural potassium nitrate market, impacting its sales volumes in 2022.\r\n\r\nThe company also expects iodine prices to continue to rise in the coming quarters. It also sees sales volumes for potassium chloride to reach around 750,000 metric tons in 2022.\n\nStory continues\n\nPrice Performance\n\nShares of Sociedad Quimica are up 125.9% over a year compared with the industry’s rise of 55.2%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank & Key Picks\n\nSociedad Quimica currently sports a Zacks Rank #1 (Strong Buy).\r\n\r\nOther top-ranked stocks worth considering in the basic materials space include Commercial Metals Company CMC, Nutrien Ltd. NTR and Steel Dynamics, Inc. STLD.\r\n\r\nCommercial Metals, carrying a Zacks Rank #1, has a projected earnings growth rate of 78.2% for the current fiscal year. The Zacks Consensus Estimate for CMC's current fiscal year earnings has been revised 31.9% upward over the past 60 days. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nCommercial Metals beat the Zacks Consensus Estimate for earnings in three of the last four quarters while missed once. It has a trailing four-quarter earnings surprise of roughly 16%, on average. CMC has gained around 16% in a year.\r\n\r\nNutrien, sporting a Zacks Rank #1, has an expected earnings growth rate of 161.9% for the current year. The Zacks Consensus Estimate for NTR's current-year earnings has been revised 38.8% upward over the last 60 days.\r\n\r\nNutrien beat the Zacks Consensus Estimate for earnings in three of the last four quarters while missed once. It has a trailing four-quarter earnings surprise of roughly 5.8%, on average. NTR has rallied around 59% in a year.\r\n\r\nSteel Dynamics, carrying a Zacks Rank #1, has an expected earnings growth rate of 33.8% for the current year. The Zacks Consensus Estimate for STLD's current-year earnings has been revised 33.8% upward over the last 60 days.\r\n\r\nSteel Dynamics beat the Zacks Consensus Estimate for earnings in each of the last four quarters, the average being roughly 2.5%. STLD has gained around 22% in a year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSteel Dynamics, Inc. (STLD) : Free Stock Analysis Report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nCommercial Metals Company (CMC) : Free Stock Analysis Report\r\n \r\nNutrien Ltd. (NTR) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/sociedad-quimica-sqm-q1-earnings-120712571.html","symbols":["CMC.US","CMS.F","N7T.F","NTR.TO","NTR.US","QYM.F","SD5.F","SQM.US","STLD.MX","STLD.US"],"tags":["CONSENSUS ESTIMATE","EARNINGS PER SHARE","REPORTED QUARTER","SOCIEDAD QUIMICA Y MINERA","SOCIEDAD QUíMICA Y MINERA DE CHILE","ZACKS CONSENSUS ESTIMATE","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.996,"neg":0.017,"neu":0.876,"pos":0.107}},{"date":"2022-05-20T16:41:27+00:00","title":"This Just In: Analysts Are Boosting Their Sociedad Química y Minera de Chile S.A. (NYSE:SQM) Outlook for This Year","content":"Sociedad Química y Minera de Chile S.A. (NYSE:SQM) shareholders will have a reason to smile today, with the analysts making substantial upgrades to this year's forecasts. The consensus statutory numbers for both revenue and earnings per share (EPS) increased, with their view clearly much more bullish on the company's business prospects. The market may be pricing in some blue sky too, with the share price gaining 25% to US$95.23 in the last 7 days. It will be interesting to see if today's upgrade is enough to propel the stock even higher.\n\nFollowing the upgrade, the latest consensus from Sociedad Química y Minera de Chile's eleven analysts is for revenues of US$8.7b in 2022, which would reflect a sizeable 101% improvement in sales compared to the last 12 months. Per-share earnings are expected to shoot up 150% to US$11.47. Prior to this update, the analysts had been forecasting revenues of US$5.6b and earnings per share (EPS) of US$6.14 in 2022. So we can see there's been a pretty clear increase in analyst sentiment in recent times, with both revenues and earnings per share receiving a decent lift in the latest estimates.\n\nView our latest analysis for Sociedad Química y Minera de Chile  earnings-and-revenue-growth\n\nWith these upgrades, we're not surprised to see that the analysts have lifted their price target 16% to US$93.64 per share. Fixating on a single price target can be unwise though, since the consensus target is effectively the average of analyst price targets. As a result, some investors like to look at the range of estimates to see if there are any diverging opinions on the company's valuation. There are some variant perceptions on Sociedad Química y Minera de Chile, with the most bullish analyst valuing it at US$136 and the most bearish at US$50.00 per share. Note the wide gap in analyst price targets? This implies to us that there is a fairly broad range of possible scenarios for the underlying business.\n\nTaking a look at the bigger picture now, one of the ways we can understand these forecasts is to see how they compare to both past performance and industry growth estimates. It's clear from the latest estimates that Sociedad Química y Minera de Chile's rate of growth is expected to accelerate meaningfully, with the forecast 153% annualised revenue growth to the end of 2022 noticeably faster than its historical growth of 5.3% p.a. over the past five years. By contrast, our data suggests that other companies (with analyst coverage) in a similar industry are forecast to grow their revenue at 3.7% per year. Factoring in the forecast acceleration in revenue, it's pretty clear that Sociedad Química y Minera de Chile is expected to grow much faster than its industry.\n\nStory continues\n\nThe Bottom Line\n\nThe biggest takeaway for us from these new estimates is that analysts upgraded their earnings per share estimates, with improved earnings power expected for this year. Fortunately, analysts also upgraded their revenue estimates, and our data indicates sales are expected to perform better than the wider market. Given that the consensus looks almost universally bullish, with a substantial increase to forecasts and a higher price target, Sociedad Química y Minera de Chile could be worth investigating further.\n\nWith that said, the long-term trajectory of the company's earnings is a lot more important than next year. We have estimates - from multiple Sociedad Química y Minera de Chile analysts - going out to 2024, and you can see them free on our platform here.\n\nAnother way to search for interesting companies that could be  reaching an inflection point is to track whether management are buying or selling, with our free list of growing companies that insiders are buying.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.","link":"https:\/\/finance.yahoo.com\/news\/just-analysts-boosting-sociedad-qu-164127482.html","symbols":["QYM.F","SQM.US"],"tags":["CHILE","EARNINGS PER SHARE","PRICE TARGET","SOCIEDAD QUíMICA Y MINERA DE CHILE"],"sentiment":{"polarity":0.998,"neg":0.009,"neu":0.861,"pos":0.13}},{"date":"2022-05-20T02:32:00+00:00","title":"SQM Stock Pops as Earnings Surge on Soaring Lithium Demand","content":"Lithium stock SQM has returned 81% so far in 2022, thanks in large part to robust demand for lithium-ion batteries for electric vehicles.","link":"https:\/\/finance.yahoo.com\/m\/384cc6ab-2731-3fc2-8351-194cabd88cee\/sqm-stock-pops-as-earnings.html","symbols":["QYM.F","SQM.US"],"tags":["EARNINGS RELEASE","SOCIEDAD QUíMICA Y MINERA DE CHILE","SQM STOCK"],"sentiment":{"polarity":0.586,"neg":0.056,"neu":0.746,"pos":0.198}},{"date":"2022-05-19T12:23:57+00:00","title":"This Stock Is Hitting New Highs Even as the Market Sinks Again","content":"Wall Street had a bad day on Wednesday, and initial signs from Thursday morning suggested that further declines might be in store. The ongoing churning in the stock market is having a negative impact on investor sentiment, and short-term traders in particular are losing their nerve and looking for gains on the downside. S&P 500 (SNPINDEX: ^GSPC) futures dropped 44 points to 3,879, while Nasdaq Composite (NASDAQINDEX: ^IXIC) futures were lower by 140 points to 11,795.","link":"https:\/\/finance.yahoo.com\/m\/9b692d03-b950-3fe3-b08a-70112d63e0a9\/this-stock-is-hitting-new.html","symbols":["QYM.F","SQM.US"],"tags":["NYSE","RICARDO RAMOS","SOCIEDAD QUIMICA Y MINERA","STOCK MARKET","THURSDAY MORNING"],"sentiment":{"polarity":-0.891,"neg":0.166,"neu":0.806,"pos":0.028}},{"date":"2022-05-19T04:04:00+00:00","title":"SQM REPORTS EARNINGS FOR THE THREE MONTHS ENDED MARCH 31, 2022","content":"Highlights\n\nSQM reported net income for the three months ended March 31, 2022 of US$796.1 million, compared to US$68.0 million in same period of 2021. Revenues for the three months ended March 31, 2022, were US$2,019.8 million. Earnings per share totaled US$2.79 for the three months ended March 31, 2022. Our first quarter results include payments related to the agreement with Corfo and tax provisions that totaled approximately US$800 million. Adjusted EBITDA margin for the first three months of 2022 reached 58.7%. SQM will hold a conference call to discuss these results on Thursday, May 19, at 12:00pm ET (12:00pmChile time).\r\n\r\nParticipant Dial-In (Toll Free):                    1-855-238-1018\r\n\r\nParticipant International Dial-In:                             1-412-542-4107\r\n\r\nWebcast: https:\/\/services.choruscall.com\/links\/sqm220519.html\n\nSANTIAGO, Chile, May 19, 2022 \/PRNewswire\/ -- Sociedad Química y Minera de Chile S.A. (SQM) (NYSE: SQM; Santiago Stock Exchange: SQM-B, SQM-A) reported earnings today for the three months ended March 31, 2022 of US$796.1 million (US$2.79 per share), an increase from US$68.0 million (US$0.26 per share) reported for the three months ended March 31, 2021. Gross profit reached US$1,164.7 million (57.7% of revenues) for the three months ended March 31, 2022, compared to US$136.6 million (25.9% of revenues) recorded for the three months ended March 31, 2021. Revenues totaled US$2,019.8 million for the three months ended March 31, 2022, an increase compared to the US$528.5 reported for the three months ended March 31, 2021.\n\nSQM's Chief Executive Officer, Ricardo Ramos, stated: \"Our first quarter results reflect several positive circumstances; first, the impact of higher prices in all our business lines, where significant increases in lithium prices stand out, and second, the successful long-term, operational and commercial strategy.\"\n\nStory continues\n\nRelated to our operations in the Salar de Atacama, it is important to remember that SQM began this project by acquiring the participation from producers from Chile and the United States in 1993. Before our acquisition, there had been seven years of investments and studies by these companies. We assumed the risk, developed, invested and executed the project. It has not been an easy task; the natural resource was not well known, and our project has had its ups and downs. Mining activities require long periods of development, dialogue and collaboration with the neighboring communities, relevant investments from shareholders and, above all, a strong team to innovate and develop technologies to operate the natural resource.\"\n\nToday we can proudly report that we are a leader in the lithium industry. We have almost tripled our production levels in three years while we have significantly decreased the extraction of brines. We are the most integrated lithium producer in its country of origin, delivering high-quality products that can be used directly in the production of high-end battery components.\n\nOur first quarter results include payments related to the agreement with Corfo and tax provisions that totaled approximately US$800 million. In total, the amount is similar to the earnings reported by all of our business during the first quarter of this year.\n\nSQM's lithium business is a very good example of a successful public-private partnership. No other operation delivers more resources proportionally to Chilean coffers; approximately 60% of the operating margin from lithium is dedicated to payments to Corfo and taxes.\"\n\nMr. Ramos finished by saying: \"We continue to permanently analyze new ideas and study new projects in all our businesses. We will review our investment plan in the coming months, and we should update our projections following that review. It is very likely that we will increase the resources oriented to the development of business in Chile and abroad.\"\n\nSustainable Development\n\nIn April 2022 we published our audited 2021 Sustainability Report. For the twelfth consecutive year, the information was presented under the GRI standards (Global Standard Initiative) and for first time, under SASB (Sustainability Accounting Standards Board) standards. We would like to highlight that SQM's workforce is made up of approximately 19% women, in an industry where the average in Chile is 13%. Furthermore, 30% of the executive positions at SQM are filled by women. We are proud that in the Northern regions of Chile, our we employment base is over 82% local.\n\nWe continue to keep sustainability at the core of the company and during 2021 we were able to reduce our carbon emissions 28% per ton when compared to 2020. Specific to the lithium production, we reduced direct water consumption for lithium carbonate approximately 27% in 2021 when compared to 2020.\n\nWe invite you to read our Sustainability Report in detail to learn more about all of our environmental and social efforts. Report\n\nAbout SQM\n\nSQM is a global company that is listed on the New York Stock Exchange and the Santiago Stock Exchange (NYSE: SQM; Santiago Stock Exchange: SQM-B, SQM-A). SQM develops and produces diverse products for several industries essential for human progress, such as health, nutrition, renewable energy and technology through innovation and technological development. We aim to maintain our leading world position in the lithium, potassium nitrate, iodine and thermo-solar salts markets.\n\nFor further information, contact:\n\nGerardo Illanes 56-2-24252022 \/ gerardo.illanes@sqm.com\r\nKelly O'Brien 56-2-24252074 \/ kelly.obrien@sqm.com\r\nIrina Axenova 56-2-24252280 \/ irina.axenova@sqm.com\n\nFor media inquiries, contact:\n\nMaria Ignacia Lopez \/ ignacia.lopez@sqm.com \r\nPablo Pisani \/ pablo.pisani@sqm.com\n\nCautionary Note Regarding Forward-Looking Statements\n\nThis news release contains \"forward-looking statements\" within the meaning of the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by words such as: \"anticipate,\" \"plan,\" \"believe,\" \"estimate,\" \"expect,\" \"strategy,\" \"should,\" \"will\" and similar references to future periods. Examples of forward-looking statements include, among others, statements we make concerning the Company's capital expenditures, financing sources, Sustainable Development Plan, business outlook, future economic performance, anticipated profitability, revenues, expenses, or other financial items, anticipated cost synergies and product or service line growth.\n\nForward-looking statements are neither historical facts nor assurances of future performance. Instead, they are estimates that reflect the best judgment of SQM management based on currently available information. Because forward-looking statements relate to the future, they involve a number of risks, uncertainties and other factors that are outside of our control and could cause actual results to differ materially from those stated in such statements, including our ability to successfully implement the Sustainable Development Plan. Therefore, you should not rely on any of these forward-looking statements. Readers are referred to the documents filed by SQM with the United States Securities and Exchange Commission, specifically the most recent annual report on Form 20-F, which identifies other important risk factors that could cause actual results to differ from those contained in the forward-looking statements. All forward-looking statements are based on information available to SQM on the date hereof and SQM assumes no obligation to update such statements, whether as a result of new information, future developments or otherwise, except as required by law. Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/sqm-reports-earnings-for-the-three-months-ended-march-31-2022-301550805.html\n\nSOURCE Sociedad Quimica y Minera de Chile, S.A. (SQM)","link":"https:\/\/finance.yahoo.com\/news\/sqm-reports-earnings-three-months-040400583.html","symbols":["QYM.F","SQM.US"],"tags":["CHILE","EARNINGS PER SHARE","SANTIAGO STOCK EXCHANGE"],"sentiment":{"polarity":0.998,"neg":0.019,"neu":0.892,"pos":0.089}},{"date":"2022-05-17T09:30:00+00:00","title":"Hong Kong IPO candidate Tianqi Lithium gets Shenzhen bourse query over losses incurred from US$159 million option-linked contracts with Morgan Stanley","content":"Tianqi Lithium, Asia's second-largest lithium compound producer, has received queries from the Shenzhen Stock Exchange about a 49.7 million yuan (US$7.4 million) derivative loss linked to US$159 million option-linked loan contracts it obtained from US bank Morgan Stanley in 2019.\n\nThe bourse has asked Tianqi's accountant to submit further details and explain the overall hedging losses disclosed by the company's 2021 annual report. It has also asked the firm to further justify the losses it has sustained from its hedging business.\n\n\"Please clarify the reason and justification for the losses incurred by your hedging business over the past three years,\" the exchange said in an inquiry letter published on its website on Monday. It also asked Tianqi to demonstrate whether its employees had \"engaged in high-risk futures investment\" without complying with the firm's internal risk limits.\n\nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.\n\nTianqi did not issue a statement regarding the inquiry.\n\nXingyong Zhonghe Accounting Firm, which is listed as Tianqi's accountant for its 2021 annual report, was not immediately available for comment on Tuesday.\n\nThe Sichuan province-based lithium miner, whose products are used in electric vehicles batteries, glass and aircraft, applied to list in Hong Kong in January in a deal that could raise more than US$1 billion, local media reported. Morgan Stanley is a joint sponsor of the deal along with CICC and CMB International.\n\nA file photo of brine pools at SQM's lithium mine on the Atacama salt flat in northern Chile. Photo: Reuters alt=A file photo of brine pools at SQM's lithium mine on the Atacama salt flat in northern Chile. Photo: Reuters>\n\nTianqi's Hong Kong initial public offering (IPO) application is under review. Generally, it takes at least six month for an applicant to proceed to the stage where the listing committee of bourse operator Hong Kong Exchanges and Clearing gives its approval, after which the firm proceeds to an IPO.\n\nStory continues\n\nThe US$159 million loan contracts in question involved two \"variable prepaid forward contracts\" that it had entered into with Morgan Stanley in 2019, for which Tianqi pledged more than 5.3 million shares of Chilean lithium miner Sociedad Quimica y Minera De Chile (SQM) it owned.\n\nTianqi acquired a minority stake in SQM back in 2018 for US$4.1 billion. It still owns about 23.7 per cent of SQM, according to its Hong Kong IPO draft prospectus.\n\nThe contracts had embedded options that were tied to SQM share prices. The shares pledged represented SQM's American depositary shares trading on the New York Stock Exchange. Tianqi took the loan after the SQM acquisition loaded it with debt, so much so that finance costs incurred from the loan and borrowings amounted to 42.5 per cent and 57.1 per cent of its total revenue in 2019 and 2020, respectively.\n\nTianqi opted for the complex option-embedded contracts with Morgan Stanley as this allowed it to obtain the highest loan amount for a three-year term, according to a filing with the Shenzhen exchange in January.\n\nThe options had a series of expiry dates that kicked in starting January this year and Tianqi said that it had opted to repay the loan contracts by delivering SQM shares to Morgan Stanley, instead of cash. \"By repaying the loan through delivering shares, it would cause the least impact to the company's profit and loss account,\" it said in a statement issued in January.\n\nIt was not immediately clear what losses these option-linked loan contracts had caused for Tianqi. But before the contracts' expiry, the embedded options had already led to a 176.4 million yuan loss for the nine months of 2020, according to the firm's draft IPO prospectus.\n\nThe company said it would use the proceeds from its Hong Kong IPO to repay a US$3.5 billion syndicated loan taken out in 2018 to fund the SQM acquisition.\n\nTianqi, Jiangxi-based Ganfeng, SQM and US-based Albemarle are the big four players in the sector and produced almost half of the world's refined lithium product supply in 2020, according to consultancy Wood Mackenzie.\n\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2022 South China Morning Post Publishers Ltd. All rights reserved.\n\nCopyright (c) 2022. South China Morning Post Publishers Ltd. All rights reserved.","link":"https:\/\/finance.yahoo.com\/news\/hong-kong-ipo-candidate-tianqi-093000661.html","symbols":["QYM.F","SQM.US"],"tags":["HONG KONG","LOAN CONTRACTS","MORGAN STANLEY","SHENZHEN STOCK EXCHANGE","TIANQI LITHIUM"],"sentiment":{"polarity":0.662,"neg":0.03,"neu":0.932,"pos":0.037}},{"date":"2022-05-16T10:49:10+00:00","title":"Sociedad Quimica (SQM) to Post Q1 Earnings: What's in the Cards?","content":"Sociedad Quimica y Minera de Chile S.A. SQM will release first-quarter 2022 results after the closing bell on May 18.\r\n\r\nThe company missed the Zacks Consensus Estimate for earnings in two of the last four quarters while beat once and posted in-line result on the other occasion. It has a trailing four-quarter negative earnings surprise of around 3.5%, on average. It posted a positive earnings surprise of 16.5% in the last reported quarter. The company’s first-quarter results are likely to have benefited from higher demand and prices.\r\n\r\nShares of Sociedad Quimica have gained 78.1% in the past year compared with 52.3% rise of the industry. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLet’s see how things are shaping up for this announcement.\n\nWhat do the Estimates Say?\n\nThe Zacks Consensus Estimate for first-quarter sales for Sociedad Quimica is currently pegged at $1,284 million, which suggests a rise of around 142.9% year over year.\n\nSome Factors to Watch For\n\nThe company is likely to have gained from higher realized prices and strong demand in the quarter to be reported. Higher sales volumes in lithium, specialty plant nutrition, potassium chloride, iodine and potassium businesses are expected to have aided its top line and margins in the quarter.\r\n\r\nThe expansion of lithium operations is expected to have supported the company’s lithium sales volumes. Strong demand and limited supply are also likely to have boosted lithium prices in the March quarter. Iodine volumes are also expected to have been supported by growing demand following the post-pandemic recovery.\r\n\r\nGlobal potassium prices are also expected to have been driven by the shortage of potassium-based fertilizers. This is likely to have boosted prices in the company’s potassium business lines in the first quarter. Higher demand is likely to have backed the increase in prices of potassium chloride.\n\nSociedad Quimica y Minera S.A. Price and EPS Surprise Sociedad Quimica y Minera S.A. Price and EPS Surprise\n\nSociedad Quimica y Minera S.A. price-eps-surprise | Sociedad Quimica y Minera S.A. Quote\n\nStory continues\n\nZacks Model\n\nOur proven model does not conclusively predict an earnings beat for Sociedad Quimica this season. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of an earnings beat. But that’s not the case here.\r\n\r\nEarnings ESP: Earnings ESP for Sociedad Quimica is 0.00%. The Zacks Consensus Estimate for earnings for the first quarter is currently pegged at $1.23. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\r\n\r\nZacks Rank: Sociedad Quimica currently carries a Zacks Rank #1.\n\nStocks That Warrant a Look\n\nHere are some companies you may want to consider as our model shows these have the right combination of elements to post an earnings beat this quarter:\r\n\r\nAdvance Auto Parts, Inc. AAP, slated to release earnings on May 23, has an Earnings ESP of +4.89%. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nAdvance Auto Parts currently carries a Zacks Rank #3. The Zacks Consensus Estimate for AAP’s earnings for the first quarter is pegged at $3.50.\r\n\r\nAutoZone, Inc. AZO is scheduled to release earnings on May 24. It has an Earnings ESP of +2.51%.\r\n\r\nAutoZone currently carries a Zacks Rank #3. The Zacks Consensus Estimate for AZO’s earnings for the fiscal third quarter is pegged at $25.70.\r\n\r\nCostco Wholesale Corporation COST is slated to release earnings on May 26. It has an Earnings ESP of +1.90%.\r\n\r\nCostco currently carries a Zacks Rank #2. The Zacks Consensus Estimate for COST’s earnings for the fiscal third quarter is currently pegged at $3.04.\r\n\r\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nCostco Wholesale Corporation (COST) : Free Stock Analysis Report\r\n\r\nAdvance Auto Parts, Inc. (AAP) : Free Stock Analysis Report\r\n\r\nAutoZone, Inc. (AZO) : Free Stock Analysis Report\r\n\r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/sociedad-quimica-sqm-post-q1-104910331.html","symbols":["AZ5.F","AZO.US","COST.MX","COST.US","COWC34.SA","CTO.F","QYM.F","SQM.US"],"tags":["CONSENSUS ESTIMATE","EARNINGS SURPRISE","POTASSIUM CHLORIDE","RELEASE EARNINGS","SOCIEDAD QUIMICA","SOCIEDAD QUIMICA Y MINERA","SOCIEDAD QUíMICA Y MINERA DE CHILE","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.995,"neg":0.024,"neu":0.873,"pos":0.103}},{"date":"2022-05-13T03:24:35+00:00","title":"Albemarle Tops Our List of Lithium Stocks - Who Else is Worth Checking Out?","content":"This article was first published on Simply Wall St News .\n\nLithium has been the talk of the town recently and it’s no secret as to why. Recent estimates from McKinsey suggest a global demand of around 3 million metric tons of lithium carbonate equivalent (LCE) in 2030. In contrast, the total global LCE output for 2021 amounted to only 540,000 metric tons, a mere 18% of the anticipated need for 2030. These figures point to a potential shortfall in the future and questions are being raised over how this demand will be met.\n\nThe rise in this demand is attributed to an increase in consumer demand for Electric Vehicles (EVs). These EVs are requiring batteries that have higher energy densities and longer lifespans, the main component of which is high-grade lithium. The sudden rise in demand has caused raw lithium prices to skyrocket, leaving battery producers scrambling to secure their supply of a commodity that is quickly entering into a shortage. So this begs the question: Which companies are best positioned to take advantage? Mined production volume, modelled for 93% available capacity. Source: Minespans, McKinsey lithium demand model\n\nAlbemarle Corporation (NYSE:ALB)\n\nAlbemarle is a global leader in the extraction and production of lithium, bromine and refining catalyst solutions. Lithium is undoubtedly the largest branch of the business, accounting for 42% of the US$3.3B in net sales for the 2021 calendar year. \r\nAt a current output of 88,000 metric tons of LCE per year, Albemarle asserts itself as a dominant player in the lithium market at 16% total market share. The company is poised to continue in a strong market popsition with plans expand processing infrastructure in 2022 and with the long-term goal of more than doubling their lithium production capacity. With this expansion pipeline, they'll be targeting low-cost juristictions to reduce capital expenditure and impove returns.\n\nHere are where we see Albemarle’s competitive advantage lay:\n\nProject feasibility. Albemarle has proved it can already economically produce battery grade lithium in a period where lithium prices were much lower, illustrating the company’s ability to continue operations should lithium prices fall. Ability to be self-funded. Albemarle's lithium branch is already profit making, so earnings can be retained and capital can be invested into the aforementioned expansion projects without the need for significant capital raises or taking on large amounts of debt. Smaller companies and emerging players will have to undergo financing stages which carry risks and may result in shareholder dilution.\n\nStory continues\n\nAlbemarle has a firm grasp on the market and seems positioned to continue riding this lithium wave from strength to strength. But these factors don’t paint the full picture and investors should always consider the financials of a company to inform their assessment. You can see our analysis of Albemarle’s financials for free on our website .\n\nSociedad Química y Minera de Chile (NYSE:SQM)\n\nSociedad Química y Minera de Chile (SQM) stands as the NYSE’s other lithium giant. Producing 101,000 metric tons of LCE during 2021, SQM’s impressive output accounts for 18.7% of global lithium production for the year and with several project expansions in the works, this output will continue to scale with the market demand.\n\nAccording to SQM’s latest earnings report, 2022 sales estimates top out at 140,000 metric tons of lithium, with capacity potentially reaching 190,000-200,000 should expansion projects be completed in time, and dependant on the market demand for lithium.\n\nHere are the key factors driving the company forward in the next few years:\n\nSignificant Expansion pipeline. With SQM’s joint venture in Mt Holland expecting to enter production in 2024 and a drastic increase to the production capabilities of their Salar del Carmen project, there’s ample opportunity for the company to grow their presence in the market and beat out new entrants. Variable exposure to lithium prices. Looking forward to 2022, SQM’s sales contracts are detailed as follows: 20% fixed or variable price, 50% variable price with a ceiling and 30% not contracted. This means that SQM will still be exposed to the increase in lithium prices on previously negotiated contracts even if the price of lithium was lower at the time the contract was agreed upon, opening the company up to increased revenues.\n\nInvestors should always consider the risks and financial health of a company to inform their investment decision. You can see our rundown of SQM’s risks and financials for free on our website .\n\nLivent Corporation (NYSE:LTHM)\n\nLivent’s premier resource is located in Salar Del Hombre Muerto in Argentina, achieving a reasonable current output of 27,000 metric tons of Lithium Carbonate and Lithium Chloride. While this is modest in comparison to the big players in the sector, expansion is at the forefront of the company’s mission, with a 20,0000 metric tons expansion of their Argentinian operation slated for 2023 and a further 20,000 metric tons anticipated for 2025.\n\nLivent’s production figures account for around 5% of the total market share. While this lags the other two companies, Livent’s key focus on cost leadership within the production of LCE, Lithium Hydroxide and Lithium Chloride should provide an advantage over its peers.\n\nThese are the factors that are important to the performance of Livent:\n\nLow cost focus. High lithium prices can make many more projects economically feasible, but striving for lower operating costs will mean a project can weather the storm if demand and prices fall. By securing a low-impurity lithium resource, Livent has allowed processing costs to be cut, giving a competitive advantage over other brine operations. Exposure to Lithium Carbonate, Lithium Chloride and Lithium Hydroxide prices. New high-density batteries are more compatible with lithium hydroxide owing to greater nickel content in the cathodes. Should primary lithium demand switch from carbonate to hydroxide, Livent’s exposure to the prices in both products should help it navigate pricing volatility.\n\nLivent is a smaller company and that does carry some possible risks. Investors who are interested in finding out more can do so for free on our website .\n\nThe Future Prospects\n\nWhen you take a step back and look at the global lithium sector, you begin to see a trend. Most supply comes from a select few companies, leaving a mass of newcomers are scrambling to secure funding to bring their projects to market. After all, there’s no shortage of lithium resources on Earth, just a shortage of processing power to extract it from the ground and refine it. New companies coming to the table will reach maturity and begin reaping the rewards of their capital investments. These next few companies aren’t generating significant revenues but we believe they’ll be ones to watch.\n\nLithium Americas Corp. (NYSE:LAC)\n\nLithium Americas is an emerging player in the sector. Their flagship project is their Cauchari-Olaroz brine resource in Argentina, which is currently 85% through the construction of its Stage 1 production facility, targeting 40,000 metric tons per annum (tpa) of battery-grade lithium carbonate. Lithium Americas is striving for cost leadership, forecasting operating expenditure of US$3,600 per metric tonne. With a project life of 40 years and a second stage expansion already on the cards, there is plenty to keep investors following their developments closely.\n\nHere are some of the Lithium Americas’ most eye-catching features:\n\nCompleted acquisition of Millennial Lithium in January 2022. Lithium Americas now has 100% ownership of the advanced-stage Pastos Grandes project, which is located nearby to their Caucharí-Olaroz tenements. The transaction was completed for around US$400 million and provides Lithium Americas with exposure to a rich brine resource of 4.1 million metric tonnes of LCE. Continued development of Thacker Pass resource. Lithium Americas has a 100% stake in one of the largest resources in the United States. The project’s feasibility study is due in the second half of 2022, targeting 40,000 tpa of lithium carbonate, with scenarios being assessed for expansion up to a total of 80,0000 tpa. Preparation work to begin construction of the initial infrastructure is set to commence in 2022.\n\nFor those who are eager to find out more, you can do so by taking a look at the future growth section in our company report for Lithium Americas on our website .\n\nPiedmont Lithium Inc. (NASDAQ:PLL)\n\nPiedmont Lithium Inc. is a lithium company looking to develop key strategic assets in North Carolina, Quebec and Ghana. With a consolidated enterprise targeting 60,000 tonnes of LiOH per year and an additional 390,000 tonnes per year in spodumene concentrate (SC6) production, Piedmont is looking to become a significant player in America’s shift to newer energy initiatives.\n\nHere is why Piedmont Lithium’s future may become interesting:\n\nEntered into a binding agreement with Tesla Inc. (NASDAQ:TSLA) to supply spodumene concentrate from their North Carolina project. The agreement is for an initial five-year term on a fixed price commitment representing one-third of Piedmont’s planned production from their North Carolina project. Deliveries planned to begin between July 2022 and July 2023, but timeline has been postponed indefinitely due to delays in development. The Carolina project offers industry leading sustainability with close proximity to a key target market. Piedmont owns 100% of the project which is set to lead the way in terms of cost and sustainability, offering much lower direct water usage in the processing of lithium hydroxide, requiring only 6,300 gallons per tonne of LiOH. Compare this to Chilean projects in the Atacama region which need up to 124,000 gallons of water per tonne, it’s clear to see where the benefits lay for Piedmont as water scarcity continues to be a frequent discussion point into the future.\n\nIf you’re looking to find out about the growth estimates for Piedmont Lithium Inc. (NASDAQ:PLL), we encourage you to take a deep dive into our coverage of analysts’ estimates for the company in our company report .\n\nStandard Lithium Ltd. (NYSE:SLI)\n\nStandard Lithium Ltd. is a steadily growing lithium prospect, headquartered out of Vancouver, Canada. Touting itself as “America’s 21st Century lithium company”, Standard Lithium vows to be the answer to the question of lithium supply but within an innovative context. Partnering with chemical major LANXESS AG (ETR:LXS) , the company is planning to implement ground-breaking technology and leverage their class leading resource to help them rise to the top of the lithium game.\n\nHere are some points of interest to kick-start your research into Standard Lithium:\n\nAbility to fast-track commercial brine operations using existing brine operations. Standard lithium is able to piggy-back its operations off of LANXESS’ existing bromine extraction facility, negating the need for exorbitant capital expenditure that other companies of similar size will have to go through. First to market with a revolutionary extraction process. Standard Lithium has developed its own direct lithium extraction (DLE) process called LiSTR. The company promotes this proprietary process as being able to deliver increased recovery efficiency when compared to traditional evaporation methods and a smaller environmental footprint. The most valuable part of this process is that it is scalable, modular and able to be bolted on the LANXESS’ existing bromine infrastructure, allowing Standard Lithium to bring their lithium to market more quickly than competitors.\n\nFor those that appreciate the future merits of Standard Lithium Ltd. (NYSE:SLI) and wish to know more about the company’s current financial health can do so by heading to the company report on our website.\n\nThe Bottom Line\n\nWith expansion on the horizon for all of these companies, it appears that they’re all well positioned to tackle the impending energy revolution. But this shift to cleaner energy isn’t just going to impact lithium companies. Energy production, storage and personal transportation industries are primed to undergo rapid change as fossil fuels are phased out, paving the way for innovation. We encourage you to check out our list of the largest automakers from around the globe to see if you can identify the key players that will adapt to the changing landscape.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nSimply Wall St analyst Bailey and Simply Wall St have no position in any of the companies mentioned. This article is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.","link":"https:\/\/finance.yahoo.com\/news\/albemarle-tops-list-lithium-stocks-032435910.html","symbols":["ALB.US","AMC.F","LAC.US","LTHM.US","PLL.US","SLI.US","SQM.US","TSLA.US"],"tags":["ALBEMARLE CORPORATION","LCE","LITHIUM AMERICAS","LITHIUM CARBONATE","LITHIUM CHLORIDE","LITHIUM HYDROXIDE","METRIC TONS"],"sentiment":{"polarity":0.999,"neg":0.024,"neu":0.878,"pos":0.098}},{"date":"2022-05-11T21:45:09+00:00","title":"SQM (SQM) Gains As Market Dips: What You Should Know","content":"SQM (SQM) closed at $75.56 in the latest trading session, marking a +1.45% move from the prior day. This change outpaced the S&P 500's 1.65% loss on the day. Elsewhere, the Dow lost 1.02%, while the tech-heavy Nasdaq added 0.16%.\n\nHeading into today, shares of the chemicals company had lost 9.79% over the past month, outpacing the Basic Materials sector's loss of 14.31% and the S&P 500's loss of 10.86% in that time.\n\nInvestors will be hoping for strength from SQM as it approaches its next earnings release. On that day, SQM is projected to report earnings of $1.23 per share, which would represent year-over-year growth of 373.08%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $1.28 billion, up 142.89% from the year-ago period.\n\nLooking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $6.11 per share and revenue of $5.89 billion. These totals would mark changes of +198.05% and +105.84%, respectively, from last year.\n\nAny recent changes to analyst estimates for SQM should also be noted by investors. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\n\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 5.79% higher within the past month. SQM is currently sporting a Zacks Rank of #1 (Strong Buy).\n\nInvestors should also note SQM's current valuation metrics, including its Forward P\/E ratio of 12.19. This represents a premium compared to its industry's average Forward P\/E of 5.81.\n\nStory continues\n\nAlso, we should mention that SQM has a PEG ratio of 0.3. This popular metric is similar to the widely-known P\/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. SQM's industry had an average PEG ratio of 0.67 as of yesterday's close.\n\nThe Fertilizers industry is part of the Basic Materials sector. This industry currently has a Zacks Industry Rank of 2, which puts it in the top 1% of all 250+ industries.\n\nThe Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nBe sure to follow all of these stock-moving metrics, and many more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/sqm-sqm-gains-market-dips-214509882.html","symbols":["QYM.F","SQM.US"],"tags":["ESTIMATE REVISIONS","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.992,"neg":0.028,"neu":0.864,"pos":0.109}},{"date":"2022-05-09T15:44:22+00:00","title":"The Return Trends At Diodes (NASDAQ:DIOD) Look Promising","content":"If you're not sure where to start when looking for the next multi-bagger, there are a few key trends you should keep an eye out for. Ideally, a business will show two trends; firstly a growing return on capital employed (ROCE) and secondly, an increasing amount of capital employed. If you see this, it typically means it's a company with a great business model and plenty of profitable reinvestment opportunities. With that in mind, we've noticed some promising trends at Diodes (NASDAQ:DIOD) so let's look a bit deeper.\n\nUnderstanding Return On Capital Employed (ROCE)\n\nFor those who don't know, ROCE is a measure of a company's yearly pre-tax profit (its return), relative to the capital employed in the business. The formula for this calculation on Diodes is:\n\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n\n0.19 = US$320m ÷ (US$2.2b - US$463m) (Based on the trailing twelve months to March 2022).\n\nSo, Diodes has an ROCE of 19%.  In absolute terms, that's a satisfactory return, but compared to the Semiconductor industry average of 14% it's much better.\n\nSee our latest analysis for Diodes  roce\n\nAbove you can see how the current ROCE for Diodes compares to its prior returns on capital, but there's only so much you can tell from the past. If you'd like, you can check out the forecasts from the analysts covering Diodes here  for free.\n\nWhat Does the ROCE Trend For Diodes Tell Us?\n\nWe like the trends that we're seeing from Diodes. Over the last five years, returns on capital employed have risen substantially to 19%. Basically the business is earning more per dollar of capital invested and in addition to that, 26% more capital is being employed now too. This can indicate that there's plenty of opportunities to invest capital internally and at ever higher rates, a combination that's common among multi-baggers.\n\nThe Bottom Line\n\nA company that is growing its returns on capital and can consistently reinvest in itself is a highly sought after trait, and that's what Diodes has. And with the stock having performed exceptionally well over the last five years, these patterns are being accounted for by investors. In light of that, we think it's worth looking further into this stock because if Diodes can keep these trends up, it could have a bright future ahead.\n\nStory continues\n\nOn a final note, we've found  2 warning signs for Diodes that we think you should be aware of.\n\nFor those who like to invest in solid companies, check out this freelist of companies with solid balance sheets and high returns on equity.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.","link":"https:\/\/finance.yahoo.com\/news\/return-trends-diodes-nasdaq-diod-154422772.html","symbols":["DDQ.F","DIOD.US","SQM.US"],"tags":["BUSINESS MODEL","CAPITAL EMPLOYED","DIODES","PROMISING TRENDS","ROCE"],"sentiment":{"polarity":0.993,"neg":0.014,"neu":0.883,"pos":0.102}},{"date":"2022-05-06T11:37:54+00:00","title":"Sociedad Química y Minera de Chile S.A.'s (NYSE:SQM) Stock On An Uptrend: Could Fundamentals Be Driving The Momentum?","content":"Sociedad Química y Minera de Chile (NYSE:SQM) has had a great run on the share market with its stock up by a significant 51% over the last three months. We wonder if and what role the company's financials play in that price change as a company's long-term fundamentals usually dictate market outcomes. In this article, we decided to focus on Sociedad Química y Minera de Chile's  ROE.\n\nReturn on equity or ROE is an important factor to be considered by a shareholder because it tells them how effectively their capital is being reinvested. In simpler terms, it measures the profitability of a company in relation to shareholder's equity.\n\nView our latest analysis for Sociedad Química y Minera de Chile\n\nHow To Calculate Return On Equity?\n\nROE can be calculated by using the formula:\n\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\n\nSo, based on the above formula, the ROE for Sociedad Química y Minera de Chile is:\n\n18% = US$592m ÷ US$3.2b (Based on the trailing twelve months to December 2021).\n\nThe 'return' is the amount earned after tax over the last twelve months. So, this means that for every $1 of its shareholder's investments, the company generates a profit of $0.18.\n\nWhat Has ROE Got To Do With Earnings Growth?\n\nThus far, we have learned that ROE measures how efficiently a company is generating its profits. Depending on how much of these profits the company reinvests or \"retains\", and how effectively it does so, we are then able to assess a company’s earnings growth potential. Generally speaking, other things being equal, firms with a high return on equity and profit retention, have a higher growth rate than firms that don’t share these attributes.\n\nSociedad Química y Minera de Chile's Earnings Growth And 18% ROE\n\nTo begin with, Sociedad Química y Minera de Chile seems to have a respectable ROE. Further, the company's ROE is similar to the industry average of 16%. For this reason, Sociedad Química y Minera de Chile's five year net income decline of 6.5% raises the question as to why the decent ROE didn't translate into growth. Based on this, we feel that there might be other reasons which haven't been discussed so far in this article that could be hampering the company's growth. Such as, the company pays out a huge portion of its earnings as dividends, or is faced with competitive pressures.\n\nStory continues\n\nThat being said, we compared Sociedad Química y Minera de Chile's performance with the industry and were concerned when we found that while the company has shrunk its earnings, the industry has grown its earnings at a rate of 7.3% in the same period. past-earnings-growth\n\nThe basis for attaching value to a company is, to a great extent, tied to its earnings growth. The investor should try to establish if the expected growth or decline in earnings, whichever the case may be, is priced in. This then helps them determine if the stock is placed for a bright or bleak future. If you're wondering about Sociedad Química y Minera de Chile's's valuation, check out this gauge of its price-to-earnings ratio, as compared to its industry.\n\nIs Sociedad Química y Minera de Chile Using Its Retained Earnings Effectively?\n\nSociedad Química y Minera de Chile has a high three-year median payout ratio of 89% (that is, it is retaining 11% of its profits). This suggests that the company is paying most of its profits as dividends to its shareholders. This goes some way in explaining why its earnings have been shrinking. With only a little being reinvested into the business, earnings growth would obviously be low or non-existent. To know the 3 risks we have identified for Sociedad Química y Minera de Chile visit our risks dashboard for free.\n\nMoreover, Sociedad Química y Minera de Chile has been paying dividends for at least ten years or more suggesting that management must have perceived that the shareholders prefer dividends over earnings growth. Existing analyst estimates suggest that the company's future payout ratio is expected to drop to 68% over the next three years. As a result, the expected drop in Sociedad Química y Minera de Chile's payout ratio explains the anticipated rise in the company's future ROE to 69%, over the same period.\n\nConclusion\n\nOn the whole, we do feel that Sociedad Química y Minera de Chile has some positive attributes. However, while the company does have a high ROE, its earnings growth number is quite disappointing. This can be blamed on the fact that it reinvests only a small portion of its profits and pays out the rest as dividends. With that said, we studied the latest analyst forecasts and found that while the company has shrunk its earnings in the past, analysts expect its earnings to grow in the future. Are these analysts expectations based on the broad expectations for the industry, or on the company's fundamentals? Click here to be taken to our analyst's forecasts page for the company.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.","link":"https:\/\/finance.yahoo.com\/news\/sociedad-qu-mica-y-minera-113754939.html","symbols":["DDQ.F","DIOD.US","QYM.F","SQM.US"],"tags":["CHILE","EARNINGS GROWTH","ROE","SOCIEDAD QUíMICA Y MINERA DE CHILE"],"sentiment":{"polarity":0.997,"neg":0.024,"neu":0.868,"pos":0.108}},{"date":"2022-05-05T21:45:09+00:00","title":"SQM (SQM) Stock Moves -0.02%: What You Should Know","content":"SQM (SQM) closed at $80.27 in the latest trading session, marking a -0.02% move from the prior day. This change was narrower than the S&P 500's daily loss of 3.57%. Elsewhere, the Dow lost 3.12%, while the tech-heavy Nasdaq lost 0.4%.\n\nPrior to today's trading, shares of the chemicals company had lost 5.54% over the past month. This has was narrower than the Basic Materials sector's loss of 6.07% and the S&P 500's loss of 6.12% in that time.\n\nInvestors will be hoping for strength from SQM as it approaches its next earnings release. In that report, analysts expect SQM to post earnings of $1.23 per share. This would mark year-over-year growth of 373.08%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $1.28 billion, up 142.89% from the year-ago period.\n\nLooking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of $6.11 per share and revenue of $5.89 billion. These totals would mark changes of +198.05% and +105.84%, respectively, from last year.\n\nAny recent changes to analyst estimates for SQM should also be noted by investors. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\n\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 5.79% higher within the past month. SQM is holding a Zacks Rank of #1 (Strong Buy) right now.\n\nLooking at its valuation, SQM is holding a Forward P\/E ratio of 13.14. This represents a premium compared to its industry's average Forward P\/E of 7.18.\n\nStory continues\n\nMeanwhile, SQM's PEG ratio is currently 0.32. This popular metric is similar to the widely-known P\/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. SQM's industry had an average PEG ratio of 0.84 as of yesterday's close.\n\nThe Fertilizers industry is part of the Basic Materials sector. This group has a Zacks Industry Rank of 5, putting it in the top 2% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nTo follow SQM in the coming trading sessions, be sure to utilize Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/sqm-sqm-stock-moves-0-214509805.html","symbols":["QYM.F","SQM.US"],"tags":["ESTIMATE REVISIONS","STRONG BUY","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.992,"neg":0.025,"neu":0.867,"pos":0.108}},{"date":"2022-05-05T10:21:10+00:00","title":"AdvanSix Inc. (ASIX) to Report Q1 Earnings: What's in Store?","content":"AdvanSix Inc. ASIX is scheduled to report first-quarter 2022 results before the opening bell on May 6.\r\n\r\nThe company surpassed the Zacks Consensus Estimate for earnings in three of the last four quarters while missed once. It has a trailing four-quarter earnings surprise of roughly 23.6%, on average. It posted a negative earnings surprise of around 1.2% in the last reported quarter. The company’s first-quarter results are likely to reflect strong demand across a number of end markets, growth of its differentiated products and higher prices.\r\n\r\nThe stock has rallied 47.5% in the past year compared with the industry’s 19.3% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLet’s see how things are shaping up for this announcement.\n\nWhat Do the Estimates Say?\n\nThe Zacks Consensus Estimate for first-quarter consolidated revenues for AdvanSix is currently pegged at $482 million, which calls for a rise of around 28% year over year.\n\nSome Factors at Play\n\nThe company is expected to have benefited from healthy end-market demand and growth of its differentiated products in the quarter to be reported. It is seeing a recovery in demand across a number of markets including automotive, building & construction, electronics and packaging and is also gaining from strong agricultural industry fundamentals. Favorable market conditions and tight industry supply are likely to have supported demand for nylon in North America. Strong demand for chemical intermediates is also likely to have continued across a number of markets in the March quarter.\r\n\r\nHigher demand for its product lines is expected to have supported its volumes in the first quarter. Higher prices are also expected to have driven its top line. However, the company is likely to have faced headwinds from higher raw material costs and supply-chain disruptions in the quarter to be reported.\n\nAdvanSix Price and EPS Surprise AdvanSix Price and EPS Surprise\n\nAdvanSix price-eps-surprise | AdvanSix Quote\n\nZacks Model\n\nOur proven model does not conclusively predict an earnings beat for AdvanSix this season. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of an earnings beat. But that’s not the case here.\r\n\r\nEarnings ESP: Earnings ESP for AdvanSix is 0.00%. The Zacks Consensus Estimate for earnings for the first quarter is currently pegged at $1.74. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\r\n\r\nZacks Rank: AdvanSix currently carries a Zacks Rank #1.\n\nStory continues\n\nStocks That Warrant a Look\n\nHere are some companies in the basic materials space you may want to consider as our model shows these have the right combination of elements to post an earnings beat this quarter:\r\n\r\nSociedad Quimica y Minera de Chile S.A. SQM, slated to release earnings on May 18, has an Earnings ESP of 29.73% and carries a Zacks Rank #1. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe consensus estimate for Sociedad Quimica’s first-quarter earnings has been revised 55.7% upward in the past 60 days. The Zacks Consensus Estimate for SQM’s earnings for the quarter is pegged at $1.23.\r\n\r\nEndeavour Silver Corp. EXK, scheduled slated to release earnings on May 11, has an Earnings ESP of 4.35% and carries a Zacks Rank #3.\r\n\r\nThe consensus estimate for Endeavour Silver’s first-quarter earnings has been revised 20% upward in the past 60 days. The Zacks Consensus Estimate for EXK’s earnings for the quarter is pegged at 6 cents.\r\n\r\nGrowGeneration Corp. GRWG, scheduled to release earnings on May 10, has an Earnings ESP of +14.63% and carries a Zacks Rank #3.\r\n\r\nThe Zacks Consensus Estimate for GrowGeneration’s first-quarter earnings has been revised 4.8% upward over the past 60 days. The Zacks Consensus Estimate for GRWG’s earnings for the quarter is currently pegged at a loss of 8 cents.\r\n\r\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n\r\nEndeavour Silver Corporation (EXK) : Free Stock Analysis Report\r\n\r\nAdvanSix (ASIX) : Free Stock Analysis Report\r\n\r\nGrowGeneration Corp. (GRWG) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/advansix-inc-asix-report-q1-102110767.html","symbols":["960.F","ASIX.US","QYM.F","SQM.US"],"tags":["ADVANSIX","CONSENSUS ESTIMATE","EARNINGS SURPRISE","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.995,"neg":0.026,"neu":0.871,"pos":0.102}},{"date":"2022-05-04T23:00:00+00:00","title":"3 Impressive Lithium Stocks Flying Under Wall Street’s Radar","content":"Over the past few months, oil and commodity markets have been taking out fresh highs after the shuttering of Ukrainian ports, sanctions against Russia, and disruption in Libyan oil production sent energy, crop, and metal buyers scrambling for replacement supplies. Russia is one of the world's biggest exporters of key raw materials, from crude oil and gas to wheat and aluminum, and the possible exclusion of supplies from the country due to sanctions has sent traders and importers into a frenzy.\n\nBase metals prices have been coming off recent highs (and in the case of aluminum, copper and tin, all-time highs) set earlier in the month that were spurred by fears over the potential for disruption to Russia’s metal exports following its invasion of Ukraine. Broad-based supply concerns remain, ranging from the potential for sanctions targeting exports, to actual output disruption and logistical dislocations (see ‘Implications of the Russia-Ukraine crisis for metals’ for details).\n\nBut the Ukraine crisis is only layering onto another more powerful trend: the global transition to low-carbon energy.\n\nThe energy transition is driving the next commodity supercycle, with immense prospects for technology manufacturers, energy traders, and investors. Clean energy technologies require more metals than their fossil fuel-based counterparts, with prices of green metals projected to reach historical peaks for an unprecedented, sustained period in a net-zero emissions scenario.\n\nBut few, if any, green metals have witnessed a price explosion as epic as that of lithium.\n\nAfter more than quadrupling in value last year, lithium carbonate continues to soar in 2022 according to Benchmark Mineral Intelligence.\n\nThe rally in lithium hydroxide, used in high-nickel content cathode manufacture, is accelerating, up 120% so far this year, narrowing the discount to lithium carbonate, which historically is priced below hydroxide.\n\nBenchmark says that Chinese inventory levels for hydroxide, carbonate, and spodumene feedstock remain very low, sustaining the high price environment. Many investors who got burned by the last lithium price bust of 2018 have probably been watching on the sidelines, not sure what to make of the current mega-rally.\n\nStory continues\n\nRelated: Norway Plans Record Gas Volumes For Europe\n\nTo be fair, China's spot market, where small tonnages can have big price impacts, may be accentuating the scale of this mega-rally, but make no mistake about it: this is no false flag, with everything from mined spodumene to high-purity hydroxide, and every component of the lithium processing chain experiencing a wild price surge. The price explosion tells you that lithium supply is simply nowhere near enough to feed this demand surge.\n\nWith earnings season here with us again,  the famous lithium trio of Sociedad Química y Minera de Chile S.A. (NYSE:SQM), FMC Corporation (NYSE:FMC) and Albermale (NYSE:ALB) will be heavily scrutinized. However, only SQM has really impressed with a 51.4% return so far this year, with FMC and ALB returning 9.9% and -12.7%, respectively, over the timeframe. The three companies are some of the largest in the business, with SQM boasting a $21.1B market cap, FMC is worth $16.7B while ALB is valued at $22.6B.\n\nLuckily, scores of lithium juniors have been responding more readily to the lithium price boom. Here are some that have been outstanding so far this year.\n\n#1. Lithium Energy Exploration Inc.\n\nMarket Cap: $14.7M\n\nYTD Returns: 328.6%\n\nHeadquartered in Toronto, Canada, Lithium Energi Exploration Inc. (OTCPK:LXENF)(TSXV:LEXI) engages in the acquisition, exploration, and development of lithium brine assets in Argentina. The company holds interests in the Laguna Caro project that includes eight mineral concessions covering approximately 17,759 hectares; the Antofalla North project that consists of thirteen mineral concessions covering approximately 41,496 hectares; and the Antofalla South project that includes eighteen mineral concessions covering 69,112 hectares in Argentina.\n\nIncorporated in 1998, Lithium Energi was formerly known as Portola Resources Inc. and changed its name to Lithium Energi Exploration Inc. in March 2017.\n\nBack in January, Lithium Energi Exploration announced that, under its JV Agreement with Global Oil Management Group, LLC (\"GOMG\"), implementation of exploration and development plans have been accelerating rapidly.\n\nLEXI reported that it’s a  20% non-dilutable stakeholder in the JV and that development is slated to commence immediately, with the Sorcia Group owning the exclusive license to utilize the International Battery Metals Ltd’s (OTCPK:BATF) technology in Argentina and Chile. IBAT further stated that it has substantially completed the construction of its first lithium extraction unit and the system modules are currently being heat traced and insulated with final assembly and testing to take place in March in the U.S. prior to deployment to South America.\n\nRelated: Oil Prices Hit $110 As Europe Prepares To Ban Russian Crude\n\n#2. Sayona Mining Limited\n\nMarket Cap: $1.6B\n\nYTD Returns: 111.1%\n\nPaddington, Australia-based Sayona Mining Limited (OTCQB:SYAXF), together with its subsidiaries, engages in mineral exploration and development in Australia and Canada. The company explores for lithium, graphite, and gold deposits. Its flagship project is the Authier Lithium Project located in Quebec, Canada. The company also holds a 60% interest in the Moblan lithium project located in Northern Québec.\n\nLast year, Sayona Mining reported that the Superior Court of Quebec approved its joint bid with Piedmont Lithium (NASDAQ:PLL) for the acquisition of North American Lithium, which owns a previously producing lithium project near Sayona's core Authier project.\n\nMore than $400M had been spent on the project, which was operational and ramping toward nameplate production in 2018 but then was placed on care and maintenance due to weak lithium markets and a shaky capital structure.\n\nSayona and Piedmont say they are proceeding with technical studies that would prepare for the integration of Sayona's Authier and Tansim projects with the facilities at NAL.\n\n#3. Frontier Lithium Inc.\n\nMarket Cap: $578.6M\n\nYTD Returns: 76.1%\n\nVal Caron, Canada-based Frontier Lithium Inc. (OTCQX:LITOF) engages in the acquisition, exploration, and development of mining properties in Canada. The company primarily holds a 100% interest in the PAK Lithium project, which covers 1,378 contiguous mining claim units totaling 26,774 hectares located in northwestern Ontario, Canada.\n\nFrontier has forged a strategic partnership agreement with XPS Expert Process Solutions to develop a process to refine spodumene concentrate into lithium hydroxide. Further, Frontier Lithium owns 100% of the PAK Lithium Project, located in northwestern Ontario. This is a very high-grade spodumene resource with low iron and low impurities. The PEA post-tax NPV8% is estimated at US$974.6m based on producing 23,174tpa LiOH.\n\nBy Alex Kimani for Oilprice.com\n\nMore Top Reads From Oilprice.com:\n\nThe U.S. Shale Patch Is Facing A Plethora Of Problems  Europe May Lose The Energy Transition Race Before It Really Begins  Upstream Oil Industry To See Highest Profits Ever In 2022\n\nRead this article on OilPrice.com","link":"https:\/\/finance.yahoo.com\/news\/3-impressive-lithium-stocks-flying-230000351.html","symbols":["ALB.US","AMC.F","CL.COMM","FMC.US","FMQ.F","GC.COMM","HG.COMM","KW.COMM","PLL.US","QYM.F","SQM.US","SYA.AU","ZG.COMM"],"tags":["CLEAN ENERGY TECHNOLOGIES","FMC CORPORATION","LITHIUM CARBONATE","LITHIUM HYDROXIDE","SANCTIONS AGAINST RUSSIA"],"sentiment":{"polarity":0.995,"neg":0.05,"neu":0.847,"pos":0.103}},{"date":"2022-05-04T20:05:00+00:00","title":"Diodes Incorporated Reports Record First Quarter Fiscal 2022 Financial Results","content":"Achieves Record Revenue for 6th Consecutive Quarter and Record Gross Margin of 40.8%, Driving Record Profits from Operations and EPS\n\nPLANO, Texas, May 04, 2022--(BUSINESS WIRE)--Diodes Incorporated (Diodes) (Nasdaq: DIOD) today reported its financial results for the first quarter ended March 31, 2022.\n\nFirst Quarter Highlights\n\nAnnounced the proposed acquisition of the onsemi wafer fabrication facility, which is expected to close in late second quarter of 2022; Revenue was a record $482.1 million, increasing 16.7 percent from $413.1 million in the first quarter 2021 and 0.4 percent from $480.2 million in the fourth quarter 2021; GAAP gross profit was a record $196.7 million, increasing 41.9 percent from $138.6 million in the first quarter 2021 and 3.1 percent from $190.7 million in the fourth quarter 2021; GAAP gross profit margin was a record 40.8 percent, an increase of 720 basis points from the 33.6 percent in the first quarter 2021 and 110 basis points from the 39.7 percent in the fourth quarter 2021; GAAP net income was a record $72.7 million, compared to $39.5 million in the first quarter 2021 and $65.5 million in the fourth quarter 2021; Non-GAAP adjusted net income was a record $80.3 million, compared to $42.0 million in the first quarter 2021 and $73.3 million in the fourth quarter 2021; GAAP EPS was a record $1.59 per diluted share, an 82.8 percent improvement from the $0.87 per diluted share in the first quarter 2021 and a 11.2 percent increase compared to $1.43 per diluted share in the fourth quarter 2021; Non-GAAP EPS was a record $1.75 per diluted share, an 88.2 percent improvement from the $0.93 per diluted share in the prior year quarter and a 9.4 percent increase from the $1.60 per diluted share last quarter; Excluding $6.4 million, net of tax, of non-cash share-based compensation expense, both GAAP and non-GAAP earnings per share would have increased by $0.14 per diluted share; EBITDA was $118.2 million, or 24.5 percent of revenue, compared to $81.7 million, or 19.8 percent of revenue, in the first quarter 2021 and $139.0 million, or 28.9 percent of revenue, in the fourth quarter 2021; and Achieved cash flow from operations of $72.3 million and $33.8 million of free cash flow, including $38.5 of capital expenditures. Net cash flow was a negative $60.8 million, including the pay down of $67.6 million of debt, capital expenditures and a deposit on the proposed acquisition of the onsemi facility.\n\nCommenting on the results, Dr. Keh-Shew Lu, Chairman, President and Chief Executive Officer, stated, \"The first quarter represented a continuation of outstanding execution by the Diodes team, especially considering this quarter is typically down seasonally and the recent COVID-related lockdowns in China, most notably in the Shanghai area. We once again set new records across key financial metrics, including the 6th consecutive quarter of record revenue and gross profit, record gross margin that exceeded 40% for the first time in the Company’s history, and the 5th consecutive quarter of record non-GAAP earnings per share.\n\nStory continues\n\n\"Our strong revenue and margin performance continues to be driven by records achieved in the automotive end market, which reached 13% of revenue, the industrial market, as well as for our Pericom products. Gross margin expanded 720 basis points year-over-year due to a greater mix of higher margin products along with expanded factory utilization and loading. Another key factor to our ongoing success has been our content expansion initiatives and our total solution sales approach, resulting in expanded customer relationships and increasing design win momentum. And when combined with our diligent expense management, we delivered an almost 90% increase in adjusted earnings per share over the prior year period.\n\n\"Looking forward, we are well positioned with a global manufacturing footprint, including the proposed addition of the onsemi South Portland, Maine facility, which will greatly increase our internal capacity to support our future growth, especially in the automotive and industrial end markets. Demand for our products remains at high levels across all target end markets and geographies, and we are guiding for our 9th consecutive quarter of revenue growth and our 7th consecutive quarter of record revenue in the second quarter and also anticipating another solid year of strong growth and profitability for Diodes.\"\n\nFirst Quarter 2022\n\nRevenue for first quarter 2022 was a record $482.1 million, increasing 16.7 percent from $413.1 million in the first quarter 2021 and 0.4 percent from $480.2 million in the fourth quarter 2021.\n\nGAAP gross profit for the first quarter 2022 was a record $196.7 million, or a record 40.8 percent of revenue, increasing from $138.6 million, or 33.6 percent of revenue, in the first quarter of 2021 and $190.7 million, or 39.7 percent of revenue, in the fourth quarter 2021.\n\nGAAP operating expenses for first quarter 2022 were $103.6 million, or 21.5 percent of revenue, and on a non-GAAP basis were $99.5 million, or 20.6 percent of revenue, which excludes $3.9 million of amortization of acquisition-related intangible asset expenses and $0.3 million of acquisition-related costs. GAAP operating expenses in the first quarter 2021 were $91.2 million, or 22.1 percent of revenue, and in the fourth quarter 2021 were $104.7 million, or 21.8 percent of revenue.\n\nFirst quarter 2022 GAAP net income was a record $72.7 million, or $1.59 per diluted share, compared to GAAP net income in the first quarter 2021 of $39.5 million, or $0.87 per diluted share, and GAAP net income of $65.5 million, or $1.43 per diluted share, in the fourth quarter 2021.\n\nFirst quarter 2022 non-GAAP adjusted net income was a record $80.3 million, or $1.75 per diluted share, which excluded, net of tax, $4.2 million non-cash mark-to-market adjustment of investments, $3.2 million of acquisition-related intangible asset costs and $0.2 million of acquisition-related costs. This compares to non-GAAP adjusted net income of $42.0 million, or $0.93 per diluted share, in the first quarter 2021 and $73.3 million, or $1.60 per diluted share, in the fourth quarter 2021.\n\nThe following is an unaudited summary reconciliation of GAAP net income to non-GAAP adjusted net income and per share data, net of tax (in thousands, except per share data):\n\nThree Months Ended March 31, 2022 GAAP net income $ 72,691 GAAP diluted earnings per share $ 1.59 Adjustments to reconcile net income to non-GAAP net income: Amortization of acquisition-related intangible assets 3,156 Acquisition-related costs 218 Non-cash mark-to-market investment adjustments 4,245 Non-GAAP net income $ 80,310 Non-GAAP diluted earnings per share $ 1.75\n\nNote: Throughout this release, we refer to \"net income attributable to common stockholders\" as \"net income.\"\n\n(See the reconciliation tables of GAAP net income to non-GAAP adjusted net income near the end of this release for further details.)\n\nIncluded in first quarter 2022 GAAP net income and non-GAAP adjusted net income was approximately $6.4 million, net of tax, of non-cash share-based compensation expense. Excluding share-based compensation expense, both GAAP earnings per share (\"EPS\") and non-GAAP adjusted EPS would have increased by $0.14 per diluted share for the first quarter 2022, $0.11 for first quarter 2021 and $0.14 for the fourth quarter 2021.\n\nEBITDA (a non-GAAP measure), which represents earnings before net interest expense, income tax, depreciation and amortization, in first quarter 2022 was $118.2 million, or 24.5 percent of revenue, increasing from $81.7 million, or 19.8 percent of revenue, in first quarter 2021 and $139.0 million, or 28.9 percent of revenue, in fourth quarter 2021. For a reconciliation of GAAP net income to EBITDA, see the table near the end of this release for further details.\n\nFor first quarter 2022, net cash provided by operating activities was $72.3 million. Net cash flow was a negative $60.8 million, including the pay down of $67.6 million of debt, capital expenditures and a deposit on the proposed acquisition of the onsemi facility. Free cash flow (a non-GAAP measure) was $33.8 million, which includes $38.5 million of capital expenditures.\n\nBalance Sheet\n\nAs of March 31, 2022, the Company had approximately $315 million in cash and cash equivalents, restricted cash, and short-term investments. Total debt (including long-term and short-term) amounted to approximately $233 million and working capital was approximately $689 million.\n\nThe results announced today are preliminary and unaudited, as they are subject to the Company finalizing its closing procedures and completion of the quarterly review by its independent registered public accounting firm. As such, these results are subject to revision until the Company files its Form 10-Q for the quarter ending March 31, 2022.\n\nBusiness Outlook\n\nDr. Lu concluded, \"Backlog and demand remain very strong going into the second quarter, but due to the COVID-related lockdowns in China, especially in the Shanghai area, capacity was impacted at our local facilities during the first month of the quarter until now. With our excellent execution and recent improvements, we are guiding for sequential growth and expect revenue to be approximately $500 million, plus or minus 3 percent, and GAAP gross margin to be 41.0 percent, plus or minus 1 percent. Non-GAAP operating expenses, which are GAAP operating expenses adjusted for amortization of acquisition-related intangible assets, are expected to be approximately 21.0 percent of revenue, plus or minus 1 percent. We expect net interest expense to be approximately $1.2 million. Our income tax rate is expected to be 18.3 percent, plus or minus 3 percent, and shares used to calculate diluted EPS for the second quarter are anticipated to be approximately 46.3 million.\"\n\nAmortization of acquisition-related intangible assets of $3.2 million, after tax, for previous acquisitions is not included in these non-GAAP estimates.\n\nConference Call\n\nDiodes will host a conference call on Wednesday, May 4, 2022, at 4:00 p.m. Central Time (5:00 p.m. Eastern Time) to discuss its first quarter financial results. Investors and analysts may join the conference call by dialing 1-855-232-8957 and providing the confirmation code 7379175. International callers may join the teleconference by dialing +1-315-625-6979 and entering the same confirmation code at the prompt. A telephone replay of the call will be made available approximately two hours after the call and will remain available until May 11, 2022 at midnight Central Time. The replay number is 1-855-859-2056 with a pass code of 7379175. International callers should dial +1-404-537-3406 and enter the same pass code at the prompt.\n\nAdditionally, this conference call will be broadcast live over the Internet and can be accessed by all interested parties on the Investors’ section of Diodes' website at http:\/\/www.diodes.com. To listen to the live call, please go to the investors’ section of Diodes’ website and click on the conference call link at least 15 minutes prior to the start of the call to register, download and install any necessary audio software. For those unable to participate during the live broadcast, a replay will be available shortly after the call on Diodes' website for approximately 90 days.\n\nAbout Diodes Incorporated\n\nDiodes Incorporated (Nasdaq: DIOD), a Standard and Poor’s SmallCap 600 and Russell 3000 Index company, delivers high-quality semiconductor products to the world’s leading companies in the consumer electronics, computing, communications, industrial, and automotive markets. We leverage our expanded product portfolio of discrete, analog, and mixed-signal products and leading-edge packaging technology to meet customers’ needs. Our broad range of application-specific solutions and solutions-focused sales, coupled with worldwide operations of 31 sites, including engineering, testing, manufacturing, and customer service, enables us to be a premier provider for high-volume, high-growth markets. For more information visit www.Diodes.com\n\nSafe Harbor Statement Under the Private Securities Litigation Reform Act of 1995: Any statements set forth above that are not historical facts are forward-looking statements that involve risks and uncertainties that could cause actual results to differ materially from those in the forward-looking statements. Such statements include statements containing forward-looking words such as \"expect,\" \"anticipate,\" \"aim,\" \"estimate,\" and variations thereof, including without limitation statements, whether direct or implied, regarding expectations of that for the second quarter of 2022, we expect revenue to be approximately $500 million plus or minus 3 percent; we expect GAAP gross margin to be 41.0 percent, plus or minus 1 percent; non-GAAP operating expenses, which are GAAP operating expenses adjusted for amortization of acquisition-related intangible assets, are expected to be approximately 21.0 percent of revenue, plus or minus 1 percent; we expect non-GAAP net interest expense to be approximately $1.2 million; we expect our income tax rate to be 18.3 percent, plus or minus 3 percent; shares used to calculate diluted EPS for the second quarter are anticipated to be approximately 46.3 million. Potential risks and uncertainties include, but are not limited to, such factors as: the risk that the COVID-19 pandemic may continue and have a material adverse effect on customer demand and staffing of our production, sales and administration facilities; the risk that such expectations may not be met; the risk that the expected benefits of acquisitions may not be realized or that integration of acquired businesses may not continue as rapidly as we anticipate; the risk that the cost, expense, and diversion of management attention associated with the LSC acquisition may be greater than we currently expect; the risk that we may not be able to maintain our current growth strategy or continue to maintain our current performance, costs, and loadings in our manufacturing facilities; the risk that we may not be able to increase our automotive, industrial, or other revenue and market share; risks of domestic and foreign operations, including excessive operating costs, labor shortages, higher tax rates, and our joint venture prospects; the risks of cyclical downturns in the semiconductor industry and of changes in end-market demand or product mix that may affect gross margin or render inventory obsolete; the risk of unfavorable currency exchange rates; the risk that our future outlook or guidance may be incorrect; the risks of global economic weakness or instability in global financial markets; the risks of trade restrictions, tariffs, or embargoes; the risk that the coronavirus outbreak or other similar epidemics may harm our domestic or international business operations to a greater extent than we currently anticipate; the risk of breaches of our information technology systems; and other information, including the \"Risk Factors\" detailed from time to time in Diodes’ filings with the United States Securities and Exchange Commission.\n\nThe Diodes logo is a registered trademark of Diodes Incorporated in the United States and other countries.\n\nDIODES INCORPORATED AND SUBSIDIARIES CONSOLIDATED CONDENSED STATEMENTS OF OPERATIONS (unaudited) (in thousands, except per share data) Three Months Ended March 31 2022 2021 Net sales $ 482,123 $ 413,121 Cost of goods sold 285,426 274,485 Gross profit 196,697 138,636 Operating expenses Selling, general and administrative 71,443 58,676 Research and development 28,677 27,659 Amortization of acquisition-related intangible assets 3,862 4,023 Other operating expense (343 ) 888 Total operating expense 103,639 91,246 Income from operations 93,058 47,390 Other (expense) income Interest income 826 768 Interest expense (1,114 ) (2,864 ) Foreign currency loss, net 1,721 (1,279 ) Unrealized (loss) gain on investments (5,548 ) 3,655 Other income 1,876 2,317 Total other (expense) income (2,239 ) 2,597 Income before income taxes and noncontrolling interest 90,819 49,987 Income tax provision 16,646 9,434 Net income 74,173 40,553 Less net (income) loss attributable to noncontrolling interest (1,482 ) (1,101 ) Net income attributable to common stockholders $ 72,691 $ 39,452 Earnings per share attributable to common stockholders: Basic $ 1.61 $ 0.89 Diluted $ 1.59 $ 0.87 Number of shares used in earnings per share computation: Basic 45,104 44,408 Diluted 45,844 45,243\n\nNote: Throughout this release, we refer to \"net income attributable to common stockholders\" as \"net income.\"\n\nDIODES INCORPORATED AND SUBSIDIARIES RECONCILIATION OF NET INCOME TO ADJUSTED NET INCOME (in thousands, except per share data) (unaudited) For the three months ended March 31, 2022: Operating\r\nExpenses Other\r\nIncome\r\n(Expense) Income Tax\r\nProvision Net Income Per-GAAP $ 72,691 Diluted earnings per share (Per-GAAP) 1.59 Adjustments to reconcile net income to non-GAAP net income: Amortization of acquisition-related intangible assets 3,862 (706 ) 3,156 Acquisition-related costs 275 (57 ) 218 Non-cash mark-to-market investment adjustments 5,548 (1,303 ) 4,245 Non-GAAP $ 80,310 Diluted shares used in computing earnings per share 45,844 Non-GAAP diluted earnings per share $ 1.75\n\nNote: Included in GAAP and non-GAAP net income was approximately $6.4 million, net of tax, non-cash share-based compensation expense. Excluding share-based compensation expense, both GAAP and non-GAAP diluted earnings per share would have improved by $0.14 per share.\n\nDIODES INCORPORATED AND SUBSIDIARIES CONSOLIDATED RECONCILIATION OF NET INCOME TO ADJUSTED NET INCOME – Cont. (in thousands, except per share data) (unaudited) For the three months ended March 31, 2021: COGS Operating\r\nExpenses Other\r\nIncome\r\n(Expense) Income Tax\r\nProvision Net Income Per-GAAP $ 39,452 Diluted earnings per share (Per-GAAP) 0.87 Adjustments to reconcile net income to non-GAAP net income: Amortization of acquisition-related intangible assets 4,024 (744 ) 3,280 Acquisition-related costs 1,908 (400 ) 1,508 Non-cash mark-to-market investment adjustments (3,655 ) 731 (2,924 ) Restructuring Cost 820 (123 ) 697 Non-GAAP $ 42,013 Diluted shares used in computing earnings per share 45,243 Non-GAAP diluted earnings per share $ 0.93\n\nNote: Included in GAAP and non-GAAP adjusted net income was approximately $4.8 million, net of tax, non-cash share-based compensation expense. Excluding share-based compensation expense, both GAAP and non-GAAP adjusted diluted earnings per share would have improved by $0.11 per share.\n\nADJUSTED NET INCOME AND ADJUSTED EARNINGS PER SHARE\n\nThe Company’s financial statements present net income and earnings per share that are calculated using accounting principles generally accepted in the United States (\"GAAP\"). The Company’s management makes adjustments to the GAAP measures that it feels are necessary to allow investors and other readers of the Company’s financial releases to view the Company’s operating results as viewed by the Company’s management, board of directors and research analysts in the semiconductor industry. These non-GAAP measures are not prepared in accordance with, and should not be considered alternatives or necessarily superior to, GAAP financial data and may be different from non-GAAP measures used by other companies. Because non-GAAP financial measures are not standardized, it may not be possible to compare these financial measures with other companies’ non-GAAP financial measures, even if they have similar names. The explanation of the adjustments made in the table above, are set forth below:\n\nDetail of non-GAAP adjustments\n\nAmortization of acquisition-related intangible assets – The Company excluded this item, including amortization of developed technologies and customer relationships. The fair value of the acquisition-related intangible assets is amortized using straight-line methods which approximate the proportion of future cash flows estimated to be generated each period over the estimated useful life of the applicable assets. The Company believes that exclusion of this item is appropriate because a significant portion of the purchase price for its acquisitions was allocated to the intangible assets that have short lives and exclusion of the amortization expense allows comparisons of operating results that are consistent over time for both the Company’s newly acquired and long-held businesses. In addition, the Company excluded this item because there is significant variability and unpredictability among companies with respect to this expense.\n\nAcquisition related costs – The Company excluded expenses associated with the acquisition of LITE-ON Semiconductor, which consisted of advisory, legal and other professional and consulting fees. These costs were expensed as they were incurred and as services were received, and in which the corresponding tax adjustments were made for the non-deductible portions of these expenses. The Company believes the exclusion of the acquisition related costs provides investors with a more accurate reflection of costs likely to be incurred in the absence of an unusual event such as an acquisition and facilitates comparisons with the results of other periods that may not reflect such costs.\n\nNon-cash mark-to-market investment adjustments – The Company excluded market to market adjustments on various equity related investments, including certain LSC equity investments. The Company believes this is not reflective of the ongoing operations and exclusion of this provides investors an enhanced view of the Company’s operating results.\n\nRestructuring costs – The Company has recorded restructuring charges related to the shutdown and relocation of one of our assembly and test facilities located in Chengdu, China, restructuring at other China sites, and restructuring of select European entities. These restructuring charges are excluded from management’s assessment of the Company’s operating performance. The Company believes the exclusion of the restructuring charges provides investors an enhanced view of the cost structure of the Company’s operations and facilitates comparisons with the results of other periods that may not reflect such charges or may reflect different levels of such charges.\n\nCASH FLOW ITEMS\n\nFree cash flow (FCF) (Non-GAAP)\n\nFCF for the first quarter of 2022 is a non-GAAP financial measure, which is calculated by subtracting capital expenditures from cash flow from operations. For the first quarter of 2022, FCF was $33.8 million, which represents the cash and cash equivalents that we are able to generate after taking into account cash outlays required to maintain or expand property, plant and equipment. FCF is important because it allows us to pursue opportunities to develop new products, make acquisitions and reduce debt.\n\nCONSOLIDATED RECONCILIATION OF NET INCOME TO EBITDA\n\nEBITDA represents earnings before net interest expense, income tax provision, depreciation and amortization. Management believes EBITDA is useful to investors because it is frequently used by securities analysts, investors and other interested parties, such as financial institutions in extending credit, in evaluating companies in our industry and provides further clarity on our profitability. In addition, management uses EBITDA, along with other GAAP and non-GAAP measures, in evaluating our operating performance compared to that of other companies in our industry. The calculation of EBITDA generally eliminates the effects of financing, operating in different income tax jurisdictions, and accounting effects of capital spending, including the impact of our asset base, which can differ depending on the book value of assets and the accounting methods used to compute depreciation and amortization expense. EBITDA is not a recognized measurement under GAAP, and when analyzing our operating performance, investors should use EBITDA in addition to, and not as an alternative for, income from operations and net income, each as determined in accordance with GAAP. Because not all companies use identical calculations, our presentation of EBITDA may not be comparable to similarly titled measures used by other companies. For example, our EBITDA takes into account all net interest expense, income tax provision, depreciation and amortization without taking into account any amounts attributable to noncontrolling interest. Furthermore, EBITDA is not intended to be a measure of free cash flow for management’s discretionary use, as it does not consider certain cash requirements such as tax and debt service payments.\n\nThe following table provides a reconciliation of net income to EBITDA (in thousands, unaudited):\n\nThree Months Ended March 31 2022 2021 Net income (per-GAAP) $ 72,691 $ 39,452 Plus: Interest expense, net 288 2,096 Income tax provision 16,646 9,434 Depreciation and amortization 28,594 30,675 EBITDA (non-GAAP) $ 118,219 $ 81,657\n\nDIODES INCORPORATED AND SUBSIDIARIES CONSOLIDATED CONDENSED BALANCE SHEETS (in thousands) March 31, December 31, 2022 2021 (unaudited) (audited) Assets Current assets: Cash and cash equivalents $ 303,295 $ 363,599 Restricted Cash 2,710 3,219 Short-term investments 9,241 6,542 Accounts receivable, net of allowances of $5,394 and $4,324 at March 31, 2022 and December 31, 2021, respectively 362,035 358,496 Inventories 370,045 348,622 Prepaid expenses and other 104,763 107,194 Total current assets 1,152,089 1,187,672 Property, plant and equipment, net 589,915 582,079 Deferred income tax 21,755 21,256 Goodwill 147,968 149,890 Intangible assets, net 90,451 94,550 Other long-term assets 163,284 159,048 Total assets $ 2,165,462 $ 2,194,495 Liabilities Current liabilities: Line of credit $ 28,031 $ 18,068 Accounts payable 211,365 221,254 Accrued liabilities 167,392 184,649 Income tax payable 45,603 29,682 Current portion of long-term debt 11,102 17,381 Total current liabilities 463,493 471,034 Long-term debt, net of current portion 192,538 265,574 Deferred tax liabilities 32,432 32,230 Other long-term liabilities 116,980 122,933 Total liabilities 805,443 891,771 Commitments and contingencies Stockholders' equity Preferred stock - par value $1.00 per share; 1,000,000 shares authorized; no shares issued or outstanding - - Common stock - par value $0.66 2\/3 per share; 70,000,000 shares authorized; 45,231,793 and 45,017,774, issued and outstanding at March 31, 2022 and December 31, 2021, respectively 36,338 36,195 Additional paid-in capital 470,363 471,649 Retained earnings 1,189,500 1,116,809 Treasury stock, at cost, 9,272,513 shares held at March 31, 2022 and 9,272,513 shares held at December 31, 2021 (336,894 ) (336,894 ) Accumulated other comprehensive loss (61,804 ) (50,517 ) Total stockholders' equity 1,297,503 1,237,242 Noncontrolling interest 62,516 65,482 Total equity 1,360,019 1,302,724 Total liabilities and stockholders' equity $ 2,165,462 $ 2,194,495\n\nView source version on businesswire.com: https:\/\/www.businesswire.com\/news\/home\/20220504005968\/en\/\n\nContacts\n\nCompany Contact: \r\nDiodes Incorporated\r\nGurmeet Dhaliwal\r\nDirector, IR & Corporate Marketing\r\nP: 408-232-9003\r\nE: Gurmeet_Dhaliwal@diodes.com\n\nInvestor Relations Contact: \r\nShelton Group\r\nLeanne Sievers\r\nPresident, Investor Relations\r\nP: 949-224-3874\r\nE: lsievers@sheltongroup.com","link":"https:\/\/finance.yahoo.com\/news\/diodes-incorporated-reports-record-first-200500901.html","symbols":["DDQ.F","DIOD.US","SQM.US"],"tags":["DILUTED EARNINGS PER SHARE","DILUTED SHARE","DIODES INCORPORATED","EARNINGS PER SHARE","FOURTH QUARTER","GAAP","NET INCOME","THE COMPANY"],"sentiment":{"polarity":1,"neg":0.048,"neu":0.838,"pos":0.115}},{"date":"2022-05-03T16:38:04+00:00","title":"Gerdau (GGB) to Post Q1 Earnings: What's in the Cards?","content":"Gerdau S.A. GGB is slated to release first-quarter 2022 results on May 5.\r\n\r\nThe company has a trailing four-quarter earnings surprise of roughly 14%, on average. It posted a negative earnings surprise of 9.8% in the last reported quarter. The company’s first-quarter results are likely to reflect healthy demand from construction and industrial sectors and higher steel prices.\r\n\r\nShares of Gerdau have declined 9.9% in the past year compared with 3.7% rise of the industry. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLet’s see how things are shaping up for this announcement.\n\nSome Factors at Play\n\nGerdau is likely to have benefited, in the first quarter, from strong demand for steel in its key operations. A recovery in major consumer sectors across its operations is likely to have supported its steel shipments in the March quarter.\r\n\r\nThe strong performance of the construction industry in Brazil and the United States along with higher global steel prices are also likely to have driven the company’s margins in the quarter to be reported. It is likely to have witnessed higher production and shipments in its Brazil and North America business divisions on higher demand from the construction and industrial sectors. A rebound in light vehicle production in Brazil and the United States, healthy performance of the heavy vehicle sector in Brazil and the demand recovery in the oil and gas industry are also expected to have supported volumes in its Special Steel division in the first quarter. However, higher costs of key raw materials are likely to have weighed on its performance.\n\nGerdau S.A. Price and EPS Surprise Gerdau S.A. Price and EPS Surprise\n\nGerdau S.A. price-eps-surprise | Gerdau S.A. Quote\n\nZacks Model\n\nOur proven model does not conclusively predict an earnings beat for Gerdau this season. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of an earnings beat. But that’s not the case here.\r\n\r\nEarnings ESP: Earnings ESP for Gerdau is 0.00%. The Zacks Consensus Estimate for earnings for the first quarter is currently pegged at 45 cents. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\r\n\r\nZacks Rank: Gerdau currently carries a Zacks Rank #2.\n\nStory continues\n\nStocks That Warrant a Look\n\nHere are some companies in the basic materials space you may want to consider as our model shows these have the right combination of elements to post an earnings beat this quarter:\r\n\r\nAllegheny Technologies Incorporated ATI, scheduled to release earnings on May 4, has an Earnings ESP of +4.55% and carries a Zacks Rank #1. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe Zacks Consensus Estimate for Allegheny’s first-quarter earnings has been revised 4.8% upward over the past 60 days. The Zacks Consensus Estimate for ATI’s earnings for the quarter is currently pegged at 22 cents.\r\n\r\nSociedad Quimica y Minera de Chile S.A. SQM, slated to release earnings on May 18, has an Earnings ESP of 29.73% and carries a Zacks Rank #1.\r\n\r\nThe consensus estimate for Sociedad Quimica’s first-quarter earnings has been revised 55.7% upward in the past 60 days. The Zacks Consensus Estimate for SQM’s earnings for the quarter is pegged at $1.23.\r\n\r\nEndeavour Silver Corp. EXK, scheduled to release earnings on May 11, has an Earnings ESP of 4.35% and carries a Zacks Rank #3.\r\n\r\nThe consensus estimate for Endeavour Silver’s first-quarter earnings has been revised 20% upward in the past 60 days. The Zacks Consensus Estimate for EXK’s earnings for the quarter is pegged at 6 cents.\r\n\r\n\r\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nAllegheny Technologies Incorporated (ATI) : Free Stock Analysis Report\r\n\r\nGerdau S.A. (GGB) : Free Stock Analysis Report\r\n\r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n\r\nEndeavour Silver Corporation (EXK) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/gerdau-ggb-post-q1-earnings-163804823.html","symbols":["ATD.F","ATI.US","GDUA.F","GGB.US","GGBN.MX","GGBR3.SA","GGBR4.SA","GOAU3.SA","GOAU4.SA","QYM.F","SQM.US"],"tags":["CONSENSUS ESTIMATE","EARNINGS SURPRISE","GERDAU","RELEASE EARNINGS","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.995,"neg":0.014,"neu":0.889,"pos":0.097}},{"date":"2022-05-03T13:26:01+00:00","title":"Looking for Stocks with Positive Earnings Momentum? Check Out These 2 Basic Materials Names","content":"Quarterly financial reports play a vital role on Wall Street, as they help investors see how a company has performed and what might be coming down the road in the near-term. And out of all of the metrics and results to consider, earnings is one of the most important.\n\nLife and the stock market are both about expectations, and rising above what is expected is often rewarded, while falling short can come with negative consequences. Investors might want to try to capture stronger returns by finding positive earnings surprises.\n\n2 Stocks to Add to Your Watchlist\n\nThe Zacks Expected Surprise Prediction, or ESP, works by locking in on the most up-to-date analyst earnings revisions because they can be more accurate than estimates from weeks or even months before the actual release date. The thinking is pretty straightforward: analysts who provide earnings estimates closer to the report are likely to have more information. With this in mind, the Expected Surprise Prediction compares the Most Accurate Estimate (being the most recent) against the overall Zacks Consensus Estimate. The percentage difference provides the ESP figure.\n\nThe final step today is to look at a stock that meets our ESP qualifications. SQM (SQM) earns a Zacks Rank #1 15 days from its next quarterly earnings release on May 18, 2022, and its Most Accurate Estimate comes in at $1.60 a share.\n\nBy taking the percentage difference between the $1.60 Most Accurate Estimate and the $1.23 Zacks Consensus Estimate, SQM has an Earnings ESP of 29.73%.\n\nSQM is part of a big group of Basic Materials stocks that boast a positive ESP, and investors may want to take a look at Mosaic (MOS) as well.\n\nSlated to report earnings on August 1, 2022, Mosaic holds a #1 (Strong Buy) ranking on the Zacks Rank, and it's Most Accurate Estimate is $4.59 a share 90 days from its next quarterly update.\n\nFor Mosaic, the percentage difference between its Most Accurate Estimate and its Zacks Consensus Estimate of $3.58 is 28.22%.\n\nStory continues\n\nSQM and MOS' positive ESP metrics may signal that a positive earnings surprise for both stocks is on the horizon.\n\nFind Stocks to Buy or Sell Before They're Reported\n\nUse the Zacks Earnings ESP Filter to turn up stocks with the highest probability of positively, or negatively, surprising to buy or sell before they're reported for profitable earnings season trading. Check it out here >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nSociedad Quimica y Minera S.A. (SQM) : Free Stock Analysis Report\r\n \r\nThe Mosaic Company (MOS) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/looking-stocks-positive-earnings-momentum-132601284.html","symbols":["02M.F","02M.XETRA","MOS.MX","MOS.US","QYM.F","SQM.US"],"tags":["ACCURATE ESTIMATE","CONSENSUS ESTIMATE","EARNINGS ESTIMATES","EARNINGS SURPRISES","PERCENTAGE DIFFERENCE","ZACKS EARNINGS","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.995,"neg":0.011,"neu":0.845,"pos":0.144}}]