[{"date":"2022-03-25T07:00:00+00:00","title":"CATL's Sichuan Plant Certified as World's First Zero-carbon Factory in New Energy Industry","content":"YIBIN, China, March 25, 2022 \/PRNewswire\/ -- Sichuan Contemporary Amperex Technology Limited (CATL-SC), a wholly-owned subsidiary of CATL, received the PAS 2060 certification on carbon neutrality from the world's leading testing, inspection and certification company SGS in March, making the plant the world's first zero-carbon factory in the new energy industry.\n\nZhu Yunfeng, general manager of CATL-SC, said the plant has begun to craft the zero-carbon roadmap at the early stage of its establishment. Through continuous innovation in energy utilization, transportation, logistics, and manufacturing, the factory is able to produce more products of higher quality with less raw materials and carbon emissions. \"Zero carbon\" has become one of the core competencies of CATL-SC.\n\nCATL-SC has taken multiple measures to reduce carbon emissions. It has developed a trailblazing smart plant management system, which enables the interconnection of data through automatic capture of the plant system data and equipment operation data. Meanwhile, the systematic facility management platform helps to realize the safe, reliable, high-efficiency and low-carbon operation of the factory. For equipment groups with high-energy consumption, by using a global optimization algorithm, it has calculated each sub-equipment's operating parameters with the lowest total energy consumption of the system.\n\nIn terms of green manufacturing, CATL-SC has built a central control and management system for digital production. Equipped with global visual management, it has significantly reduced process losses, and with the support of the AI visual inspection system, which features automatic learning and extraction of defect characteristics, it has improved the detection rate in processes such as slitting and calendaring. All the waste produced during manufacturing will be recycled, and the recovery rate of precious metals such as nickel, cobalt and manganese can reach 99.3%.\n\nCATL-SC has comprehensively upgraded the logistics chain and factory transportation by widely applying driverless logistics vehicles, electric forklifts, etc., which enables zero-carbon operation among supplier factories, raw material warehouses, processing factories, finished product warehouses, and customers' factories. At the same time, employees are encouraged to use electric vehicles and shared mobility, thus reducing their carbon footprint in all aspects of production and life.\n\nStory continues\n\nCATL-SC is located in Yibin, southwest China'sSichuan Province. Three rivers, namely the Jinsha River, Minjiang River and Yangtze River traverse the city's northern part, providing a superior natural environment, unique geographical location and abundant water resources, which enables CATL-SC to reduce 400,000 tons of carbon emissions every year as over 80% of its energy consumption comes from hydropower.\n\nThe certification marks a significant milestone for CATL towards its carbon neutrality goals. As the world's first zero-carbon battery plant, CATL-SC sets an example of how battery production can be carbon neutral, and also offers a brand new solution featuring electrification + zero carbon to the market. In the future, CATL will replicate its experiences in the \"lighthouse factory\" in other facilities in an effort to achieve carbon neutrality for all its 10 production bases worldwide, thus building a more sustainable industry ecosystem and contributing to the global carbon neutrality goal.\n\nSOURCE Contemporary Amperex Technology Co., Ltd.","link":"https:\/\/finance.yahoo.com\/news\/catls-sichuan-plant-certified-worlds-070000061.html","symbols":["300750.SHE","300750.US"],"tags":["CARBON EMISSIONS","CARBON FOOTPRINT","CARBON NEUTRALITY","CATL","CATL-SC","ENERGY CONSUMPTION","SICHUAN CONTEMPORARY AMPEREX TECHNOLOGY LIMITED"],"sentiment":{"polarity":0.983,"neg":0.023,"neu":0.887,"pos":0.09}},{"date":"2022-03-21T00:00:00+00:00","title":"NIO Capital Closes Eve ONE Fund II at Around USD 400 Million","content":"SHANGHAI, March 20, 2022 \/PRNewswire\/ -- NIO Capital, a leading Chinese investment firm focused on decarbonization and digitalisation, today announced the successful final closing of NIO Capital's flagship fund, Eve ONE Fund II L.P. (the 'Fund') at approximately USD 400 million.\n\nThe Fund was oversubscribed and quickly surpassed its original target fund size and hard cap. Notably, this Fund has nearly doubled the capital commitments of its predecessor fund, NIO Capital Eve ONE Fund L.P., which held its final closing in 2019. With its comprehensive platform of strategies, NIO Capital supports emerging founders and innovative technologies across the company life cycle.\n\nWilliam Li, Managing Partner of NIO Capital, said, \"Our mission is to sustain and advance humankind via investing in innovations. We are dedicated to fostering a sustainable future with like-minded investors and visionary entrepreneurs.\"\n\nIan Zhu, Managing Partner of NIO Capital, said, \"Over the past five years, NIO Capital has become an institutionalized investment firm with the ability to integrate industry resources with financial goals. We see exciting opportunities at the crossover of auto, technology, and energy sectors, and will continue to focus our investments on decarbonization and digitalisation.\"\n\nDespite various fundraising limitations and challenges arising from the Covid-19 pandemic, the Fund enjoyed strong support from a diversified group of existing and new institutional investors. These investors hold a high conviction around NIO Capital's target sectors and robust market opportunity set. Participating investors include a mix of sovereign wealth funds, insurance companies, multilateral financial institutions, funds of funds, family offices, pension funds and foundations from the United States, Europe, Middle East, China, South-East Asia and Africa. For a couple of our new investors, this Fund was the first foray and investment into a China-focused strategy.\n\nStory continues\n\nBuilding on its reputation as a leader driving digitalization and decarbonization transformation in scalable industries, such as the mobility, energy and logistics sectors, NIO Capital established Fund II to continue its successful investment strategy. The team will focus on backing the next generation of innovative technologies and business models reshaping its target market, leveraging its unique access to Chinese innovation and in-depth market understanding with a flourishing ecosystem.\n\nNotable investments by NIO Capital include the pioneering intelligent systems developer Momenta, leading L4 autonomous driving provider Pony.ai, LiDAR systems application maker Innovusion, the industry's 1st L3 Mass-produced trucks developer Inceptio, digital energy infrastructure provider NewLink, and automotive aftermarket sector leader Tuhu.\n\nAsante Capital Group acted as the exclusive global fundraising adviser, while Cooley LLP acted as NIO Capital's primary legal adviser.\n\nAbout NIO Capital Founded in 2016, NIO Capital is a professional investment firm that focuses on investments in energy, automobiles, and deep technology sectors. NIO Capital insists on ESG sustainable investments with a focus on innovations in decarbonization and digitalization. Our portfolio companies include CATL (SZSE: 300750), Ronbay Technology (SHSE: 688005), United Winners (SHSE: 688518), Momenta, Inceptio, Pony.ai, Innovusion, Black Sesame Technologies, etc.\n\nNIO Capital has a diversified team with deep industry background and professional investment capabilities, along with the industry's top resources and network. We have a sound understanding of entrepreneurship and deep insights into the investment sectors. We can provide multi-dimensional support to portfolio companies, helping grow grand visions into great companies. Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/nio-capital-closes-eve-one-fund-ii-at-around-usd-400-million-301506206.html\n\nSOURCE NIO Capital","link":"https:\/\/finance.yahoo.com\/news\/nio-capital-closes-eve-one-000000225.html","symbols":["300750.SHE","300750.US","688005.SHG","688005.US","688518.US"],"tags":["DECARBONIZATION","DIGITALISATION","EVE ONE FUND II L.P","INVESTMENT","NIO CAPITAL","NIO CAPITAL EVE ONE FUND L.P"],"sentiment":{"polarity":0.998,"neg":0.002,"neu":0.821,"pos":0.176}}]