[{"date":"2022-06-21T22:02:22+00:00","title":"3 Undervalued Dividend Stocks to Buy Before Wall Street Catches On","content":"The stock market has entered a phase that no one likes. Bear markets naturally have investors wondering when things will turn around. In this bear market, investing in undervalued dividend stocks to buy is an obvious and smart investment choice.\n\nThe safety margin that undervalued stocks offer is like an antidote to the risk-off investor sentiment. The theory suggests that at some point in time, undervalued stocks should converge to their intrinsic values and close the gap between observed and real stock prices.\n\nWith inflation now at approximately 8%, getting paid a dividend yield of more than 8% is enough to generate passive and real income. It is time to play defense and mitigate losses in stocks, which is exactly what these three dividend stocks are about.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\n7 Retirement Stocks to Buy for a Bear Market\n\nThese undervalued dividend stocks offer solid financials, a forward dividend yield of more than 8% to beat inflation and a strong chance that Wall Street notices them soon. Investing early in these stocks has risks, but the reward could be big.\n\nOMF OneMain Holdings $2.78 SIRE Sisecam Resources $17.75 BAK Braskem $14.52\n\nOneMain Holdings Image of a hand signing a paper with the loan as the title\n\nSource: shutterstock\n\nOneMain Holdings (NYSE:OMF) is a financial services company providing loans helping its customers to plan and build a better financial future. It offers loans secured by collateral, including cars.\n\nIt’s a great time to consider adding shares of OneMain Holdings to your portfolio. The shares have losses of nearly 26% in 2022 and trade at a price-to-earnings (P\/E) ratio of 4.1. The company began paying dividends in 2019, and its two most recent dividends represent a 10.4% yield.\n\nThe dividend yield history is not stable, but it is consistent. The forward payout ratio of 42% is very safe. The company occasionally offers special dividends such as the dividend of $3.95 back in February 2021.\n\nThe business model is strong. Sales growth has been stable over the past two years, but profitability has gained a lot of traction. In 2021, OneMain reported a net income growth of 80% to $1.31 billion.\n\nStory continues\n\nThe trailing 12-months price-to-earnings growth of 0.36 signals an undervalued stock with a lot of upside potential. The one year analyst target is $69.79, a likely gain of 87%.\n\nSisecam Resources (SIRE) A photo of soda ash in crystal form.\n\nSource: Mitzxxz \/ Shutterstock.com\n\nSisecam Resources (NYSE:SIRE) is a global leading company in soda ash production. The company is headquartered in Atlanta, Georgia, and has a production facility located in Green River, Wyoming. Its production of soda ash started in 1962.\n\nSIRE stock offers a forward dividend yield of 11.9% and trades at a P\/E ratio of 9.6. The stock is up 9% in 2022.\n\nQ1 2022 financial results were strong showing a year-over-year increase of 27.9% for net sales to $163.4 million, and a 467.9% year-over-year growth for net income to $31.8 million.\n\nThe CEO of the company commented, “I am excited to report a good start to 2022, highlighted by promising net income and adjusted EBITDA for the first quarter.”\n\n7 Long-Term Stocks That Never Go Out of Style\n\nThe firm is not only consistently profitable but also generates positive free cash flows. That’s a combination that is ideal for supporting a higher stock price.\n\nBraskem (BAK) A photo of a pile of red polypropylene plastic pellets.\n\nSource: Anastasiia Burlutskaia \/ Shutterstock.com\n\nBraskem (NYSE:BAK) was founded in 2002 by the merger of six companies and is now the largest producer of thermoplastic resins and polypropylene in the U.S.\n\nBraskem stock has lost 32% in 2022 and trades at a P\/E ratio of 1.9. It didn’t offer a dividend in 2020 but has an otherwise healthy history of dividends.\n\nBusiness is good for Braskem; sales growth grew 80.42% in 2021 to $105.63 billion, and net income growth was 308.99% to $13.98 billion.\n\nThe 1-year target estimate of $23.60 signals an upside potential of 42%. In its Q1 2022 results, Braskem stated that among its key goals for 2022 are to “capture value through initiatives related to Transform for Value program,” with a specific target of recurring gains for $302 million, and to “return value to shareholders via dividend distributions.” The company generated a free cash flow growth of 221.24% in 2021 to $11.37 billion, which will help it pay dividends.\n\nOn the date of publication, Stavros Georgiadis, CFA did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMore From InvestorPlace\n\n$200 Oil Sooner Than You Think – Buy This Now Stock Prodigy Who Found NIO at $2… Says Buy THIS Early Bitcoin Millionaire Reveals His Next Big Crypto Trade “On Air” It doesn’t matter if you have $500 in savings or $5 million. Do this now.\n\nThe post 3 Undervalued Dividend Stocks to Buy Before Wall Street Catches On appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/3-undervalued-dividend-stocks-buy-220222303.html","symbols":["0S1.F","BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","OMF.US","SIRE.US"],"tags":["BRASKEM","DIVIDEND STOCKS","SIRE","UNDERVALUED STOCK","UNDERVALUED STOCKS"],"sentiment":{"polarity":0.999,"neg":0.018,"neu":0.803,"pos":0.179}},{"date":"2022-06-17T13:40:01+00:00","title":"Is Braskem (BAK) Stock Undervalued Right Now?","content":"Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.\n\nOf these, perhaps no stock market trend is more popular than value investing, which is a strategy that has proven to be successful in all sorts of market environments. Value investors use a variety of methods, including tried-and-true valuation metrics, to find these stocks.\n\nZacks has developed the innovative Style Scores system to highlight stocks with specific traits. For example, value investors will be interested in stocks with great grades in the \"Value\" category. When paired with a high Zacks Rank, \"A\" grades in the Value category are among the strongest value stocks on the market today.\n\nBraskem (BAK) is a stock many investors are watching right now. BAK is currently sporting a Zacks Rank of #2 (Buy), as well as a Value grade of A. The stock is trading with P\/E ratio of 6.95 right now. For comparison, its industry sports an average P\/E of 7.13. Over the last 12 months, BAK's Forward P\/E has been as high as 7.57 and as low as 2.18, with a median of 4.38.\n\nValue investors also frequently use the P\/S ratio. This metric is found by dividing a stock's price with the company's revenue. This is a popular metric because sales are harder to manipulate on an income statement, so they are often considered a better performance indicator. BAK has a P\/S ratio of 0.33. This compares to its industry's average P\/S of 0.54.\n\nFinally, investors will want to recognize that BAK has a P\/CF ratio of 1.75. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. BAK's P\/CF compares to its industry's average P\/CF of 5.99. Within the past 12 months, BAK's P\/CF has been as high as 13.24 and as low as 1.66, with a median of 2.26.\n\nStory continues\n\nIf you're looking for another solid Oil and Gas - Integrated - International value stock, take a look at Vista Oil & Gas (VIST). VIST is a # 2 (Buy) stock with a Value score of A.\n\nVista Oil & Gas sports a P\/B ratio of 1.21 as well; this compares to its industry's price-to-book ratio of 1.32. In the past 52 weeks, VIST's P\/B has been as high as 1.46, as low as 0.56, with a median of 0.95.\n\nThese are just a handful of the figures considered in Braskem and Vista Oil & Gas's great Value grade. Still, they help show that the stock is likely being undervalued at the moment. Add this to the strength of its earnings outlook, and we can clearly see that BAK and VIST is an impressive value stock right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/braskem-bak-stock-undervalued-now-134001557.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["VALUE INVESTING","ZACKS RANK"],"sentiment":{"polarity":0.998,"neg":0.015,"neu":0.811,"pos":0.174}},{"date":"2022-06-14T16:11:04+00:00","title":"CORRECTED-Braskem Idesa and Advario to build $400 mln ethane import terminal in Mexico","content":"(Corrects to show terminal is to import ethane, not ethanol)\n\nMEXICO CITY, June 14 (Reuters) - A subsidiary of Brazilian petrochemical producer Braskem and Netherlands-based firm Advario said on Tuesday they would invest around $400 million to build an ethane import terminal in the eastern Mexican state of Veracruz.\n\nConstruction on the terminal is set to begin in July and will bring around 2,000 jobs to the state, the companies said. (Reporting by Mexico City Newsroom)","link":"https:\/\/finance.yahoo.com\/news\/corrected-braskem-idesa-advario-build-161104385.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","ETHANE","IMPORT TERMINAL","PETROCHEMICAL"],"sentiment":{"polarity":0,"neg":0,"neu":1,"pos":0}},{"date":"2022-06-01T13:40:01+00:00","title":"Is Braskem (BAK) a Great Value Stock Right Now?","content":"Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.\n\nConsidering these trends, value investing is clearly one of the most preferred ways to find strong stocks in any type of market. Value investors use tried-and-true metrics and fundamental analysis to find companies that they believe are undervalued at their current share price levels.\n\nLuckily, Zacks has developed its own Style Scores system in an effort to find stocks with specific traits. Value investors will be interested in the system's \"Value\" category. Stocks with both \"A\" grades in the Value category and high Zacks Ranks are among the strongest value stocks on the market right now.\n\nOne stock to keep an eye on is Braskem (BAK). BAK is currently holding a Zacks Rank of #2 (Buy) and a Value grade of A. The stock has a Forward P\/E ratio of 5.62. This compares to its industry's average Forward P\/E of 7.83. BAK's Forward P\/E has been as high as 6.55 and as low as 2.18, with a median of 4.38, all within the past year.\n\nBAK is also sporting a PEG ratio of 0.58. This popular figure is similar to the widely-used P\/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. BAK's PEG compares to its industry's average PEG of 0.67. BAK's PEG has been as high as 0.60 and as low as 0.21, with a median of 0.42, all within the past year.\n\nValue investors also use the P\/S ratio. The P\/S ratio is is calculated as price divided by sales. Some people prefer this metric because sales are harder to manipulate on an income statement. This means it could be a truer performance indicator. BAK has a P\/S ratio of 0.41. This compares to its industry's average P\/S of 0.59.\n\nFinally, our model also underscores that BAK has a P\/CF ratio of 1.96. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. BAK's current P\/CF looks attractive when compared to its industry's average P\/CF of 6.55. Within the past 12 months, BAK's P\/CF has been as high as 13.26 and as low as 1.66, with a median of 2.30.\n\nStory continues\n\nIf you're looking for another solid Oil and Gas - Integrated - International value stock, take a look at Vista Oil & Gas (VIST). VIST is a # 2 (Buy) stock with a Value score of A.\n\nVista Oil & Gas sports a P\/B ratio of 1.44 as well; this compares to its industry's price-to-book ratio of 1.50. In the past 52 weeks, VIST's P\/B has been as high as 1.46, as low as 0.56, with a median of 0.91.\n\nThese are just a handful of the figures considered in Braskem and Vista Oil & Gas's great Value grade. Still, they help show that the stock is likely being undervalued at the moment. Add this to the strength of its earnings outlook, and we can clearly see that BAK and VIST is an impressive value stock right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n \r\nVista Oil & Gas, S.A.B. de C.V. Sponsored ADR (VIST) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/braskem-bak-great-value-stock-134001045.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","PEG RATIO","VALUE INVESTING","ZACKS RANK"],"sentiment":{"polarity":0.998,"neg":0.015,"neu":0.826,"pos":0.159}},{"date":"2022-05-25T23:49:29+00:00","title":"3 Mid-Cap Stocks to Buy for Big Yields","content":"These mid-cap stocks to buy now offer very high dividend yields and a price forecast with plenty of upside potential. ZIM Integrated Shipping Services (ZIM): A global container liner shipping company with a dividend yield of nearly 30%. Braskem (BAK): This chemicals company in Brazil has reported very large revenue and net income growth in 2021. FS KKR Capital (FSK): A financial services firm with a history of strong profitability at a very attractive valuation. Mid-Cap Stocks Class Category Market Ticker Prices 3d Illustration\n\nSource: iQoncept \/ Shutterstock.com\n\nMid-cap stocks have slightly outperformed the broader U.S. stock market as measured by the S&P 500 in 2022. In a year with elevated volatility and major risks ahead, this outperformance signals that investment opportunities exist everywhere, but stock picking is tough. The S&P MidCap 400measures “the performance of 400 mid-sized companies, reflecting the distinctive risk and return characteristics of this market segment.”\n\nAt the close of the U.S. stock market on May 20, the S&P MidCap 400 had losses of 16.1% compared to a loss of 18.1% for the S&P 500. It is not a huge difference, but it shows mid-cap stocks offer returns that can be better than the overall index.\n\nThe 7 Highest-Yielding Dividend Stocks to Buy Now for Income\n\nThese three mid-cap stocks to buy have very high dividend yields. They’re enough to add significant passive recurring income with very good risk\/return characteristics, growth and relative stability.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nZIM ZIM Integrated Shipping Services $70.07 BAK Braskem $17.73 FSK FS KKR Capital $20.92\n\nZIM Integrated Shipping Services (ZIM) A large ULCV container ship underway, sails on open water fully loaded with containers and cargo - the ZIM San Francisco\n\nSource: ImagineStock \/ Shutterstock.com\n\nZIM Integrated Shipping Services (NASDAQ:ZIM) is a global container liner shipping company founded in 1945 and headquartered in Haifa, Israel. Shares of ZIM stock are very interesting now for several reasons.\n\nFirst, the company decided to offer shares to the public for $15 each back in January 2021. As of May 20, the closing price was $64.70, indicating a successful initial public offering (IPO) in terms of its financial return almost 1.5 years later.\n\nStory continues\n\nThe second reason ZIM stock is interesting is its very high forward dividend and yield of $19.50 and 30.1%, respectively. Finally, the one-year price target is $87, providing an upside potential of nearly 24%.\n\nZIM reported record results in both full-year 2021 and the first quarter of 2022. Net income for the first quarter was $1.7 billion, a year-over-year (YOY) increase of 190%, and revenue was $3.7 billion, a YOY increase of 113%.\n\nNeed another reason to be bullish for ZIM stock? It trades at a price-to-earnings (P\/E) ratio of 1.7x.\n\nBraskem (BAK) Detail of chemical plant, silos and pipes\n\nSource: Shutterstock\n\nBraskem (NYSE:BAK) produces and sells thermoplastic resins, operating through three segments across Brazil, the United States, Mexico and Europe. Shares of Braskem are cheap, trading at a P\/E ratio of 2.5x and offering a high forward dividend yield of 14.4%.\n\nIts dividend yield history is not stable. However, this is not a bad thing as long as the fundamentals are strong and the valuation is compelling. The price-to-sales (P\/S) ratio of 0.3x makes the stock very cheap.\n\nBraskem’s sales growth seems to have had momentum over the past two years. It rose from a rate of 11.9% in 2020 to 80.4% in 2021.\n\n7 Large-Cap Stocks to Buy Right Now\n\nThe net income growth in 2021 was stellar at 309%, making a big turnaround after two consecutive years of net losses. The company also generates high, but volatile free cash flows, which also have picked up tons of momentum in the last two years. BAK stock has a one-year target of $24 for a potential upside of approximately 35%.\n\nFS KKR Capital (FSK) A laptop, pencil, pair of eyeglasses, and many coins rest on a wooden table.\n\nSource: Shutterstock\n\nFS KKR Capital (NYSE:FSK) is a financial services firm specializing in investments in debt securities. The forward dividend and yield are $2.72 and 13.2%, respectively. FSK stock is trading now at a P\/E ratio of 3.4x.\n\nBack in 2018 through 2020, the quarterly cash dividend was 19 cents. In June 2020, it was raised to 60 cents and then 65 cents in September 2021. It dipped to 62 cents in December 2021, but it was raised to 68 cents to be paid in June 2022.\n\nIts sales growth is volatile, but its profitability is strong. In the past five years, the company was unprofitable only in 2020. In 2021, it reported net income growth of 474.1% to $1.5 billion.\n\nFor the first quarter of 2022, FS KKR Capital reported a net investment income of 77 cents per share. That was a quarterly increase of nearly 17% compared to 66 cents per share for the quarter ended Dec. 31, 2021.\n\nAnalysts are bullish, as the one-year target of $23.06 offers upside potential of 11%.\n\nOn the date of publication, Stavros Georgiadis, CFA  did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMore From InvestorPlace\n\nStock Prodigy Who Found NIO at $2… Says Buy THIS It doesn’t matter if you have $500 in savings or $5 million. Do this now.  Get in Now on Tiny $3 ‘Forever Battery’ Stock Early Bitcoin Millionaire Reveals His Next Big Crypto Trade “On Air”\n\nThe post 3 Mid-Cap Stocks to Buy for Big Yields appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/3-mid-cap-stocks-buy-234929387.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","FS5A.F","FSK.US","GSPC.INDX","ZIM.US"],"tags":["BRASKEM","CONTAINER LINER","DIVIDEND YIELDS","FS KKR CAPITAL","FSK","KKR","MID-CAP STOCKS","NET INCOME GROWTH","ZIM","ZIM INTEGRATED SHIPPING SERVICES"],"sentiment":{"polarity":0.998,"neg":0.023,"neu":0.864,"pos":0.113}},{"date":"2022-05-16T12:00:00+00:00","title":"Braskem Delivers Increased Supply of I'm green Bio-Based EVA Biopolymer to Support Heightened Demand for Welli Bins ™ Sustainable Storage Bins","content":"The plant-based, washable bins are the first environmentally friendly polymer storage bins that reduce CO2 emissions\n\nPHILADELPHIA, May 16, 2022 \/PRNewswire\/ -- Braskem (B3: BRKM3, BRKM5 and BRKM6; NYSE: BAK; LATIBEX: XBRK) the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, today announced it is supplying additional volume of its proprietary I'm greenTM carbon-negative EVA biopolymer to support the increased production of Welli Bins™ sustainable storage bins. The additional production follows Welli Bins successful launch earlier this year which launched to sold out consumer demand. Welli Bins\n\nWelli Bins are the first planet-friendly storage and organization solution made from plant-based, washable, durable and sugarcane-based material - all designed to be an environmentally friendly solution to traditional polymer storage bins. The bins are made of a proprietary blend of Braskem's I'm green EVA and other plant-based materials that allow the bins to significantly reduce CO2 emissions.\n\n\"We are proud to support increased production of Welli Bins sustainable storage bins with additional volumes of our I'm green sugarcane-based EVA biopolymer,\" said Giancarlos Delevati, Account Manager and Business Development at Braskem. \"Over six months ago, the company had a successful launch and sold out of these unique, sustainable storage containers. The strong demand for Welli Bins' product affirms the heightened consumer interest in products that are produced in an environmentally friendly way. Braskem is committed to continuing to support innovative, sustainable products that aid in reducing waste and having a positive impact on the environment.\"\n\n\"Here at Welli Bins Co., we're building a market-changing product at a time when households demand stronger, lighter, and more sustainable products. This is core to our strategy and why we have a loyal customer base. Braskem gives us a competitive advantage. Not only are they the industry leader and pioneer in carbon-negative EVA biopolymer, but Braskem has the skills and flexibility to be a deeply integrated product partner with Welli Bins Co. We are excited to continue building out our plant-friendly line of products together,\" stated Kathleen McIntyre, Founder and CEO, Welli Bins.\n\nStory continues\n\nSoft but sturdy, Welli Bins are comfortable to handle and lightweight and are tear-resistant, which means the bins won't break down and end up in a landfill. Available in a variety of colors Welli Bin's biopolymer-based surfaces are waterproof, making them easy to clean and disinfect. Welli Bins significantly reduce emissions thanks to the consumption of CO2 by the sugarcane plants. Additionally, leftover biomass during manufacturing is used to heat generators and supply electricity to the manufacturing facility to further reduce the carbon footprint of the process. The first production of Welli Bins sustainable storage bins was launched on November 16 and sold out to strong consumer reception. Welli bins are available for sale online and shipping throughout the United States. For information on the bins and how to purchase them, please visit Welli Bins' website: www.wellibins.com\n\nBraskem is strongly committed to a Carbon-Neutral Circular Economy where nothing is wasted, and everything is transformed. To support this vision for the future Braskem has clearly stated targets for growing the company's recycled content product portfolio to sales of 300,000 tons by 2025 and 1 million tons by 2030. Braskem's transition to a circular economy is deeply rooted in mechanical and advanced recycling solutions. By engaging and investing in partnership with other members of the value chain the company is strengthening mechanical and advanced recycling, overcoming barriers, and ensuring the increased production of high-quality recycled material. All these initiatives are aligned with Braskem's feedstock diversification strategy and its macro goals of expanding the circular economy concept in the plastic chain and becoming a carbon-neutral company by 2050.\n\nABOUT WELLI BINS CO. Welli Bins Co. is developing the first line of sustainable, washable and portable bins made from plant-based materials. Welli Bins customers don't fit in a box. They are moms and dads with kids who jump in muddy puddles, single guys who love cats, musicians with too many cords in their Brooklyn studios and yoga-loving city dwellers who often work out at home. Pet toys, free weights, wet pool toys and dirty sneakers all get equal treatment in a Welli Bin. Organizing and compartmentalizing can be good for the soul, and now it's good for the planet, too, with these environmentally-friendly washable containers.\n\nABOUT BRASKEM With a global vision of the future oriented toward people and sustainability, Braskem is committed to contributing to the value chain for strengthening the Circular Economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improving people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico, and Germany, Braskem exports its products to clients in more than 80 countries.\n\nBraskem America is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa. (PRNewsfoto\/Braskem) Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/braskem-delivers-increased-supply-of-im-green-bio-based-eva-biopolymer-to-support-heightened-demand-for-welli-bins--sustainable-storage-bins-301544122.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/braskem-delivers-increased-supply-im-120000506.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","BRASKEM AMERICA","ENVIRONMENTALLY FRIENDLY","STORAGE BINS","SUSTAINABLE PRODUCTS","WELLI BIN","WELLI BINS","WELLI BINS CO"],"sentiment":{"polarity":0.999,"neg":0.013,"neu":0.805,"pos":0.182}},{"date":"2022-05-12T16:45:00+00:00","title":"Braskem Reports Recurring EBITDA of US$920 million in 1Q22","content":"In May, Braskem distributed R$1.35 billion in additional dividends for fiscal year 2021\n\nSÃO PAULO, May 12, 2022 \/PRNewswire\/ -- BRASKEM S.A. (B3: BRKM3, BRKM5 and BRKM6; NYSE: BAK; LATIBEX: XBRK) announces today its results for 1Q22.\n\n1Q22 HIGHLIGHTS\n\nCONSOLIDATED\n\nIn 1Q22, the Company's Recurring EBITDA was US$920 million, 19% lower than 4Q21, mainly due to: (i) the normalization of international spreads for main chemicals and resins in Brazil, for PP in the USA & Europe and for PE in Mexico; (ii) lower sales volume of main chemicals and resins in the Brazil segment; and (iii) the appreciation of the Brazilian real against the U.S. dollar of 6.3%. Compared to 1Q21, the Company's Recurring EBITDA in U.S. dollar contracted 27%, due to: (i) the normalization of international spreads for main chemicals, PE and PP in Brazil, for PP in the USA and for PE in Mexico; (ii) the lower sales volume of resins in Brazil and PP in Europe; and (iii) the appreciation in the Brazilian real against the U.S. dollar of 4.4%. In Brazilian real, Recurring EBITDA was R$4.8 billion, lower 23% and 30% than 4Q21 and 1Q21, respectively, due to the appreciation of the Brazilian real against the U.S. dollar. In the quarter, the Company recorded net income[1] of R$3.9 billion, representing R$4.88 per common share and class \"A\" preferred share[2]. Additionally, the Company's net margin in the period was 15%. In May, the Company paid additional dividends of R$1.35 billion, based on the results for fiscal year 2021, which, added to the R$6.0 billion prepaid in December 2021, brings the total to R$7.35 billion, corresponding to 77.5% of the adjusted net income for 2021. The Company's recurring cash flow was of R$467 million and return[3] on cash flow was of 28% in 1Q22. Adding payments related to the Alagoas geological event, the Company presented in 1Q22 a cash consumption of R$176 million and return³ on cash flow was of 21%. Corporate leverage, measured by the ratio of adjusted net debt to Recurring EBITDA[4] in U.S. dollar, ended the quarter at 1.00x. The cash position was US$1.8 billion, a level that guarantees coverage of debt maturities for the next 69 months. This position does not consider the international revolving credit line (stand by) available in the amount of US$1.0 billion, with maturity until 2026, which increases the company's liquidity. In January, the Company disbursed the funds related to the first CRA - Agribusiness Receivables Certificates structured by the Company for the purchase of ethanol, which is used as feedstock to produce Green PE (I'm greenTM bio-based) and ETBE. This operation, in the amount of R$721 million in two series of 7 years and 10 years, highlights Braskem's entry into the Brazilian fixed income market.\n\nESG\n\nStory continues\n\nRecognition\n\nCDP Supplier Engagement Rating: Braskem has invited its critical suppliers to take part in the CDP Supply Chain assessment based on sustainability criteria, since 2016. Suppliers' participation in the Climate and Water themes achieved 87% and 79%, respectively, placing Braskem as a leader in the CDP Supplier Engagement Rating.\n\nEnvironmental\n\nMechanical Recycling (Brazil): in March, the first mechanical recycling line in Brazil was inaugurated in Indaiatuba, São Paulo. The project was made feasibly by the collaboration with Valoren, a company that specializes in the development of new technologies and the management of solid waste recycling. Annually, 250 million units of post-consumer packaging consisting of polyethylene and polypropylene are expected to be converted into 14,000 tons of high-quality resins for reuse as raw materials by the plastics converter industry. Advanced Recycling (USA): acquisition of non-controlling interest in Nexus Circular LLC in January 2022. Nexus is a company engaged in advanced recycling that converts plastics that would have been sent to landfills into circular feedstock used in the production of sustainable virgin plastics. The equity investment allows Braskem to participate in the growing chemical recycling market, supporting Braskem's strategy to drive plastic circularity. EDF Renewables: in April, Braskem announced that it entered into a second wind power purchase agreement with EDF Renewables Latin America, which will enable the construction of a new complex in southeastern Bahia. The new wind power complex, which is planned to come up in 2024, provide sustainable energy to operations for the next 20 years. Casa dos Ventos: Braskem acquired non-controlling equity interests in the special purpose companies, Ventos de Santa Amélia and Ventos de Santo Abelardo, both of which are managed by FIP Salus of the Casa dos Ventos group, essentially making the Company as a renewable energy self-producer. Partnership with Sojitz: in March, Braskem announced that it signed a cooperation agreement with Sojitz Corporation to form a joint venture for producing and selling monoethylene glycol (bio-MEG) and monopropylene glycol (bio-MPG), subject to approval from the relevant antitrust authorities. Furthermore, the business plan of the Joint Venture entails investments for the construction of three industrial plants in the first phase, conditioned on the conclusion of technological development, which will be aided by the Danish Company Haldor Topsoe.\n\nSocial\n\nHealth and Safety: in the quarter, the consolidated reported and lost time injury-frequency rate was 1.18 event per million hours worked, an 55% increase over the same period of 2021. The TIER 1[5] rate was 0.07 event per million hours worked, a 12% decrease from the first quarter of 2021, which positions Braskem on par with its peers in the global chemical industry considered references in safety. Meanwhile, the TIER 2[6] rate was 0.44 event per million hours worked.\n\nGovernance\n\nSustainable Development Advisory Board: the Company established an external sustainable development advisory board comprised of four independent professional chosen for their experience and diversity of backgrounds. The external board will support the Global Sustainable Development Committee, which is integrated by Company leaders, in guiding the plans for 2030 and 2050, based on unbiased perspectives of issues related to the environment, health and safety, social responsibility and other relevant ESG topics. Two meetings were held in 2022 in which themes involving Climate Change and the Circular Economy were discussed with members.\n\nThe full earnings release is available on the Company's IR website: www.braskem-ri.com.br\/home-en\n\nBraskem will host conference calls to discuss its Results THURSDAY, May 12 at 10:00 a.m. US ET.\n\nAdditional information may be obtained from the Investor Relations Department at +55 11 3576-9531 or braskem-ri@braskem.com.br.\n\n[1] Based on net profit (loss) attributable to the shareholders of the Company.\r\n[2] For the class \"B\" preferred shares, the amount is R$0.61 per share.\r\n[3] Corresponds to cash flow in U.S. dollar in the last 12 months divided by the Company's market capitalization in the quarter.\r\n[4] Excludes the Project Finance in Mexico and based on Recurring EBITDA.\r\n[5] Incident with loss of containment of products above the limits established in the American Petroleum Institute (API) 754 for TIER 1, based on the product released, or any release that causes: fatality or lost-time injury of an employee or third party, hospital damages or fatality of the external public, financial losses greater than US$100,000, or evacuation of the community.\r\n[6] Incident with loss of containment of products above the limits established in the American Petroleum Institute (API) 754 for TIER 2, based on the product released, or any release that causes: reportable injury of own employee or third party and financial loss greater than US$2,500. Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/braskem-reports-recurring-ebitda-of-us920-million-in-1q22-301546367.html\n\nSOURCE Braskem S.A.","link":"https:\/\/finance.yahoo.com\/news\/braskem-reports-recurring-ebitda-us-164500620.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","BRAZIL","BRAZILIAN REAL","COMPANY","PP","RECURRING","THE COMPANY","USA & EUROPE"],"sentiment":{"polarity":0.99,"neg":0.038,"neu":0.89,"pos":0.072}},{"date":"2022-05-10T12:27:12+00:00","title":"Will High Costs &amp; Low Sales Dent Braskem (BAK) Q1 Earnings?","content":"Braskem S.A. BAK is set to release first-quarter results on May 11. The current Zacks Consensus Estimate for the to-be-reported quarter is a profit of 82 cents per share on revenues of $4.8 billion.\r\n\r\nLet’s delve into the factors that might have influenced the Brazilian petrochemical firm’s results in the March quarter. But it’s worth taking a look at BAK’s previous-quarter performance first.\n\nHighlights of Q4 Earnings\n\nIn the last-reported quarter, the leading plastics producer missed the consensus mark on lower margin in the overseas market. BAK had reported earnings per share of 24 cents, below the Zacks Consensus Estimate of $2.51. Revenues of $5.1 billion generated by the firm also missed the Zacks Consensus Estimate by 3.4%.\n\nNOV Inc. Price, Consensus and EPS Surprise NOV Inc. Price, Consensus and EPS Surprise\n\nNOV Inc. price-consensus-eps-surprise-chart | NOV Inc. Quote\n\nTrend in Estimate Revision\n\nThe Zacks Consensus Estimate for the first-quarter bottom line has remained the same in the last seven days. The estimated figure indicates a 28.7% fall year over year. The Zacks Consensus Estimate for revenues, meanwhile, suggests a 16.3% increase from the year-ago period.\n\nFactors to Consider\n\nBraskem is expected to have borne the brunt of lower sales volumes. In the October-to-December period, the company reported a 13% decline in sales, affected by weak demand in the Brazilian market. The downtrend is most likely to have continued in the first quarter, with export supply chain restrictions. This fall in volume is likely to have dragged down the revenues and cash flows of BAK.\r\n\r\nThe increase in Braskem’s costs might have dented the company’s to-be-reported bottom line. BAK’s cost of goods sold in the fourth quarter climbed to R$21.5 billion from R$13.8 billion in the year-earlier period. The upward cost trajectory is likely to have continued in the first quarter due to higher feedstock prices in international markets and global supply chain constraints.\n\nWhat Does Our Model Say?\n\nStory continues\n\nThe proven Zacks model does not conclusively show that Ovintiv is likely to beat estimates in the first quarter. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of beating estimates. But that’s not the case here.\r\n\r\nYou can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\r\n\r\nEarnings ESP: BAK has an Earnings ESP of 0.00%. This is because the Most Accurate Estimate and the Zacks Consensus Estimate are pegged at 82 cents per share each.\r\n\r\nZacks Rank: Braskem currently carries a Zacks Rank #5 (Sell).\n\nStocks to Consider\n\nWhile an earnings beat looks uncertain for Braskem, here are some firms that you may want to consider on the basis of our model:\r\n\r\nHighPeak Energy, Inc. HPK has an Earnings ESP of +2.97% and a Zacks Rank #1. The firm is scheduled to release earnings on May 16.\r\n\r\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nFor 2022, HPK has a projected earnings growth rate of 580.3%. Valued at around $2.9 billion, HighPeak Energy has soared around 216.5% in a year.\r\n\r\nBlend Labs, Inc. BLND has an Earnings ESP of +1.92% and is Zacks #2 Ranked. The firm is scheduled to release earnings on May 12.\r\n\r\nBLND is valued at around $874.7 million. For 2022, the company has a projected earnings growth rate of 22.7%. Blend Labs has lost around 83.7% in a year.\r\n\r\nBioCardia, Inc. BCDA has an Earnings ESP of +6.67% and a Zacks Rank #3. The firm is scheduled to release earnings on May 11.\r\n\r\nFor 2022, BCDA has a projected earnings growth rate of 2.7%. Valued at around $25.3 million, BioCardia has decreased around 61.4% in a year.\r\n\r\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nBioCardia, Inc. (BCDA) : Free Stock Analysis Report\r\n\r\nHighPeak Energy, Inc. (HPK) : Free Stock Analysis Report\r\n\r\nBlend Labs, Inc. (BLND) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/high-costs-low-sales-dent-122712508.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","CONSENSUS ESTIMATE","EARNINGS PER SHARE","ZACKS RANK"],"sentiment":{"polarity":0.993,"neg":0.032,"neu":0.867,"pos":0.102}},{"date":"2022-05-09T12:00:00+00:00","title":"Braskem Releases its First Ever Lineup of Sustainable 3D Printing Filaments for Additive Manufacturing","content":"New Sustainable 3D Printing Filaments Include Bio-Based EVA, Recycled PE\/PP Blend as well as Recycled PE\/PP Blend with Carbon Fiber\n\nBraskem to Highlight its Expanded Portfolio of 3D Printing Offerings at RAPID + TCT 2022, North America's Largest Additive Manufacturing Conference\n\nPHILADELPHIA, May 9, 2022 \/PRNewswire\/ -- Braskem (B3: BRKM3) (B3: BRKM5) (B3: BRKM6) (NYSE: BAK) (LATIBEX: XBRK) (\"Company\"), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, announces today the release of three new sustainable 3D printing filament product offerings for the additive manufacturing market. These first of their kind products include 3D printing filaments produced from bio-based ethylene vinyl acetate (EVA) filament derived from raw sugarcane as well from recycled polyethylene and polypropylene (PE\/PP) blended filaments with, or without, carbon fiber. Recycled Polyolefin Filament with Carbon Fiber\n\nThese sustainable products will be displayed in conjunction with Braskem's upcoming presence at Rapid + TCT, North America's largest Additive Manufacturing conference, being held at Huntington Place, in Detroit, Michigan from May 17 to 19, 2022. The RAPID + TCT 2022 conference brings together over 100 industry leaders focused on delivering leading-edge solutions to the 3D printing and additive manufacturing industry.\n\nJason Vagnozzi, Braskem Global Commercial Director of Additive Manufacturing, commented, \"Braskem has a longstanding history of innovating and producing more sustainable bio-based polymers, and today's launch announcement regarding green EVA and recycled polymer 3D printing filaments reaffirms our commitment to a more circular, carbon neutral future. We couldn't be more excited to present these newest additions to our 3D printing product portfolio at the RAPID + TCT 2022 conference as our clients seek more sustainability solutions for the future.\"\n\nStory continues\n\nNew Sustainable 3D Filaments for Additive Manufacturing\n\nBio-based EVA Filament – FL600EVA-BIO\n\nFL600EVA-BIO is a bio-based ethylene vinyl acetate (EVA) filament, derived from raw sugar care, providing a more sustainable alternative to traditional flexible materials available on the market. This low carbon footprint formulation delivers a unique combination of sustainability, flexibility, ductility, light-weighting, and moisture resistance for direct drive printing 3D printing systems. FL600EVA-BIO expands the availability of sustainable materials for use in 3D printing applications such as consumer, packaging, and industrial markets.\n\nApplications\n\nPackaging, Shoes, Fashion, Consumer, and Industrial Applications Rapid prototyping and mass-customization Flexible parts Lightweight parts Compatible with direct drive system 3D printers\n\nFeatures\n\nSustainability – Bio-based composition Flexibility – 94 Shore A hardness, elongation at break > 500% Low Density \/ lightweight Excellent Surface Finish Low Warpage and High Dimensional Stability Available Colors: Natural Available Diameters: 2.85mm, 1.75 mm\n\nBenefits\n\nNo Drying Required High Chemical Resistance Heated Chamber not Required Excellent Bed Adhesion\n\nRecycled Polyolefin Filament – FL600R\n\nBraskem FL600R is a recycled filament designed for use in material extrusion-based Additive Manufacturing while maximizing sustainably sourced content. Primarily sourced from recycled bottle caps, FL600R is a recycled PE\/PP blend containing over 90% sustainably sourced material, providing a more sustainable solution without sacrificing printability. This environmentally friendly filament provides the same low density as well as water, chemical, and impact resistance inherent to virgin polyethylene and polypropylene-based materials.\n\nApplications\n\nAutomotive, Packaging, Consumer, and Industrial Applications Rapid prototyping and mass-customization Lightweight part design Compatible with Ultimaker, Creality and similar equipment\n\nFeatures\n\n> 90% Sustainably Sourced Content High ductility Low Density and lightweight Excellent Surface Finish Low Warpage and High Dimensional Stability Available Colors: Black Available Diameters: 2.85mm, 1.75 mm\n\nBenefits\n\nNo Drying Required High Chemical Resistance Heated Chamber not Required Excellent Bed Adhesion Print Profiles Available on Ultimaker Cura Marketplace\n\nRecycled Polyolefin Filament with Carbon Fiber – FL605R-CF\n\nBraskem FL605R-CF is an engineering-grade polymer for additive manufacturing, containing 90% recycled content. Primarily sourced from recycled bottle caps, FL605R-CF is a recycled PE\/PP blend that incorporates the use of recycled carbon fiber for added strength and durability, providing a more sustainable solution without sacrificing printability and mechanical properties. This environmentally friendly filament provides the same low density as well as water, chemical, and impact resistance inherent to virgin polyethylene and polypropylene-based materials.\n\nApplications\n\nAutomotive, Aerospace, Packaging, Consumer, and Industrial Applications Rapid prototyping and mass-customization Lightweight and rigid part design Compatible with Ultimaker, Creality and similar equipment\n\nFeatures\n\n90% Recycled content High Strength and Stiffness Low Density and lightweight Excellent Surface Finish Low Warpage and High Dimensional Stability Available Colors: Black Available Diameters: 2.85mm, 1.75 mm\n\nBenefits\n\nNo Drying Required High Chemical Resistance Heated Chamber not Required Excellent Bed Adhesion Print Profiles Available on Ultimaker Cura Marketplace\n\nFor those attending the Rapid + TCT Conference, Jason Vagnozzi, Braskem Global Commercial Director of Additive Manufacturing, and Michelle Sing, Ph.D., Braskem Materials Development Research Engineer, will be keynote presenters. They will discuss the development and design of sustainable materials for additive manufacturing. Please check the schedule for keynote presentation times during the show. Make sure to also stop by the Braskem booth #3813 to see Braskem's full range of 3D printing and additive manufacturing offerings as well as connect with Braskem industry and product specialists. Braskem 3D materials are also available through our strategic distribution partners M. Holland and Nexeo Plastics, as well as visiting our Braskem 3D storefront on Amazon.\n\nAs one of the world's largest producers of polyolefins, Braskem offers solutions across 3D printing technologies such as Fused Filament Fabrication (FFF), Selective Laser Sintering (SLS), and High-speed Pellet Extrusion. Through Braskem's decades of expertise in materials science and product development, its state-of-the-art 3D printing labs, as well as its strategic partnerships with industry leaders, Braskem is committed to delivering new and innovative products to the market. If you are a start-up, university, equipment manufacturer, converter, compounder, or brand owner, Braskem's product development professionals can collaborate with you on your next 3D printing solution.\n\nTo learn more about Braskem's expanding portfolio for 3D printing and additive manufacturing, visit https:\/\/www.braskem.com\/usa\/3d-printing.\n\nABOUT BRASKEM With a global vision of the future oriented toward people and sustainability, Braskem is committed to contributing to the value chain for strengthening the Circular Economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improving people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico, and Germany, Braskem exports its products to clients in more than 80 countries.\n\nBraskem America, Inc. is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania, and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa.\n\nBraskem on English social media:\r\nwww.facebook.com\/BraskemGlobal\r\nwww.linkedin.com\/company\/braskem\r\nhttps:\/\/twitter.com\/braskem (PRNewsfoto\/Braskem) Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/braskem-releases-its-first-ever-lineup-of-sustainable-3d-printing-filaments-for-additive-manufacturing-301541628.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/braskem-releases-first-ever-lineup-120000375.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["3D PRINTING","ADDITIVE MANUFACTURING","BRASKEM","CARBON FIBER","SUSTAINABLE MATERIALS","SUSTAINABLE PRODUCTS"],"sentiment":{"polarity":0.998,"neg":0.03,"neu":0.864,"pos":0.107}},{"date":"2022-04-28T13:00:00+00:00","title":"Braskem and Lummus partnership: the next chapter for Green Ethylene technology","content":"The partnership focuses on the global licensing of commercial green ethylene technology, which will accelerate the development of chemicals and plastics made from bioethanol, a renewable feedstock.\n\nROTTERDAM, Netherlands, April 28, 2022 \/PRNewswire\/ -- Braskem S.A. (B3: BRKM3, BRKM5, and BRKM6; NYSE: BAK; LATIBEX: XBRK) (\"Braskem\"), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, and Lummus Technology, a global provider of process technologies and value-driven energy solutions, have formed a partnership that aims to license Braskem's technology to produce green ethylene worldwide. This partnership will accelerate the use of bioethanol for chemicals and plastics, supporting the industry's efforts toward a carbon neutral circular economy. (PRNewsfoto\/Braskem)\n\nThis partnership will accelerate the use of bioethanol for chemicals and plastics.\n\nBraskem is one of the pioneer suppliers of renewable raw materials for bio-based plastics production and has recently announced a target to produce 1 million tons of I'm green™ polyethylene by 2030. Cooperation will be key to achieving this goal and this new partnership with Lummus will bring complementary knowledge and skills to shorten the timeline to the target, while at the same time extending the geographic reach of the technology.\n\nLummus, a recognized leader in ethylene production technologies, has licensed approximately 40 percent of global ethylene capacity, giving the company the technical capability as well as the licensing expertise to further develop and market the technology behind green ethylene. This partnership enables the license of the technology globally, in addition to the first two projects being developed in the US and Thailand, the latter still under evaluation and subject to the approvals of the respective competent governance bodies.\n\nThis partnership is also aligned with Braskem's purpose to make people's lives better and support ways to foster a safe climate future. The demand for green ethylene is growing and the licensing of a proven technology that has been used for more than 10 years provides the necessary confidence for future investments. Together, Braskem and Lummus are ensuring the growth of green ethylene production worldwide.\n\nStory continues\n\n\"Lummus brings licensing experience and process knowledge into this partnership to extend the reach of Braskem's proven green ethylene technology worldwide. With this initiative, we believe we are also contributing with an alternative for the industry to move towards a carbon neutral circular economy,\" said Walmir Soller, VP Olefins\/Polyolefins Braskem Europe & Asia, and CEO Braskem Netherlands BV.\n\n\"We are truly excited with this partnership, which helps the world shift from fossil fuels to diversify the feedstock sources for chemicals and plastics with biomass as a feed source for chemicals and plastics. Leveraging the combined experience and expertise of Lummus and Braskem to produce green ethylene thus reduces carbon footprint and plays a promising role in the energy transition. Braskem has already been operating the technology successfully at a large scale, and together we are going to expand the world's production of low carbon chemicals and biopolymers from renewable feedstocks, helping our customers decarbonize their assets and produce greener products,\" said Leon de Bruyn, President and Chief Executive Officer of Lummus Technology.\n\nAbout Lummus Technology\n\nLummus Technology is the global leader in developing process technologies that make modern life possible and focus on a more sustainable, low-carbon future. Lummus is a master licensor of clean energy, petrochemical, refining, gas processing, and renewable technologies, and a supplier of catalysts, proprietary equipment, digitalization, and related lifecycle services to customers worldwide. To learn more about Lummus, visit www.LummusTechnology.com.\n\nABOUT BRASKEM\n\nWith a global vision of the future oriented toward people and sustainability, Braskem is engaged in contributing to the value chain in order to strengthen the Circular Economy. Its 8,000 team members dedicate themselves every day to improving people's lives through sustainable solutions in chemicals and plastics. With its corporate DNA rooted in innovation, Braskem offers a comprehensive portfolio of plastic resins and chemical products for diverse industries, such as food packaging, construction, manufacturing, automotive, agribusiness, health and hygiene, and more. With 41 industrial units in Brazil, the United States, Mexico, and Germany, Braskem exports its products to clients in over 80 countries. Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/braskem-and-lummus-partnership-the-next-chapter-for-green-ethylene-technology-301534286.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/braskem-lummus-partnership-next-chapter-130000103.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","ETHYLENE PRODUCTION","LUMMUS TECHNOLOGY","PARTNERSHIP","TECHNOLOGY"],"sentiment":{"polarity":0.997,"neg":0.005,"neu":0.868,"pos":0.127}},{"date":"2022-04-20T12:00:00+00:00","title":"Braskem Announces Participation at RAPID + TCT 2022 Conference","content":"Braskem to Highlight its Expanded Portfolio of 3D Printing Offerings at North America's Largest Additive Manufacturing Conference\n\nPHILADELPHIA, April 20, 2022 \/PRNewswire\/ -- Braskem (B3: BRKM3, BRKM5, and BRKM6; NYSE: BAK; LATIBEX: XBRK) (\"Company\"), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, announces today its upcoming presence at Rapid + TCT, North America's largest Additive Manufacturing conference, being held at Huntington Place, in Detroit, Michigan from May 17 to 19, 2022. The RAPID + TCT 2022 conference brings together over 100 industry leaders focused on delivering leading-edge solutions to the 3D printing and additive manufacturing industry. Braskem's polypropylene filament\n\nJason Vagnozzi, Braskem Global Commercial Director of Additive Manufacturing, stated, \"The Braskem team is incredibly excited to be participating in the RAPID + TCT 2022 conference as we share a common vision for bringing leading-edge product innovation to market to help take the additive manufacturing and 3D printing industry to the next level. Our presence at RAPID + TCT 2022 follows a significant expansion of our filament and pellet product lines with new carbon fiber and glass fiber reinforced offerings. We will also be showcasing our new line of recycled and bio-based material offerings for 3D; these products will bring a new level of capability and sustainability to the market.\"\n\nAs one of the world's largest producers of polyolefins, Braskem offers solutions across 3D printing technologies such as Fused Filament Fabrication (FFF), Selective Laser Sintering (SLS), and High-speed Pellet Extrusion. Through Braskem's decades of expertise in materials science and product development, its state-of-the-art 3D printing labs, as well as its strategic partnerships with industry leaders, Braskem is committed to delivering new and innovative products to the market. If you are a start-up, university, equipment manufacturer, converter, compounder, or brand owner, Braskem's product development professionals can collaborate with you on your next 3D printing solution.\n\nStory continues\n\nFor those attending the Rapid + TCT Conference, Jason Vagnozzi, Braskem Global Commercial Director of Additive Manufacturing, and Michelle Sing, Ph.D., Braskem Materials Development Research Engineer, will be keynote presenters. They will discuss the development and design of sustainable materials for additive manufacturing. Please check the schedule for keynote presentation times during the show. Make sure to also stop by the Braskem Booth #3813 to see Braskem's full range of 3D printing and additive manufacturing offerings as well as connect with Braskem industry and product specialists. Braskem offerings on display at Rapid + TCT will include:\n\n3D Filaments for Additive Manufacturing\n\nPolyethylene Filament (FL300PE) Braskem FL300PE is a 100% Polyethylene (PE) filament designed to be easy to print, lightweight, highly moisture and chemical resistant. This filament is ideal for packaging, prototyping, as well as industrial and consumer goods applications. FL300PE is an excellent solution anywhere traditional HDPE resins are typically required.\n\nPolypropylene (PP) Filament (FL105PP) Braskem FL105PP Polypropylene filament is a specially formulated co-polymer for additive manufacturing. This formulation is design to maximize printability, dimensional stability, and surface finish, while minimizing warpage.\n\nCarbon Fiber Reinforced Polypropylene Filament (FL900PP-CF) Braskem, FL900PP-CF Carbon Fiber Reinforced Polypropylene filament is a specially formulated co-polymer for additive manufacturing. Contains 100% recycled carbon fiber for optimal strength and durability. This formulation is design to maximize printability, dimensional stability, and surface finish, while minimizing warpage.\n\nGlass Fiber Reinforced Polypropylene Filament (FL500PP-GF) Braskem, FL500PP-GF Glass Fiber Reinforced Polypropylene filament is a specially formulated co-polymer for additive manufacturing. Contains glass fiber for added strength and durability. This formulation is designed to maximize printability, dimensional stability, and surface finish, while minimizing warpage and bed adhesion issues.\n\nRecycled Polyolefin Filament with Carbon Fiber (FL605R-CF) Braskem FL605R-CF is an engineering-grade polymer for additive manufacturing, containing 90% recycled content. Primarily sourced from recycled bottle caps, FL605R-CF is a recycled PE\/PP blend that incorporates the use of recycled carbon fiber for added strength and durability. FL605R-CF provides a more sustainable solution without sacrificing printability and mechanical properties. This environmentally friendly filament provides the same low density as well as water, chemical, and impact resistance inherent to virgin polyethylene and polypropylene-based materials.\n\n3D Pellets for Additive Manufacturing\n\nPolypropylene Pellets (GR105PP) Braskem GR105PP Polypropylene pellets are a specially formulated co-polymer for additive manufacturing. This formulation is design to maximize printability, dimensional stability, and surface finish, while minimizing warpage.\n\nCarbon Fiber Reinforced Polypropylene Pellets (GR900PP-CF) Braskem, FL900PP-CF Carbon Fiber Reinforced Polypropylene pellets are a specially formulated co-polymer for additive manufacturing. Contains 100% recycled carbon fiber for optimal strength and durability. This formulation is design to maximize printability, dimensional stability, and surface finish, while minimizing warpage.\n\nGlass Fiber Reinforced Polypropylene Pellets (GR500PP-GF) Braskem, GR500PP-GF Glass Fiber Reinforced Polypropylene pellets are a specially formulated co-polymer for additive manufacturing. Contains glass fiber for added strength and durability. This formulation is design to maximize printability, dimensional stability, and surface finish, while minimizing warpage and bed adhesion issues.\n\nRecycled Polyolefin Pellets with Carbon Fiber (GR605R-CF) Braskem GR605R-CF is an engineering-grade polymer for additive manufacturing, containing 90% recycled content. Primarily sourced from recycled bottle caps, GR605R-CF is a recycled PE\/PP blend that incorporates the use of recycled carbon fiber for added strength and durability. GR605R-CF provides a more sustainable solution without sacrificing printability and mechanical properties. This environmentally friendly filament provides the same low density as well as water, chemical, and impact resistance inherent to virgin polyethylene and polypropylene-based materials.\n\nTo learn more about Braskem's expanding portfolio for 3D printing and additive manufacturing, visit https:\/\/www.braskem.com\/usa\/3d-printing.\n\nABOUT BRASKEM With a global vision of the future-oriented towards people and sustainability, Braskem is committed to contributing to the value chain for strengthening the Circular Economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improve people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico, and Germany, Braskem exports its products to clients in more than 80 countries.\n\nBraskem America, Inc. is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania, and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa. Braskem 3D materials are also available through our strategic distribution partners M. Holland and Nexeo, as well as visiting our Braskem 3D storefront on Amazon.\n\nBraskem on English social media:\r\nwww.facebook.com\/BraskemGlobal\r\nwww.linkedin.com\/company\/braskem\r\nwww.twitter.com\/BraskemSA (PRNewsfoto\/Braskem) Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/braskem-announces-participation-at-rapid--tct-2022-conference-301528229.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/braskem-announces-participation-rapid-tct-120000750.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["3D PRINTING","ADDITIVE MANUFACTURING","BRASKEM","CARBON FIBER","POLYPROPYLENE"],"sentiment":{"polarity":0.999,"neg":0.005,"neu":0.881,"pos":0.114}},{"date":"2022-04-19T12:00:00+00:00","title":"The Philadelphia Eagles Join Sustainability Partner Braskem to Clean Up South Philadelphia's Historic FDR Park","content":"FDR Park is part of the Fairmount Park System and is the largest park in South Philadelphia\n\nPHILADELPHIA, April 19, 2022 \/PRNewswire\/ -- Braskem (B3: BRKM3, BRKM5, and BRKM6; LATIBEX: XBRK; OTC: BRKMY), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale cleaned up South Philadelphia'sFDR Park today with the help of the Philadelphia Eagles. Covering 348 acres, FDR Park is South Philadelphia's largest park and is located adjacent to Lincoln Financial Field, home of the Eagles. Braskem will also donate a new bench made from recycled items at Lincoln Financial Field, which includes plastic bottle caps, food service trays, and even stadium seats. (PRNewsfoto\/Braskem)\n\nBraskem and the Eagles joined forces in September 2018, entering a nine-year sustainability-focused partnership.\n\n\"At Fairmount Park Conservancy, we are grateful when members of the community pitch in to show their love for Philadelphia's parks. The Philadelphia Eagles and Braskem's efforts in the gem of FDR Park are very much appreciated as both organizations are focused on sustainability. We hope other companies will follow their lead!\" shared Maura McCarthy, Executive Director.\n\nBraskem and the Eagles joined forces in September 2018, entering a nine-year sustainability-focused partnership. The partnership included the development of a closed-loop recycling program for bottle caps and other plastic products, as well as an education platform for 30 Philadelphia-area schools to teach students about Science, Technology, Engineering, and Math (STEM) career opportunities to inspire the next generation of STEM leaders. This educational focus is the central pillar of the parties' partnership around strengthening youth-focused STEM education.\n\n\"Braskem is excited to further strengthen our partnership with the Eagles and Fairmount Park Conservancy and support our local community by participating in a joint cleanup effort for FDR Park, one of Philadelphia's most important public institutions and outdoor recreational spaces. Braskem, aligned with the UN Sustainable Development Goals for 2030, has made sustainable commitments to people and the planet. Two of these commitments center around eliminating plastic waste and helping to advance local development in the communities where Braskem operates. Seizing opportunities where we can make our community cleaner so it can be better enjoyed by its members coupled with strengthening relationships with organizations who can help us amplify this sort of impact are critically important to Braskem,\" stated Geoff Inch, North America Sustainability Director, Braskem.\n\nStory continues\n\nSince 2018, 60,000 pounds of plastic items, such as bottle caps, films, stadium seats, and food service trays, have been collected and recycled from the team's facilities. The recycled plastic is then turned into new applications, such as park benches. In 2021, the Eagles and Braskem donated one of the recycled park benches (produced in Eagles team colors) to the William C. Longstreth School Playground Build. Plastics benefit our lives by preserving and protecting our beverages and food, making sports equipment lighter and safer, and light-weighting cars and planes to use less energy and fuel. Braskem supports recycling these products at the end of their life cycle so they can create a new life as post-recycled material to continue benefiting society.\n\n\"Our partnership with Braskem has allowed us to expand our sustainability efforts by creating innovative recycling solutions at our facilities and an engaging STEM curriculum for young students in the classroom,\" said Norman Vossschulte, Director of Fan Experience, Philadelphia Eagles. \"As a LEED Gold and ISO 20121 certified organization, the Eagles are committed to protecting the environment, including our home in Philadelphia. We are proud to join Braskem in the cleanup of FDR Park and in efforts to create a cleaner, more sustainable world for everyone.\"\n\nBraskem is strongly committed to a Carbon Neutral Circular Economy where nothing is wasted, and everything is transformed. To support this vision for the future, Braskem has clearly stated targets for growing the company's recycled content product portfolio to sales of 300,000 tons by 2025 and one million tons by 2030. Braskem's transition to a circular economy is deeply rooted in mechanical and advanced recycling solutions. By engaging and investing in partnerships with other members of the value chain, the company is strengthening mechanical and advanced recycling, overcoming barriers, and ensuring the increased production of high-quality recycled material. All these initiatives are aligned with Braskem's feedstock diversification strategy and its macro goals of expanding the circular economy concept in the plastic chain and becoming a carbon-neutral company by 2050.\n\nFor more information on Braskem's global sustainable development strategy, please visit www.braskem.com\/sustainabledevelopmentstrategy.\n\nABOUT BRASKEM\n\nWith a global vision of the future oriented towards people and sustainability, Braskem is committed to contributing to the value chain for strengthening the Circular Economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improve people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico, and Germany, Braskem exports its products to clients in more than 80 countries.\n\nBraskem America is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa.\n\nBraskem on social media: Philadelphia Eagles on social media: www.facebook.com\/BraskemGlobal www.facebook.com\/philadelphiaeagles www.linkedin.com\/company\/braskem www.linkedin.com\/company\/philadelphia-eagles www.twitter.com\/Braskem www.twitter.com\/Eagles Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/the-philadelphia-eagles-join-sustainability-partner-braskem-to-clean-up-south-philadelphias-historic-fdr-park-301527831.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/philadelphia-eagles-join-sustainability-partner-120000942.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","BRASKEM AMERICA","FDR PARK","LINCOLN FINANCIAL FIELD","PARK CONSERVANCY","PHILADELPHIA","PHILADELPHIA EAGLES","THE EAGLES"],"sentiment":{"polarity":0.999,"neg":0.003,"neu":0.826,"pos":0.172}},{"date":"2022-04-12T15:40:03+00:00","title":"E vs. BAK: Which Stock Should Value Investors Buy Now?","content":"Investors with an interest in Oil and Gas - Integrated - International stocks have likely encountered both Eni SpA (E) and Braskem (BAK). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.\n\nEveryone has their own methods for finding great value opportunities, but our model includes pairing an impressive grade in the Value category of our Style Scores system with a strong Zacks Rank. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits.\n\nEni SpA has a Zacks Rank of #1 (Strong Buy), while Braskem has a Zacks Rank of #5 (Strong Sell) right now. The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that E has an improving earnings outlook. But this is just one factor that value investors are interested in.\n\nValue investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels.\n\nOur Value category grades stocks based on a number of key metrics, including the tried-and-true P\/E ratio, the P\/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.\n\nE currently has a forward P\/E ratio of 4.78, while BAK has a forward P\/E of 5. We also note that E has a PEG ratio of 0.46. This popular figure is similar to the widely-used P\/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. BAK currently has a PEG ratio of 0.52.\n\nAnother notable valuation metric for E is its P\/B ratio of 1.03. Investors use the P\/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, BAK has a P\/B of 5.67.\n\nBased on these metrics and many more, E holds a Value grade of A, while BAK has a Value grade of C.\n\nE is currently sporting an improving earnings outlook, which makes it stick out in our Zacks Rank model. And, based on the above valuation metrics, we feel that E is likely the superior value option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nEni SpA (E) : Free Stock Analysis Report\r\n \r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/e-vs-bak-stock-value-154003922.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","E.US","EIPAF.US","EN.MX","ENI.F","ENI.MI","ENI.XETRA","ENI1.F"],"tags":["BRASKEM","ENI SPA","INTERNATIONAL STOCKS","STRONG BUY","UNDERVALUED STOCKS","VALUE CATEGORY","VALUE INVESTORS","ZACKS RANK"],"sentiment":{"polarity":0.999,"neg":0.004,"neu":0.755,"pos":0.241}},{"date":"2022-04-07T12:00:00+00:00","title":"Compact Membrane Systems and Braskem Start Up Optiperm™ Demonstration Plant","content":"Optiperm™ is an innovative technology for olefin-paraffin separation, aimed at higher production yields, decreasing waste streams, lowering carbon emissions, and reducing energy usage\n\nPHILADELPHIA, April 7, 2022 \/PRNewswire\/ -- Compact Membrane Systems, Inc. (CMS), a pioneer in membrane systems for energy transition applications and Braskem (B3: BRKM3, BRKM5 and BRKM6; NYSE: BAK; LATIBEX: XBRK), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, are pleased to announce that the long awaited pilot demonstration of CMS's Optiperm™ technology for light olefin paraffin separation has started up at Braskem's Marcus Hook facility. Braskem and Compact Membrane Systems\n\nThis is the largest demonstration of the Optiperm™ platform to date and includes commercial-sized modules.\n\nOptiperm™, CMS's breakthrough membrane technology, is designed to increase olefin production efficiency while decreasing waste streams, lowering carbon emissions, and reducing total energy usage. The modular nature of membranes allows olefin recovery from small and large process streams alike, debottlenecking processes and leveraging existing infrastructure in a more energy-efficient manner. CMS and Braskem recognize that capturing olefins from unused hydrocarbon process streams is essential to decreasing environmental impact while continuing to create the chemical building blocks for plastic resins and chemical products for diverse customer segments, such as healthcare and hygiene, food packaging, construction, manufacturing, automotive, agribusiness, among others.\n\nSuccessful demonstration paves the way for the roll out of Optiperm™ in olefins applications as well point source carbon capture for SMRs, steel, cement and other decarbonization applications.\n\nPilot details\n\nThis project will address the critical milestones of simultaneously producing high purity (>90%) paraffin and olefin rich streams with a multistage membrane design. The design is a replica of the design with membrane areas balanced between two stages and a full control system to meet stream purity specs. The rig itself was built by Zeton, the world's leading designer and builder of lab scale systems, pilot plants, demonstration plants and modular systems. The pilot has been deployed at Braskem's Marcus Hook facility and will be operated for a period of 500 days. \"Braskem believes that investing in the advancement of technology is a leading factor in the search for a more sustainable future\" says Kevin Soucy, Technology Improvements Manager, Braskem. \"The successful startup of this pilot supports our commitments to the circular economy. Special thanks to both CMS and Braskem team members for completing the first step of such a complex project despite the challenges of the COVID-19 pandemic. We are very excited to continue to work with CMS through optimization and commercialization of their Optiperm™ technology.\"\n\nStory continues\n\nScale Up of Optiperm™\n\nThis is the largest demonstration of the Optiperm™ platform to date and includes commercial sized modules. Previously, CMS has demonstrated the stability of small-scale membranes. This will be the first demonstration that includes CMS's proprietary humidification design and a full-scale commercial membrane module produced at an industrial scale manufacturing facility. Commercial membrane products will be available from CMS as early as 2023.\n\n\"The team is delighted that this pilot unit is up and running. Optiperm™ olefins technology is an important part of our industrial decarbonization portfolio, validating for our customers that CMS technology can enable their business performance and GHG reduction goals. Placing commercial scale cartridges into the field is a major milestone for us and for the planet,\" says CMS CEO Erica Nemser. \"Braskem's vision and commitment to industry leading innovation has made this project the ideal commercial demonstration of our first generation Optiperm™ technology.\"\n\nABOUT COMPACT MEMBRANE SYSTEMS, INC. (CMS)\n\nCompact Membrane Systems (CMS) is dedicated to enabling the clean energy transition and improving the efficiency of chemical processing through membrane solutions. Located in Newport, DE, CMS harnesses the power of unique fluoropolymers to provide durable and effective chemical separation solutions in the toughest environments. CMS membranes can be used independently or in conjunction with existing infrastructure to recover and remonetize streams that would otherwise be undervalued or wasted. CMS technology delivers new sources of revenue and lowers costs for process industries including petrochemicals, biogas, refining, specialty chemical and pharmaceuticals.\n\nCMS combines innovative research with practical industry know-how to deliver modular units with lower energy usage and smaller footprints than existing separation technologies. From polymer development, to product engineering, to system design, CMS has the capabilities and partnerships to deliver projects of any size. For more information or to learn more, visit www.compactmembrane.com.\n\nCMS on social media: https:\/\/www.facebook.com\/CompactMembraneSystems\r\nhttps:\/\/www.linkedin.com\/company\/compact-membrane-systems-inc\/\r\nhttps:\/\/twitter.com\/compactmembrane\n\nABOUT BRASKEM\n\nWith a global vision of the future oriented towards people and sustainability, Braskem is committed to contributing to the value chain for strengthening the circular economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improve people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico, and Germany, Braskem exports its products to clients in more than 80 countries.\n\nBraskem America, Inc. is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa.\n\nFORWARD LOOKING STATEMENTS\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are statements that are not historical facts and are based on our management's current view and estimates of future economic and other circumstances, industry conditions, company performance and financial results, including Braskem's commitments to sustainability. The words \"commits,\" \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"plans\" and similar expressions, as they relate to the company, are intended to identify forward-looking statements. Statements regarding the implementation of operating, financing and other strategies and capital expenditure plans, the direction of future operations and the factors or trends affecting our financial condition, liquidity or results of operations are examples of forward-looking statements. Such statements reflect the current views of our management and are subject to a number of risks and uncertainties, many of which are outside of our control. There is no guarantee that the expected events, trends or results will actually occur. The statements are based on many assumptions and factors, including general economic and market conditions, industry conditions, and operating factors. Any changes in such assumptions or factors could cause actual results to differ materially from current expectations. Please refer to our annual report on Form 20-F for the year ended December 31, 2019 filed with the SEC, as well as any subsequent filings made by us pursuant to the Exchange Act, each of which is available on the SEC's website (www.sec.gov), for a full discussion of the risks and other factors that may impact any forward-looking statements in this presentation.\n\nBraskem on social media: www.facebook.com\/BraskemGlobal\r\nwww.linkedin.com\/company\/braskem\r\nwww.twitter.com\/BraskemSA (PRNewsfoto\/Braskem) Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/compact-membrane-systems-and-braskem-start-up-optiperm-demonstration-plant-301519516.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/compact-membrane-systems-braskem-start-120000513.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","DEMONSTRATION","ENERGY TRANSITION","INDUSTRIAL SCALE","MARCUS HOOK","MEMBRANE SYSTEMS","MEMBRANE TECHNOLOGY","TECHNOLOGY"],"sentiment":{"polarity":0.998,"neg":0.028,"neu":0.857,"pos":0.114}},{"date":"2022-04-01T12:48:12+00:00","title":"Best Growth Stocks to Buy for April 1st","content":"Here are three stocks with buy ranks and strong growth characteristics for investors to consider today, April 1st:\n\nBraskem BAK: This largest petrochemical operation company in Latin America which is among the five largest private companies in Brazil, carries a Zacks Rank #1 (Strong Buy), and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 5.7% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nBraskem has a PEG ratio of 0.38 compared with 0.53 for the industry. The company possesses a Growth Score of A.\n\nBraskem S.A. PEG Ratio (TTM) Braskem S.A. PEG Ratio (TTM)\n\nBraskem S.A. peg-ratio-ttm | Braskem S.A. Quote\n\nValero Energy VLO: This company is the largest independent refiner and marketer of petroleum products in the United States, it carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 14.7% over the last 60 days.\n\nValero Energy Corporation Price and Consensus Valero Energy Corporation Price and Consensus\n\nValero Energy Corporation price-consensus-chart | Valero Energy Corporation Quote\n\nValero Energy has a PEG ratio of 2.04 compared with 2.19 for the industry. The company possesses a Growth Score of A.\n\nValero Energy Corporation PEG Ratio (TTM) Valero Energy Corporation PEG Ratio (TTM)\n\nValero Energy Corporation peg-ratio-ttm | Valero Energy Corporation Quote\n\nMaxLinear MXL: This company which provides radiofrequency (RF), high-performance analog, and mixed-signal communications systems-on-chip solutions (SoCs) for the connected home, wired and wireless infrastructure, and industrial and multi-market applications worldwide, carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 17.8% over the last 60 days.\n\nMaxLinear, Inc Price and Consensus MaxLinear, Inc Price and Consensus\n\nMaxLinear, Inc price-consensus-chart | MaxLinear, Inc Quote\n\nMaxLinear has a PEG ratio of 0.79 compared with 1.66 for the industry. The company possesses a Growth Score of A\n\nMaxLinear, Inc PEG Ratio (TTM) MaxLinear, Inc PEG Ratio (TTM)\n\nMaxLinear, Inc peg-ratio-ttm | MaxLinear, Inc Quote\n\nStory continues\n\nSee the full list of top ranked stocks here.\n\nLearn more about the Growth score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nValero Energy Corporation (VLO) : Free Stock Analysis Report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nMaxLinear, Inc (MXL) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/best-growth-stocks-buy-april-124812926.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","JMX.F","MXL.US","V1L.F","VLO.MX","VLO.US"],"tags":["BRASKEM","BRASKEM S.A","CONSENSUS ESTIMATE","PEG RATIO","STRONG BUY","VALERO ENERGY","ZACKS RANK"],"sentiment":{"polarity":0.994,"neg":0,"neu":0.859,"pos":0.141}},{"date":"2022-03-23T12:49:38+00:00","title":"UPDATE 1-Brazil's Braskem considers partnerships for 'green plastic', has not committed to transaction -filing","content":"(Includes Braskem securities filing)\n\nSAO PAULO, March 23 (Reuters) - Brazilian petrochemical company Braskem SA said on Wednesday it will consider partnerships to reach 1 million tonnes in producing capacity of its biopolymers division by 2030.\n\nResponding to media reports saying the company hired Citigroup to manage a spin-off of its \"green plastic\" unit, Braskem said it constantly revises its portfolio.\n\nBut added it has \"no commitment or obligation\" to any transaction involving the unit, either the sale of a stake or an initial public offering.\n\nBrazilian newspaper Valor Economico said on Wednesday the division, which produces resins from renewable sources, is seeking to raise around $500 million with an IPO or other transaction, and added the so-called \"green plastic\" division would be valued at around $2 billion.\n\nCitigroup declined to comment.\n\n(Reporting by Tatiana Bautzer, Editing by Louise Heavens and Chizu Nomiyama)","link":"https:\/\/finance.yahoo.com\/news\/1-brazils-braskem-considers-partnerships-124938532.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","CITIGROUP","GREEN PLASTIC","INCLUDES BRASKEM","PETROCHEMICAL COMPANY","VALOR ECONôMICO"],"sentiment":{"polarity":0.807,"neg":0.015,"neu":0.907,"pos":0.078}},{"date":"2022-03-23T12:00:00+00:00","title":"Native Shoes Launches The Robbie with Braskem's I'm green™ Bio-Based EVA Polymer","content":"The Robbie breaks new ground with environmentally minded footwear created from Braskem's sustainably sourced sugarcane biopolymer\n\nPHILADELPHIA, March 23, 2022 \/PRNewswire\/ -- Braskem (B3: BRKM3, BRKM5 and BRKM6; NYSE: BAK; LATIBEX: XBRK) (\"Company\"), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, today announced its involvement in Native Shoes' new line of The Robbie footwear, created with Braskem's renewable and carbon negative I'm green™ bio-based EVA polymer. The Robbie shoe line by Native Shoes with Braskem’s I’m greenTM Bio-Based EVA Polymer\n\nNative Shoes designed The Robbie with Generation Do in mind – the kids of today who are growing up as the most educated, connected, socially-aware and environmentally-minded generation in history. They're unafraid to stand up for their beliefs, argue with the grown-ups and challenge the status quo – and this is the shoe to help them on their way.\n\nRenato Yoshino, Business Director, Olefins & Polyolefins South America, Braskem stated, \"As the largest polyolefins producer in the Americas, Braskem is focused on collaborating with companies that share our commitment to advancing the creation of more sustainable, consumer-friendly products with our I'm green™ portfolio of eco-friendly materials. Native Shoes is helping lead the movement to meet the growing consumer demand for more environmentally conscious footwear and taking fashion to the next level of sustainability. Braskem is delighted to work with like-minded partners around new sustainably focused products, to ensure our products make a measurable positive impact at every step, from design, to delivery, to re-use.\"\n\nKyle Housman, CEO of Native Shoes commented, \"Native Shoes is on a mission to make it easy for all to Live Lightly, and this is the design philosophy behind every new shoe we create. The Robbie was designed for Generation Do: the tiny activists who will grow up to change the world. We couldn't think of a better material to use for this shoe than Sugarlite™ - every bit as lightweight and comfortable as traditional EVA but made with sugarcane for a lighter greenhouse gas impact. We're excited to work with Braskem's I'm green™ polymer to bring Sugarlite™ - and some of our most innovative new designs - to life.\"\n\nStory continues\n\nSugarlite™ is Native Shoes' proprietary sugarcane-based EVA-blend material. Making up both the upper and midsole materials, Sugarlite™ offers the same lightweight, easy-clean, and odor-resistant properties for which Native Shoes are known and loved but has a greenhouse gas impact that is 22% lower than traditional EVA, based on an ISO-aligned life-cycle analysis conducted by a third-party consulting group. Currently, Sugarlite™ contains 40% bio-based content from Braskem's sustainably sourced I'm green™ carbon negative EVA sugarcane-based biopolymer and Native Shoes is working to responsibly increase this through design and innovation.\n\nFully recyclable via the Native Shoes Remix™ Project, Tiny Activists can easily mail their old shoes – including the Robbie – back to Native Shoes for free, where they will be given a second life as playgrounds for local communities in Vancouver, British Columbia. For more information on The Robbie visit Native Shoe online at www.nativeshoes.com\/robbie-collection.\n\nBraskem's I'm greenTM bio-based EVA is sustainably produced from sugarcane, a renewable source that contributes to the reduction in greenhouse gas emissions by CO2 capture. For those who want to adopt Green EVA into a new product concept, it is ideal for use in footwear, toys, general foams and much more.\n\nBraskem's Green EVA benefits include:\n\nRenewable Source: Sustainably sourced and produced from sugarcane, a renewable raw material. Drop-in Solution: Replaces the conventional resin without investments in new machinery for plastic transformation. Recyclable: Green EVA can be recycled and reused in the same stream already developed for conventional EVA.\n\nThe I'm greenTM brand represents Braskem's sustainable portfolio, aligned with its commitment to the circular economy. The goal is to combine innovation with sustainable development to achieve a better impact on the planet and society. To learn more about Braskem's sustainable I'm green™ portfolio, please visit online at: https:\/\/www.braskem.com.br\/imgreen\/home-en.\n\nABOUT NATIVE SHOES\n\nIt seems the heavier the world gets, the more it needs lightness. That's why we exist. Founded in 2009, Native Shoes fuses innovation, creativity, and curiosity to create a lighter, happier world for us all. From innovating biobased materials and animal-free design to recycling well-loved shoes via the Native Shoes Remix™ Project, our purpose is to make it easy for all to Live Lightly, every step of the way. www.nativeshoes.com\n\nABOUT BRASKEM\n\nWith a global vision of the future oriented towards people and sustainability, Braskem is committed to contributing to the value chain for strengthening the circular economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improve people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico, and Germany, Braskem exports its products to clients in more than 80 countries.\n\nBraskem America, Inc. is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa.\n\nBraskem on English social media: www.facebook.com\/BraskemGlobal\r\nwww.linkedin.com\/company\/braskem\r\nwww.twitter.com\/BraskemSA Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/native-shoes-launches-the-robbie-with-braskems-im-green-bio-based-eva-polymer-301508183.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/native-shoes-launches-robbie-braskems-120000475.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","BRASKEM AMERICA","NATIVE SHOES","ROBBIE"],"sentiment":{"polarity":0.999,"neg":0.014,"neu":0.841,"pos":0.145}},{"date":"2022-03-21T12:00:00+00:00","title":"Braskem Expands Additive Manufacturing Portfolio with Polyethylene and Glass Fiber Reinforced Polypropylene 3D Printing Filaments","content":"Polyethylene and Glass Fiber Reinforced Polypropylene are ideal solutions for a variety of applications including packaging, consumer, aerospace, automotive, industrial, and more\n\nPHILADELPHIA, March 21, 2022 \/PRNewswire\/ -- Braskem (B3: BRKM3, BRKM5 and BRKM6; NYSE: BAK; LATIBEX: XBRK) (\"Company\"), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, announces today the expansion of its 3D printing product portfolio to include polyethylene (PE) and glass fiber reinforced polypropylene (PP) filaments. Braskem's PE and glass fiber reinforced PP filaments are easier to print, have less warpage, minimal shrinkage, and better interlayer adhesion than other comparable products on the market. Glass Fiber Polypropylene\n\nBraskem's polypropylene and polyethylene products are the ideal solution for 3D printing.\n\nJason Vagnozzi, Braskem Commercial Director of Additive Manufacturing, stated, \"Braskem continues to evolve its product portfolio for the rapidly growing 3D printing market. Braskem's polypropylene and polyethylene products have superior printing capabilities with minimum warpage and are the ideal solution for 3D printing. Unlike other materials on the market, Braskem's PE is perfect for packaging and consumer applications and can be used anywhere HDPE would normally be used, while our new glass fiber reinforced polypropylene has added strength and durability which makes it a great solution for automotive, aerospace, medical, robotic, and industrial applications. At Braskem, our team strives every day to innovate and expand our portfolio of additive manufacturing products to facilitate the growth of our clients.\"\n\nGlass Fiber Reinforced PP 3D Printing Filament (FL500PP-GF)\r\nFL500PP-GF glass fiber reinforced polypropylene filament is a specially formulated co-polymer for additive manufacturing, containing glass fiber for added strength and durability. This formulation is designed to maximize printability, dimensional stability, and surface finish, while minimizing warpage and bed adhesion issues.\n\nStory continues\n\nApplications\n\nAutomotive, aerospace, medical, robotic, and industrial applications Rapid prototyping and mass-customization Lightweight and rigid part design Compatible with Ultimaker, Creality, and similar equipment\n\nFeatures\n\nHigh strength and stiffness Low density and lightweight Excellent surface finish Low warpage and high dimensional stability Available color: black Available diameters: 2.85mm, 1.75 mm\n\nBenefits\n\nNo drying required High chemical resistance Heated chamber not required Excellent bed adhesion Print profiles available on Ultimaker Cura Marketplace\n\nGlass fiber reinforced polypropylene filaments have a lower density than other plastics making it up to 30% lighter than traditional PLA and up to three times stiffer than ABS. In addition, polypropylene filaments do not require any drying prior to printing, unlike other materials such as nylon, making it more efficient to work with. These properties, combined with the recyclability of polypropylene, make it an attractive material for a wide range of 3D printing and additive manufacturing applications. Braskem filaments are designed with the end user in mind, making them a great choice for automotive, aerospace, medical, packaging, and other consumer applications.\n\nPolyethylene 3D Printing Filament (FL300PE) FL300PE is a 100% polyethylene filament designed to be easy to print, lightweight, highly moisture and chemical resistant. This filament is ideal for packaging, prototyping, as well as industrial and consumer goods applications. FL300PE is an excellent solution anywhere traditional HDPE resins are typically required.\n\nApplications\n\nPackaging, consumer, and industrial applications Rapid prototyping and mass-customization Compatible with Ultimaker, Creality and similar equipment\n\nFeatures\n\nLow density and lightweight Excellent surface finish Low warpage and high dimensional stability Available color: White Available diameters: 2.85mm, 1.75 mm\n\nBenefits\n\nNo drying required High chemical resistance Heated chamber not required Excellent bed adhesion Print profiles available on Ultimaker Cura Marketplace\n\nPolyethylene filaments have historically been difficult to print, prone to warpage and shrinkage. Braskem has taken a fresh look at polyethylene and developed a 100% HDPE filament that has been specifically engineered for 3D printing applications. Braskem's PE filaments are designed to be easy to print, lightweight, recyclable, highly moisture and chemical resistant. This filament is ideal for packaging, rapid prototyping, as well as industrial and consumer goods applications.\n\nTo learn more about Braskem's expanding portfolio for 3D printing and additive manufacturing, visit https:\/\/www.braskem.com\/usa\/3d-printing. Visit Braskem in person at North America's largest Additive Manufacturing event, Rapid + TCT, May 17-19 in Detroit. Braskem's booth # is 3813.\n\nABOUT BRASKEM With a global vision of the future oriented towards people and sustainability, Braskem is committed to contributing to the value chain for strengthening the Circular Economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improve people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico and Germany, Braskem exports its products to clients in more than 80 countries.\n\nBraskem America, Inc. is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa. Braskem 3D materials are also available through our strategic distribution partners M. Holland and Nexeo, as well as visiting our Braskem 3D storefront on Amazon.\n\nBraskem on English social media:\r\nwww.facebook.com\/BraskemGlobal\r\nwww.linkedin.com\/company\/braskem\r\nwww.twitter.com\/BraskemSA (PRNewsfoto\/Braskem) Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/braskem-expands-additive-manufacturing-portfolio-with-polyethylene-and-glass-fiber-reinforced-polypropylene-3d-printing-filaments-301503002.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/braskem-expands-additive-manufacturing-portfolio-120000307.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["3D PRINTING","3D PRINTING FILAMENT","ADDITIVE MANUFACTURING","BRASKEM","IDEAL SOLUTION","POLYETHYLENE PRODUCTS","POLYPROPYLENE","PRODUCT PORTFOLIO","RAPID PROTOTYPING"],"sentiment":{"polarity":0.999,"neg":0.023,"neu":0.831,"pos":0.146}},{"date":"2022-03-17T05:15:00+00:00","title":"Braskem reports recurring Operating Result in 2021 of US$5.6 billion, a record high and 171% higher than in 2020","content":"In December 2021, the Company distributed R$6.0 billion in anticipated dividends based on the results for fiscal year 2021\n\nIn 2021, the free cash flow yield was of 24%\n\nSÃO PAULO, March 17, 2022 \/PRNewswire\/ -- BRASKEM S.A. (B3: BRKM3, BRKM5 and BRKM6; NYSE: BAK; LATIBEX: XBRK) announces today its results for 4Q21 and 2021.\n\n4Q21 and 2021 HIGHLIGHTS:\n\nBraskem - Consolidated:\n\nIn 4Q21, Braskem's recurring Operating Result was US$1.1 billion, 23% lower than in 3Q21, mainly due to: (i) lower international spreads for main chemicals, PE and PP in Brazil, PP in the United States and Europe and PE in Mexico, but above the historical average of the past ten years1; and (ii) lower PP sales volume in Brazil, United States and Europe mainly explained by seasonality. Compared to 4Q20, recurring Operating Result in U.S. dollar increased 36%, due to: (i) better international spreads for main chemicals, PE and PVC in Brazil, PP in the United States and Europe and PE in Mexico; and (ii) higher sales volume of main chemicals and PVC in Brazil, PP in Europe and PE in Mexico. In Brazilian reais, recurring Operating Result was R$6.3 billion, 18% lower than in 3Q21 and 40% higher than in 4Q20, reflecting the Brazilian real depreciation against the U.S. dollar of 6.8% and 3.5%, respectively. In the quarter, Braskem reported Net Profit2 of R$0.5 billion. In 2021, the Company reported Net Profit² of R$14.0 billion. In December, the payment of anticipated dividends was made by the Company, based on the results of the fiscal year 2021, in the total amount of R$6.0 billion, corresponding to the gross amounts of R$7.539048791898 per common share and class \"A\" preferred share and of R$0.606032140100 per class \"B\" preferred share, representing a payout of 42.5% of the Net Profit². Additionally, the Company's Management will be proposing the distribution of additional dividends in the amount of R$1.35 billion referring to the fiscal year of 2021, which will be deliberated for approval at the Annual Shareholders' Meeting to be held on April 19, 2022. The Company's free cash flow was R$3.1 billion, with return3 on cash flow in 4Q21 of 24%. In the year, the free cash flow generation was an annual record of R$10.7 billion. Corporate leverage, measured by the ratio of adjusted net debt to recurring Operating Result4 in U.S. dollar, ended 2021 at 0.94x. In December, the risk rating agency Fitch Ratings upgraded the Company's risk rating on the global scale from BB+ to BBB-, with a stable outlook. With the rating upgrade by Fitch, Braskem is once again considered investment grade. In December, the Company contracted, with a syndicate of 11 global banks, an international stand-by credit facility in the amount of US$1.0 billion, due in December 2026, that replaces the current facility. Braskem received correspondence sent jointly by its shareholders Novonor and Petrobras on the evolution of the discussions for the potential sale of their equity interests in the Company and signed on December 15, 2021 a Term Sheet formalizing the commitment of both parties to take the necessary measures to (i) sell the preferred shares held by Novonor and Petrobras in Braskem, through a secondary public offering(s) of shares (follow-on); (ii) enable the Company to migrate to the Novo Mercado segment of B3 SA - Brasil, Bolsa, Balcão (\"B3\"), including the promotion of the necessary adaptations to Braskem's governance, which must be approved at the appropriate time, and negotiation of a new Braskem Shareholders' Agreement in order to adapt its rights and obligations to Braskem's new governance structure; and (iii) once Braskem has effectively migrated to the Novo Mercado, perform the sale of the remaining common shares held by Novonor and Petrobras in Braskem.\n\nESG:\n\nStory continues\n\nIn 2021, the overall accident frequency rate with and without lost time (CAF + SAF) was 0.86 event per million hours worked, 73,5% below the industry average, hitting the lowest rate in the last five years. Also, the Company achieved the best historical results in process safety with a Tier 1 + Tier 2 accident frequency rate of 0.32 event\/million hours, 30% lower while compared to its 2020 metrics. In November, Braskem S.A., through its subsidiary Braskem Netherlands B.V., and Lummus Technology LLC, a worldwide leader in ethylene, petrochemical, energy transition and other process technologies, executed a memorandum of understanding to jointly license Braskem's green ethylene technology – from ethanol to ethylene - to two projects in different regions of the world: (i) a project under development in North America; and (ii) a project under evaluation in Thailand. In December, the first mechanical recycling line in Brazil came into operation, as a result of the partnership between Braskem and Valoren. The plant, located in Indaiatuba (São Paulo), has the capacity to transform around 250 million pieces of packaging into 14,000 tons of high-quality post-consumer resin per year. In December, Braskem announced the return to the Sustainability Index (\"ISE\") of the B3, reflecting the Company's continuous commitment to the best practices of corporate governance, social responsibility, economic-financial and environmental management. In December, Braskem was included in the ranking of leading companies in water management (A) and climate risks (A-) of the CDP (Carbon Disclosure Program) for the seventh consecutive time, achieving maximum classification in the \"Water List\" for the fifth consecutive time and remained the leading company on the \"Climate List\" for the seventh consecutive time, reinforcing its engagement and positive impact on the topic. In 2021, Braskem participated in 146 social projects, which benefited more than 800,000 people globally, including private social investments, donations, volunteer programs and initiatives to fight the pandemic. In 4Q21, the Company: (i) allocated R$3.2 million to the Saving Lives project, with BNDES matchfunding, to purchase oxygen plants and hospital equipment; (ii) donated R$1.1 million in hygiene and cleaning materials to the Government of the State of Bahia to support families affected by the heavy rains; and (iii) donated around R$660,000 to FIEB, which will revert the amount to basic food baskets, and another R$165,000 donated by Braskem Volunteers to CUFA \"Abrace a Bahia\". In January 2022, Braskem was one of the 23 companies in the industry included in the S&P Sustainability Yearbook for 2022, due to its good performance in the Corporate Sustainability Assessment (CSA) questionnaire in relation to the 234 peers evaluated. Braskem Europe has implemented a strategy of purchasing renewable energy for 100% of electricity consumption for its facilities between 2022 and 2024. With this strategy, it's projected a reduction of 80% in scope 2 greenhouse gas emissions during this period.\n\nThe full earnings release is available on the Company's IR website: www.braskem-ri.com.br\/home-en\n\nBraskem will host conference calls to discuss its Results THURSDAY, March 17 at 10:00 a.m. US ET.\n\nAdditional information may be obtained from the Investor Relations Department at +55 11 3576-9531 or braskem-ri@braskem.com.br.\n\n1 Considers the period from 2011 to 2020.\r\n2 Based on net profit (loss) attributable to the shareholders of the Company.\r\n3 Considers the free cash flow generation of the last 12 months over the Company's market value in the quarter.\r\n4 Excludes the Project Finance in Mexico and based on recurring Operating Result. Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/braskem-reports-recurring-operating-result-in-2021-of-us5-6-billion-a-record-high-and-171-higher-than-in-2020--301504792.html\n\nSOURCE Braskem S.A.","link":"https:\/\/finance.yahoo.com\/news\/braskem-reports-recurring-operating-result-051500922.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","BRASKEM S.A","PP","THE COMPANY"],"sentiment":{"polarity":0.998,"neg":0.034,"neu":0.862,"pos":0.104}},{"date":"2022-03-14T11:20:11+00:00","title":"Best Income Stocks to Buy for March 14th","content":"Here are three stocks with buy rank and strong income characteristics for investors to consider today, March 14th:\n\nBraskem S.A. BAK: This producer and seller of thermoplastic resins has witnessed the Zacks Consensus Estimate for its current year earnings increasing 4.8% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nThis Zacks Rank #1 (Strong Buy) company has a dividend yield of 15.1%, compared with the industry average of 4.2%.\n\nBraskem S.A. Dividend Yield (TTM) Braskem S.A. Dividend Yield (TTM)\n\nBraskem S.A. dividend-yield-ttm | Braskem S.A. Quote\n\nIndependent Bank Corporation IBCP: This holding company for Independent Bank has witnessed the Zacks Consensus Estimate for its current year earnings increasing 4.7 % over the last 60 days.\n\nIndependent Bank Corporation Price and Consensus Independent Bank Corporation Price and Consensus\n\nIndependent Bank Corporation price-consensus-chart | Independent Bank Corporation Quote\n\nThis Zacks Rank #1 company has a dividend yield of 3.8%, compared with the industry average of 2.4%.\n\nIndependent Bank Corporation Dividend Yield (TTM) Independent Bank Corporation Dividend Yield (TTM)\n\nIndependent Bank Corporation dividend-yield-ttm | Independent Bank Corporation Quote\n\nAtlantic Union Bankshares Corporation AUB: This holding company for Atlantic Union Bank has witnessed the Zacks Consensus Estimate for its current year earnings increasing 2.9% over the last 60 days.\n\nAtlantic Union Bankshares Corporation Price and Consensus Atlantic Union Bankshares Corporation Price and Consensus\n\nAtlantic Union Bankshares Corporation price-consensus-chart | Atlantic Union Bankshares Corporation Quote\n\nThis Zacks Rank #1 company has a dividend yield of 2.8%, compared with the industry average of 2.3%.\n\nAtlantic Union Bankshares Corporation Dividend Yield (TTM) Atlantic Union Bankshares Corporation Dividend Yield (TTM)\n\nAtlantic Union Bankshares Corporation dividend-yield-ttm | Atlantic Union Bankshares Corporation Quote\n\nSee the full list of top ranked stocks here.\n\nFind more top income stocks with some of our great premium screens.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nIndependent Bank Corporation (IBCP) : Free Stock Analysis Report\r\n\r\nAtlantic Union Bankshares Corporation (AUB) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-income-stocks-buy-march-112011985.html","symbols":["AUB.US","BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":[],"sentiment":{"polarity":0.977,"neg":0,"neu":0.929,"pos":0.071}},{"date":"2022-03-14T11:14:11+00:00","title":"Best Growth Stocks to Buy for March 14th","content":"Here are three stocks with buy ranks and strong growth characteristics for investors to consider today, March 14th:\n\nAsbury Automotive Group, Inc. ABG: This automotive retailer from the United States carries a Zacks Rank #1 (Strong Buy), and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 16.3% over the last 60 days.\n\nAsbury Automotive Group, Inc. Price and Consensus Asbury Automotive Group, Inc. Price and Consensus\n\nAsbury Automotive Group, Inc. price-consensus-chart | Asbury Automotive Group, Inc. Quote\n\nAsbury Automotive has a PEG ratio of 0.30 compared with 0.39 for the industry. The company possesses a Growth Score of A.\n\nAsbury Automotive Group, Inc. PEG Ratio (TTM) Asbury Automotive Group, Inc. PEG Ratio (TTM)\n\nAsbury Automotive Group, Inc. peg-ratio-ttm | Asbury Automotive Group, Inc. Quote\n\nConocoPhillips COP: This global oil exploration and production company carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 21.9% over the last 60 days.\n\nConocoPhillips Price and Consensus ConocoPhillips Price and Consensus\n\nConocoPhillips price-consensus-chart | ConocoPhillips Quote\n\nConocoPhillips has a PEG ratio of 0.49 compared with 0.59 for the industry. The company possesses a Growth Score of A.\n\nConocoPhillips PEG Ratio (TTM) ConocoPhillips PEG Ratio (TTM)\n\nConocoPhillips peg-ratio-ttm | ConocoPhillips Quote\n\nBraskem S.A. BAK: This producer and seller of thermoplastic resins carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 4.8% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nBraskem has a PEG ratio of 0.37 compared with 0.50 for the industry. The company possesses a Growth Score of B.\n\nBraskem S.A. PEG Ratio (TTM) Braskem S.A. PEG Ratio (TTM)\n\nBraskem S.A. peg-ratio-ttm | Braskem S.A. Quote\n\nSee the full list of top ranked stocks here.\n\nLearn more about the Growth score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nConocoPhillips (COP) : Free Stock Analysis Report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nAsbury Automotive Group, Inc. (ABG) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-growth-stocks-buy-march-111411912.html","symbols":["ABG.US","AWG.F","BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","COP.MX","COP.US","COPH34.SA","YCP.F","YCP.XETRA"],"tags":[],"sentiment":{"polarity":0.988,"neg":0,"neu":0.9,"pos":0.1}},{"date":"2022-03-11T11:46:11+00:00","title":"Best Growth Stocks to Buy for March 11th","content":"Here are three stocks with buy ranks and strong growth characteristics for investors to consider today, March 11th:\n\nAsbury Automotive Group, Inc. ABG: This automotive retailer from the United States carries a Zacks Rank #1 (Strong Buy), and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 16.3% over the last 60 days.\n\nAsbury Automotive Group, Inc. Price and Consensus Asbury Automotive Group, Inc. Price and Consensus\n\nAsbury Automotive Group, Inc. price-consensus-chart | Asbury Automotive Group, Inc. Quote\n\nAsbury Automotive has a PEG ratio of 0.29 compared with 0.39 for the industry. The company possesses a Growth Score of A.\n\nAsbury Automotive Group, Inc. PEG Ratio (TTM) Asbury Automotive Group, Inc. PEG Ratio (TTM)\n\nAsbury Automotive Group, Inc. peg-ratio-ttm | Asbury Automotive Group, Inc. Quote\n\nArcBest Corporation ARCB: This freight transportation and integrated logistics company carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 17.5% over the last 60 days.\n\nArcBest Corporation Price and Consensus ArcBest Corporation Price and Consensus\n\nArcBest Corporation price-consensus-chart | ArcBest Corporation Quote\n\nArcBest has a PEG ratio of 0.21 compared with 0.79 for the industry. The company possesses a Growth Score of A.\n\nArcBest Corporation PEG Ratio (TTM) ArcBest Corporation PEG Ratio (TTM)\n\nArcBest Corporation peg-ratio-ttm | ArcBest Corporation Quote\n\nBraskem S.A. BAK: This producer and seller of thermoplastic resins carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 5% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nBraskem has a PEG ratio of 0.38 compared with 0.47 for the industry. The company possesses a Growth Score of A.\n\nBraskem S.A. PEG Ratio (TTM) Braskem S.A. PEG Ratio (TTM)\n\nBraskem S.A. peg-ratio-ttm | Braskem S.A. Quote\n\nSee the full list of top ranked stocks here.\n\nLearn more about the Growth score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nAsbury Automotive Group, Inc. (ABG) : Free Stock Analysis Report\r\n\r\nArcBest Corporation (ARCB) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-growth-stocks-buy-march-114611999.html","symbols":["ABG.US","AQY.F","ARCB.US","AWG.F","BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["ARCBEST CORPORATION","ASBURY AUTOMOTIVE GROUP","CONSENSUS ESTIMATE","PEG RATIO","STRONG BUY","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.987,"neg":0,"neu":0.907,"pos":0.093}},{"date":"2022-03-08T13:33:01+00:00","title":"Best Income Stocks to Buy for March 8th","content":"Here are three stocks with buy rank and strong income characteristics for investors to consider today, March 8th:\n\nHorace Mann Educators Corporation HMN: This multiline insurance holding company that targets the U.S educator market has witnessed the Zacks Consensus Estimate for its current year earnings increasing 8.4% over the last 60 days.\n\nHorace Mann Educators Corporation Price and Consensus Horace Mann Educators Corporation Price and Consensus\n\nHorace Mann Educators Corporation price-consensus-chart | Horace Mann Educators Corporation Quote\n\nThis Zacks Rank #1 (Strong Buy) company has a dividend yield of 3%, compared with the industry average of 1.72%.\n\nHorace Mann Educators Corporation Dividend Yield (TTM) Horace Mann Educators Corporation Dividend Yield (TTM)\n\nHorace Mann Educators Corporation dividend-yield-ttm | Horace Mann Educators Corporation Quote\n\nBraskem S.A. BAK: This producer and seller of thermoplastic resins, one of the largest petrochemical operations in Latin America, has witnessed the Zacks Consensus Estimate for its current year earnings increasing 5% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nThis Zacks Rank #1 company has a dividend yield of 14.5%, compared with the industry average of 4%.\n\nBraskem S.A. Dividend Yield (TTM) Braskem S.A. Dividend Yield (TTM)\n\nBraskem S.A. dividend-yield-ttm | Braskem S.A. Quote\n\nLCNB Corp. LCNB: This financial holding and banking company has witnessed the Zacks Consensus Estimate for its current year earnings increasing 5.2% over the last 60 days.\n\nLCNB Corporation Price and Consensus LCNB Corporation Price and Consensus\n\nLCNB Corporation price-consensus-chart | LCNB Corporation Quote\n\nThis Zacks Rank #1 company has a dividend yield of 4.3%, compared with the industry average of 2.2%.\n\nLCNB Corporation Dividend Yield (TTM) LCNB Corporation Dividend Yield (TTM)\n\nLCNB Corporation dividend-yield-ttm | LCNB Corporation Quote\n\nSee the full list of top ranked stocks here\n\nFind more top income stocks with some of our great premium screens\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nHorace Mann Educators Corporation (HMN) : Free Stock Analysis Report\r\n\r\nLCNB Corporation (LCNB) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-income-stocks-buy-march-133301292.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","HM9.F","HMN.US","LCNB.US"],"tags":["CONSENSUS ESTIMATE","HORACE MANN","HORACE MANN EDUCATORS CORPORATION","STRONG BUY","ZACKS INVESTMENT RESEARCH"],"sentiment":{"polarity":0.977,"neg":0,"neu":0.93,"pos":0.07}},{"date":"2022-02-25T14:01:02+00:00","title":"Best Growth Stocks to Buy for February 25th","content":"Here are three stocks with buy ranks and strong growth characteristics for investors to consider today, February 25th:\n\nAsbury Automotive Group ABG: This automotive retailer carries a Zacks Rank #1 (Strong Buy), and has witnessed the Zacks Consensus Estimate for its current year earnings increasing almost 14.2% over the last 60 days.\n\nAsbury Automotive Group, Inc. Price and Consensus Asbury Automotive Group, Inc. Price and Consensus\n\nAsbury Automotive Group, Inc. price-consensus-chart | Asbury Automotive Group, Inc. Quote\n\nAsbury Automotive Group has a PEG ratio of 0.30 compared with 0.35 for the industry. The company possesses a Growth Score of A.\n\nAsbury Automotive Group, Inc. PEG Ratio (TTM) Asbury Automotive Group, Inc. PEG Ratio (TTM)\n\nAsbury Automotive Group, Inc. peg-ratio-ttm | Asbury Automotive Group, Inc. Quote\n\nArcBest ARCB: This company that provides freight transportation services and solutions carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 15.4% over the last 60 days.\n\nArcBest Corporation Price and Consensus ArcBest Corporation Price and Consensus\n\nArcBest Corporation price-consensus-chart | ArcBest Corporation Quote\n\nArcBest has a PEG ratio of 0.22 compared with 0.67 for the industry. The company possesses a Growth Score of A.\n\nArcBest Corporation PEG Ratio (TTM) ArcBest Corporation PEG Ratio (TTM)\n\nArcBest Corporation peg-ratio-ttm | ArcBest Corporation Quote\n\nBraskem BAK: This largest petrochemical operator in Latin America carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 5% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nBraskem has a PEG ratio of 0.38 compared with 0.53 for the industry. The company possesses a Growth Score of A.\n\nBraskem S.A. PEG Ratio (TTM) Braskem S.A. PEG Ratio (TTM)\n\nBraskem S.A. peg-ratio-ttm | Braskem S.A. Quote\n\nSee the full list of top ranked stocks here.\n\nLearn more about the Growth score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nAsbury Automotive Group, Inc. (ABG) : Free Stock Analysis Report\r\n\r\nArcBest Corporation (ARCB) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-growth-stocks-buy-february-140102246.html","symbols":["ABG.US","AQY.F","ARCB.US","AWG.F","BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["ASBURY AUTOMOTIVE GROUP","CONSENSUS ESTIMATE","PEG RATIO","STRONG BUY","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.986,"neg":0,"neu":0.909,"pos":0.091}},{"date":"2022-02-24T14:04:02+00:00","title":"Best Growth Stocks to Buy for February 24th","content":"Here are three stocks with buy ranks and strong growth characteristics for investors to consider today, February 24th:\n\nAsbury Automotive Group ABG: This automotive retailers carries a Zacks Rank #1 (Strong Buy), and has witnessed the Zacks Consensus Estimate for its current year earnings increasing almost 14.2% over the last 60 days.\n\nAsbury Automotive Group, Inc. Price and Consensus Asbury Automotive Group, Inc. Price and Consensus\n\nAsbury Automotive Group, Inc. price-consensus-chart | Asbury Automotive Group, Inc. Quote\n\nAsbury Automotive Group has a PEG ratio of 0.30 compared with 0.35 for the industry. The company possesses a Growth Score of A.\n\nAsbury Automotive Group, Inc. PEG Ratio (TTM) Asbury Automotive Group, Inc. PEG Ratio (TTM)\n\nAsbury Automotive Group, Inc. peg-ratio-ttm | Asbury Automotive Group, Inc. Quote\n\nArcBest ARCB: This freight transportation services and solutions carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 15.4% over the last 60 days.\n\nArcBest Corporation Price and Consensus ArcBest Corporation Price and Consensus\n\nArcBest Corporation price-consensus-chart | ArcBest Corporation Quote\n\nArcBest has a PEG ratio of 0.21 compared with 0.66 for the industry. The company possesses a Growth Score of A.\n\nArcBest Corporation PEG Ratio (TTM) ArcBest Corporation PEG Ratio (TTM)\n\nArcBest Corporation peg-ratio-ttm | ArcBest Corporation Quote\n\nBraskemBAK: This petrochemical operation company carries a Zacks Rank #1, and has witnessed the Zacks Consensus Estimate for its current year earnings increasing 5% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nBraskem has a PEG ratio of 0.39 compared with 0.53 for the industry. The company possesses a Growth Score of A.\n\nBraskem S.A. PEG Ratio (TTM) Braskem S.A. PEG Ratio (TTM)\n\nBraskem S.A. peg-ratio-ttm | Braskem S.A. Quote\n\nSee the full list of top ranked stocks here.\n\nLearn more about the Growth score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nAsbury Automotive Group, Inc. (ABG) : Free Stock Analysis Report\r\n\r\nArcBest Corporation (ARCB) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-growth-stocks-buy-february-140402502.html","symbols":["ABG.US","AQY.F","ARCB.US","AWG.F","BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA"],"tags":["ASBURY AUTOMOTIVE GROUP","CONSENSUS ESTIMATE","PEG RATIO","STRONG BUY","ZACKS INVESTMENT RESEARCH","ZACKS RANK"],"sentiment":{"polarity":0.986,"neg":0,"neu":0.907,"pos":0.093}},{"date":"2022-02-23T17:00:05+00:00","title":"What Makes Braskem (BAK) a New Strong Buy Stock","content":"Braskem (BAK) could be a solid addition to your portfolio given its recent upgrade to a Zacks Rank #1 (Strong Buy). This rating change essentially reflects an upward trend in earnings estimates -- one of the most powerful forces impacting stock prices.\n\nThe sole determinant of the Zacks rating is a company's changing earnings picture. The Zacks Consensus Estimate -- the consensus of EPS estimates from the sell-side analysts covering the stock -- for the current and following years is tracked by the system.\n\nThe power of a changing earnings picture in determining near-term stock price movements makes the Zacks rating system highly useful for individual investors, since it can be difficult to make decisions based on rating upgrades by Wall Street analysts. These are mostly driven by subjective factors that are hard to see and measure in real time.\n\nTherefore, the Zacks rating upgrade for Braskem basically reflects positivity about its earnings outlook that could translate into buying pressure and an increase in its stock price.\n\nMost Powerful Force Impacting Stock Prices\n\nThe change in a company's future earnings potential, as reflected in earnings estimate revisions, has proven to be strongly correlated with the near-term price movement of its stock. The influence of institutional investors has a partial contribution to this relationship, as these big professionals use earnings and earnings estimates to calculate the fair value of a company's shares. An increase or decrease in earnings estimates in their valuation models simply results in higher or lower fair value for a stock, and institutional investors typically buy or sell it. Their bulk investment action then leads to price movement for the stock.\n\nFor Braskem, rising earnings estimates and the consequent rating upgrade fundamentally mean an improvement in the company's underlying business. And investors' appreciation of this improving business trend should push the stock higher.\n\nStory continues\n\nHarnessing the Power of Earnings Estimate Revisions\n\nEmpirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock movements, so it could be truly rewarding if such revisions are tracked for making an investment decision. Here is where the tried-and-tested Zacks Rank stock-rating system plays an important role, as it effectively harnesses the power of earnings estimate revisions.\n\nThe Zacks Rank stock-rating system, which uses four factors related to earnings estimates to classify stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), has an impressive externally-audited track record, with Zacks Rank #1 stocks generating an average annual return of +25% since 1988. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here >>>>.\n\nEarnings Estimate Revisions for Braskem\n\nFor the fiscal year ending December 2021, this petrochemical company is expected to earn $9.01 per share, which is a change of 376.4% from the year-ago reported number.\n\nAnalysts have been steadily raising their estimates for Braskem. Over the past three months, the Zacks Consensus Estimate for the company has increased 8.7%.\n\nBottom Line\n\nUnlike the overly optimistic Wall Street analysts whose rating systems tend to be weighted toward favorable recommendations, the Zacks rating system maintains an equal proportion of 'buy' and 'sell' ratings for its entire universe of more than 4000 stocks at any point in time. Irrespective of market conditions, only the top 5% of the Zacks-covered stocks get a 'Strong Buy' rating and the next 15% get a 'Buy' rating. So, the placement of a stock in the top 20% of the Zacks-covered stocks indicates its superior earnings estimate revision feature, making it a solid candidate for producing market-beating returns in the near term.\n\nYou can learn more about the Zacks Rank here >>>\n\nThe upgrade of Braskem to a Zacks Rank #1 positions it in the top 5% of the Zacks-covered stocks in terms of estimate revisions, implying that the stock might move higher in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/makes-braskem-bak-strong-buy-170005985.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA"],"tags":["BRASKEM","CONSENSUS ESTIMATE","EARNINGS ESTIMATE","EARNINGS ESTIMATES","ESTIMATE REVISIONS","RATING SYSTEM","STOCK PRICE","STOCK PRICES","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.997,"neg":0.011,"neu":0.861,"pos":0.128}},{"date":"2022-02-23T15:00:03+00:00","title":"Does Braskem (BAK) Have the Potential to Rally 30% as Wall Street Analysts Expect?","content":"Shares of Braskem (BAK) have gained 2% over the past four weeks to close the last trading session at $18.61, but there could still be a solid upside left in the stock if short-term price targets of Wall Street analysts are any indication. Going by the price targets, the mean estimate of $24.25 indicates a potential upside of 30.3%.\n\nThe average comprises four short-term price targets ranging from a low of $17 to a high of $32, with a standard deviation of $6.95. While the lowest estimate indicates a decline of 8.7% from the current price level, the most optimistic estimate points to a 72% upside. More than the range, one should note the standard deviation here, as it helps understand the variability of the estimates. The smaller the standard deviation, the greater the agreement among analysts.\n\nWhile the consensus price target is highly sought after by investors, the ability and unbiasedness of analysts in setting price targets have long been questionable. And investors making investment decisions solely based on this tool would arguably do themselves a disservice.\n\nHowever, an impressive consensus price target is not the only factor that indicates a potential upside in BAK. This view is strengthened by the agreement among analysts that the company will report better earnings than what they estimated earlier. Though a positive trend in earnings estimate revisions doesn't give any idea as to how much the stock could surge, it has proven effective in predicting an upside.\n\nHere's What You Should Know About Analysts' Price Targets\n\nAccording to researchers at several universities across the globe, a price target is one of many pieces of information about a stock that misleads investors far more often than it guides. In fact, empirical research shows that price targets set by several analysts, irrespective of the extent of agreement, rarely indicate where the price of a stock could actually be heading.\n\nWhile Wall Street analysts have deep knowledge of a company's fundamentals and the sensitivity of its business to economic and industry issues, many of them tend to set overly optimistic price targets. Are you wondering why?\n\nStory continues\n\nThey usually do that to drum up interest in shares of companies that their firms either have existing business relationships with or are looking to be associated with. In other words, business incentives of firms covering a stock often result in inflated price targets set by analysts.\n\nHowever, a tight clustering of price targets, which is represented by a low standard deviation, indicates that analysts have a high degree of agreement about the direction and magnitude of a stock's price movement. While that doesn't necessarily mean the stock will hit the average price target, it could be a good starting point for further research aimed at identifying the potential fundamental driving forces.\n\nThat said, while investors should not entirely ignore price targets, making an investment decision solely based on them could lead to disappointing ROI. So, price targets should always be treated with a high degree of skepticism.\n\nWhy BAK Could Witness a Solid Upside\n\nAnalysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason to expect an upside in the stock. That's because empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current year, two estimates have moved higher over the last 30 days compared to no negative revision. As a result, the Zacks Consensus Estimate has increased 5.8%.\n\nMoreover, BAK currently has a Zacks Rank #1 (Strong Buy), which means it is in the top 5% of more than the 4,000 stocks that we rank based on four factors related to earnings estimates. Given an impressive externally-audited track record, this is a more conclusive indication of the stock's potential upside in the near term. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\n\nTherefore, while the consensus price target may not be a reliable indicator of how much BAK could gain, the direction of price movement it implies does appear to be a good guide.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/does-braskem-bak-potential-rally-150003949.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA"],"tags":["BRASKEM","ESTIMATE REVISIONS","PRICE TARGETS","STANDARD DEVIATION","WALL STREET ANALYSTS"],"sentiment":{"polarity":0.999,"neg":0.035,"neu":0.807,"pos":0.158}},{"date":"2022-02-23T15:00:03+00:00","title":"Best Momentum Stocks to Buy for February 23rd","content":"Here are three stocks with buy rank and strong momentum characteristics for investors to consider today, February 23rd:\n\nTenaris TS: This leading manufacturer and supplier of seamless steel pipe products and associated services to the oil and gas, energy and other industries has a Zacks Rank #1 (Strong Buy) and witnessed the Zacks Consensus Estimate for its current year earnings increasing 11.5% over the last 60 days.\n\nTenaris S.A. Price and Consensus Tenaris S.A. Price and Consensus\n\nTenaris S.A. price-consensus-chart | Tenaris S.A. Quote\n\nTenaris’ shares gained 8.9% over the last one month compared with the S&P 500’s decline of 1.3%. The company possesses a Momentum Score of A.\n\nTenaris S.A. Price Tenaris S.A. Price\n\nTenaris S.A. price | Tenaris S.A. Quote\n\nBraskem BAK: This largest petrochemical operator in Latin America has a Zacks Rank #1 and witnessed the Zacks Consensus Estimate for its current year earnings increasing 4.8% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nBraskem’s shares gained 2.3% over the last one month compared with the S&P 500’s decline of 1.3%. The company possesses a Momentum Score of A.\n\nBraskem S.A. Price Braskem S.A. Price\n\nBraskem S.A. price | Braskem S.A. Quote\n\nIndependence Realty Trust IRT: This real estate investment trust has a Zacks Rank #1 and witnessed the Zacks Consensus Estimate for its current year earnings increasing 2.1% over the last 60 days.\n\nIndependence Realty Trust, Inc. Price and Consensus Independence Realty Trust, Inc. Price and Consensus\n\nIndependence Realty Trust, Inc. price-consensus-chart | Independence Realty Trust, Inc. Quote\n\nIndependence Realty Trust’s shares gained 12.8% over the last one month compared with the S&P 500’s decline of 1.3%. The company possesses a Momentum Score of B.\n\nIndependence Realty Trust, Inc. Price Independence Realty Trust, Inc. Price\n\nIndependence Realty Trust, Inc. price | Independence Realty Trust, Inc. Quote\n\nSee the full list of top ranked stocks here\n\nLearn more about the Momentum score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nTenaris S.A. (TS) : Free Stock Analysis Report\r\n\r\nIndependence Realty Trust, Inc. (IRT) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-momentum-stocks-buy-february-150003523.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","IRT.US","TEN.MI","TNRSF.US","TS.US","TW1.F","TW11.F"],"tags":["BRASKEM S.A","CONSENSUS ESTIMATE","INC","INDEPENDENCE REALTY TRUST","STRONG BUY","TENARIS S.A","TENARIS S.A. PRICE","ZACKS INVESTMENT RESEARCH"],"sentiment":{"polarity":0.997,"neg":0,"neu":0.83,"pos":0.17}},{"date":"2022-02-23T13:54:01+00:00","title":"Best Income Stocks to Buy for February 23rd","content":"Here are three stocks with buy rank and strong income characteristics for investors to consider today, February 23rd:\n\nGolden Ocean Group GOGL: This shipping company which is engaged in the transportation of dry bulk cargoes has witnessed the Zacks Consensus Estimate for its current year earnings increasing 5.4% over the last 60 days.\n\nGolden Ocean Group Limited Price and Consensus Golden Ocean Group Limited Price and Consensus\n\nGolden Ocean Group Limited price-consensus-chart | Golden Ocean Group Limited Quote\n\nThis Zacks Rank #1 (Strong Buy) company has a dividend yield of 28.38%, compared with the industry average of 0.60%.\n\nGolden Ocean Group Limited Dividend Yield (TTM) Golden Ocean Group Limited Dividend Yield (TTM)\n\nGolden Ocean Group Limited dividend-yield-ttm | Golden Ocean Group Limited Quote\n\nBraskem BAK: This petrochemical company which is among the five largest private companies in Brazil has witnessed the Zacks Consensus Estimate for its current year earnings increasing 4.8% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nThis Zacks Rank #1 company has a dividend yield of 13.86%, compared with the industry average of 3.37%.\n\nBraskem S.A. Dividend Yield (TTM) Braskem S.A. Dividend Yield (TTM)\n\nBraskem S.A. dividend-yield-ttm | Braskem S.A. Quote\n\nTenaris TS: This leading manufacturer and supplier of seamless steel pipe products and associated services to the oil and gas, energy and other industry company has witnessed the Zacks Consensus Estimate for its current year earnings increasing 11.6% over the last 60 days.\n\nTenaris S.A. Price and Consensus Tenaris S.A. Price and Consensus\n\nTenaris S.A. price-consensus-chart | Tenaris S.A. Quote\n\nThis Zacks Rank #1 company has a dividend yield of 2.02%, compared with the industry average of 0.82%.\n\nTenaris S.A. Dividend Yield (TTM) Tenaris S.A. Dividend Yield (TTM)\n\nTenaris S.A. dividend-yield-ttm | Tenaris S.A. Quote\n\nSee the full list of top ranked stocks here.\n\nFind more top income stocks with some of our great premium screens\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nTenaris S.A. (TS) : Free Stock Analysis Report\r\n\r\nGolden Ocean Group Limited (GOGL) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-income-stocks-buy-february-135401929.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","GOGL.OL","GOGL.US","TEN.MI","TNRSF.US","TS.US","TW1.F","TW11.F"],"tags":["CONSENSUS ESTIMATE","GOLDEN OCEAN GROUP","STRONG BUY","ZACKS INVESTMENT RESEARCH"],"sentiment":{"polarity":0.954,"neg":0.042,"neu":0.879,"pos":0.078}},{"date":"2022-02-23T13:00:00+00:00","title":"Braskem Expands its Circular Polymer Portfolio with New FDA Post-Consumer Recycled (PCR) Polypropylene Grades","content":"Braskem's new PCR polypropylene grades can be used in certain U.S. Food & Drug Administration food contact applications, including high temperature food packaging\n\nPHILADELPHIA, Feb. 23, 2022 \/PRNewswire\/ -- Braskem S.A. (B3: BRKM3, BRKM5 and BRKM6; NYSE: BAK; LATIBEX: XBRK) (\"Braskem\"), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, today announced the expansion of its circular polymer portfolio to include two new polypropylene (PP) grades with post-consumer recycled (PCR) content. (PRNewsfoto\/Braskem)\n\nBraskem's new PCR PP grades can be used in a wide range of FDA food contact applications where PP is used today.\n\nBraskem's new PCR polypropylene grades can be used in a wide range of U.S. Food and Drug Administration (FDA) food contact applications where PP is used today, including consumer packaging, caps and closures, housewares, and a wide range of thermoforming applications.\n\nGeoffrey Inch, Braskem North America Sustainability Director, commented on the product launch, \"Today's announcement is another milestone in Braskem's journey to a carbon neutral circular economy, and reinforces our commitment to polypropylene as the PP leader in North America. Not only will Braskem's new PCR polypropylene grades help our clients meet their commitments for recycled content in FDA food-contact markets, where PCR solutions are limited today, these developments will also keep us on track to reach our goals of providing 300,000 tons of thermoplastic resins and chemicals with recycled content by 2025 and one million tons of thermoplastic resins and chemicals with recycled content by 2030.\"\n\nBraskem PCR Polypropylene - Thermoforming Braskem PCR Polypropylene - Caps & Closures (C&C)\n\nTo support the sustainable use of polypropylene through the development and investment in the circular economy, Braskem America is a founding member and funding partner of the Polypropylene Recycling Coalition, with a primary focus on increasing U.S. polypropylene recovery and reuse. To learn more about the Polypropylene Recycling Coalition, the founding members, and how to join, visit https:\/\/recyclingpartnership.org\/polypropylene-coalition.\n\nStory continues\n\nBraskem is strongly committed to a Carbon Neutral Circular Economy where nothing is wasted, and everything is transformed. To support this vision for the future Braskem has clearly stated targets for growing the company's recycled content product portfolio to sales of 300,000 tons by 2025 and 1 million tons by 2030. Braskem's transition to a circular economy is deeply rooted in mechanical and advanced recycling solutions. By engaging and investing in partnership with other members of the value chain the company is strengthening mechanical and advanced recycling, overcoming barriers, and ensuring the increased production of high-quality recycled material. All these initiatives are aligned with Braskem's feedstock diversification strategy and its macro goals of expanding the circular economy concept in the plastic chain and becoming a carbon-neutral company by 2050. For more information on Braskem's global sustainable development strategy, please visit www.braskem.com\/sustainabledevelopmentstrategy.\n\nABOUT BRASKEM With a global vision of the future oriented towards people and sustainability, Braskem is committed to contributing to the value chain for strengthening the circular economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improve people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico, and Germany, Braskem exports its products to clients in more than 80 countries.\n\nBraskem America, Inc. is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa.\n\nBraskem on English social media:\n\nwww.facebook.com\/BraskemGlobal\r\nwww.linkedin.com\/company\/braskem\r\nwww.twitter.com\/BraskemSA Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/braskem-expands-its-circular-polymer-portfolio-with-new-fda-post-consumer-recycled-pcr-polypropylene-grades-301487530.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/braskem-expands-circular-polymer-portfolio-130000341.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","BRASKEM AMERICA","CIRCULAR ECONOMY","FDA","FOOD CONTACT","FOOD PACKAGING","POLYPROPYLENE"],"sentiment":{"polarity":0.997,"neg":0.003,"neu":0.871,"pos":0.126}},{"date":"2022-02-21T22:54:17+00:00","title":"Braskem's Q4 sales in Brazil fall 13% affected by lower demand","content":"SAO PAULO, Feb 21 (Reuters) - Petrochemical producer Braskem said on Monday its fourth-quarter resins sales volume in Brazil fell by 13% year-on-year, pushed by a lower demand in the Brazilian market.\n\nThe quarterly average utilization rate of Braskem's ethylene plants in Brazil was 85%, stable from the previous year, but 5 percentage points above the third quarter. Ethylene production volume also remained stable on a yearly basis, according to the company's operational preview.\n\nPolyethylene (PE) production in Mexico jumped 71% from the last quarter of 2020, with the PE plants utilization rate in the country increasing 34 percentage points to 81%. \"The increase is explained by the stoppage of operational activities in December 2020 due to an interruption in natural gas transportation,\" said Braskem. (Reporting by Peter Frontini Editing by Alistair Bell)","link":"https:\/\/finance.yahoo.com\/news\/braskems-q4-sales-brazil-fall-225417231.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","NG.COMM"],"tags":["BRASKEM","BRAZIL","ETHYLENE PLANTS","REMAINED STABLE"],"sentiment":{"polarity":0.671,"neg":0.044,"neu":0.88,"pos":0.076}},{"date":"2022-02-14T17:00:05+00:00","title":"Here's Why Momentum Investors Will Love Braskem (BAK)","content":"Momentum investing revolves around the idea of following a stock's recent trend in either direction. In the 'long' context, investors will be essentially be \"buying high, but hoping to sell even higher.\" With this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving that way. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.\n\nWhile many investors like to look for momentum in stocks, this can be very tough to define. There is a lot of debate surrounding which metrics are the best to focus on and which are poor quality indicators of future performance. The Zacks Momentum Style Score, part of the Zacks Style Scores, helps address this issue for us.\n\nBelow, we take a look at Braskem (BAK), a company that currently holds a Momentum Style Score of A. We also talk about price change and earnings estimate revisions, two of the main aspects of the Momentum Style Score.\n\nIt's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. Braskem currently has a Zacks Rank of #1 (Strong Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period.\n\nYou can see the current list of Zacks #1 Rank Stocks here >>>\n\nSet to Beat the Market?\n\nIn order to see if BAK is a promising momentum pick, let's examine some Momentum Style elements to see if this petrochemical company holds up.\n\nLooking at a stock's short-term price activity is a great way to gauge if it has momentum, since this can reflect both the current interest in a stock and if buyers or sellers have the upper hand at the moment. It's also helpful to compare a security to its industry; this can show investors the best companies in a particular area.\n\nStory continues\n\nFor BAK, shares are up 0.2% over the past week while the Zacks Oil and Gas - Integrated - International industry is up 0.2% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 8.11% compares favorably with the industry's 4.18% performance as well.\n\nConsidering longer term price metrics, like performance over the last three months or year, can be advantageous as well. Over the past quarter, shares of Braskem have risen 21.07%, and are up 80.21% in the last year. On the other hand, the S&P 500 has only moved -4.7% and 14.24%, respectively.\n\nInvestors should also pay attention to BAK's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. BAK is currently averaging 612,813 shares for the last 20 days.\n\nEarnings Outlook\n\nThe Zacks Momentum Style Score also takes into account trends in estimate revisions, in addition to price changes. Please note that estimate revision trends remain at the core of Zacks Rank as well. A nice path here can help show promise, and we have recently been seeing that with BAK.\n\nOver the past two months, 1 earnings estimate moved higher compared to none lower for the full year. These revisions helped boost BAK's consensus estimate, increasing from $8.90 to $9.01 in the past 60 days. Looking at the next fiscal year, 2 estimates have moved upwards while there have been no downward revisions in the same time period.\n\nBottom Line\n\nTaking into account all of these elements, it should come as no surprise that BAK is a #1 (Strong Buy) stock with a Momentum Score of A. If you've been searching for a fresh pick that's set to rise in the near-term, make sure to keep Braskem on your short list.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/heres-why-momentum-investors-love-170005234.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","EARNINGS ESTIMATE","ESTIMATE REVISIONS","MOMENTUM INVESTING","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.999,"neg":0.017,"neu":0.802,"pos":0.181}},{"date":"2022-02-11T13:55:01+00:00","title":"New Strong Buy Stocks for February 11th","content":"Here are five stocks added to the Zacks Rank #1 (Strong Buy) List today:\n\nArch Capital Group Ltd. ACGL: This provider of insurance, reinsurance, and mortgage insurance products has seen the Zacks Consensus Estimate for its current year earnings increasing 4.2% over the last 60 days.\n\nArch Capital Group Ltd. Price and Consensus Arch Capital Group Ltd. Price and Consensus\n\nArch Capital Group Ltd. price-consensus-chart | Arch Capital Group Ltd. Quote\n\nBraskem S.A. BAK: This producer and seller of thermoplastic resins has seen the Zacks Consensus Estimate for its current year earnings increasing 1.2% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nCenovus Energy Inc. CVE: This Canadian integrated oil company has seen the Zacks Consensus Estimate for its current year earnings increasing 10.8% over the last 60 days.\n\nCenovus Energy Inc Price and Consensus Cenovus Energy Inc Price and Consensus\n\nCenovus Energy Inc price-consensus-chart | Cenovus Energy Inc Quote\n\nHarley-Davidson, Inc. HOG: This manufacturer and seller of custom, cruiser, and touring motorcycles has seen the Zacks Consensus Estimate for its current year earnings increasing 17.6% over the last 60 days.\n\nHarleyDavidson, Inc. Price and Consensus HarleyDavidson, Inc. Price and Consensus\n\nHarleyDavidson, Inc. price-consensus-chart | HarleyDavidson, Inc. Quote\n\nFirst Business Financial Services, Inc. FBIZ: This bank holding company for First Business Bank has seen the Zacks Consensus Estimate for its current year earnings increasing 9.4% over the last 60 days.\n\nFirst Business Financial Services, Inc. Price and Consensus First Business Financial Services, Inc. Price and Consensus\n\nFirst Business Financial Services, Inc. price-consensus-chart | First Business Financial Services, Inc. Quote\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nHarleyDavidson, Inc. (HOG) : Free Stock Analysis Report\r\n\r\nFirst Business Financial Services, Inc. (FBIZ) : Free Stock Analysis Report\r\n\r\nCenovus Energy Inc (CVE) : Free Stock Analysis Report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nArch Capital Group Ltd. (ACGL) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.","link":"https:\/\/finance.yahoo.com\/news\/strong-buy-stocks-february-11th-135501214.html","symbols":["ACGL.US","ACGLO.US","ACGLP.US","BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","CVE.TO","CVE.US","CXD.F","FBIZ.US","HAR.F","HAR.XETRA","HOG.US"],"tags":["ARCH CAPITAL GROUP LTD","CENOVUS ENERGY","CONSENSUS ESTIMATE","FIRST BUSINESS FINANCIAL SERVICES","INC","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.984,"neg":0,"neu":0.909,"pos":0.091}},{"date":"2022-02-11T12:51:12+00:00","title":"Best Income Stocks to Buy for February 11th","content":"Here are three stocks with buy rank and strong income characteristics for investors to consider today, February 11th:\n\nBraskem S.A. BAK: This producer and seller of thermoplastic resins has witnessed the Zacks Consensus Estimate for its current year earnings increasing 1.2% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nThis Zacks Rank #1 (Strong Buy) company has a dividend yield of 13.04%. Its five-year average dividend yield is 3.68%.\n\nBraskem S.A. Dividend Yield (TTM) Braskem S.A. Dividend Yield (TTM)\n\nBraskem S.A. dividend-yield-ttm | Braskem S.A. Quote\n\nAssociated Banc-Corp ASB: This diversified multibank holding company has witnessed the Zacks Consensus Estimate for its current year earnings increasing 5.6% over the last 60 days.\n\nAssociated BancCorp Price and Consensus Associated BancCorp Price and Consensus\n\nAssociated BancCorp price-consensus-chart | Associated BancCorp Quote\n\nThis Zacks Rank #1 company has a dividend yield of 3.16%. Its five-year average dividend yield is 3.25%.\n\nAssociated BancCorp Dividend Yield (TTM) Associated BancCorp Dividend Yield (TTM)\n\nAssociated BancCorp dividend-yield-ttm | Associated BancCorp Quote\n\nEthan Allen Interiors Inc. ETD: This interior design company and manufacturer and retailer of quality home furnishings has witnessed the Zacks Consensus Estimate for its current year earnings increasing 5.8% over the last 60 days.\n\nEthan Allen Interiors Inc. Price and Consensus Ethan Allen Interiors Inc. Price and Consensus\n\nEthan Allen Interiors Inc. price-consensus-chart | Ethan Allen Interiors Inc. Quote\n\nThis Zacks Rank #1 company has a dividend yield of 4.58%. Its five-year average dividend yield is 3.37%.\n\nEthan Allen Interiors Inc. Dividend Yield (TTM) Ethan Allen Interiors Inc. Dividend Yield (TTM)\n\nEthan Allen Interiors Inc. dividend-yield-ttm | Ethan Allen Interiors Inc. Quote\n\nSee the full list of top ranked stocks here.\n\nFind more top income stocks with some of our great premium screens.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nAssociated BancCorp (ASB) : Free Stock Analysis Report\r\n\r\nEthan Allen Interiors Inc. (ETD) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-income-stocks-buy-february-125112060.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM S.A","BRASKEM S.A. PRICE","CONSENSUS ESTIMATE","ETHAN ALLEN INTERIORS INC","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.977,"neg":0,"neu":0.928,"pos":0.072}},{"date":"2022-02-11T12:41:12+00:00","title":"Best Growth Stocks to Buy for February 11th","content":"Here are three stocks with buy ranks and strong growth characteristics for investors to consider today, February 11th:\n\nCushman & Wakefield plc CWK: This real estate services firm carries a Zacks Rank #1 (Strong Buy), has witnessed the Zacks Consensus Estimate for its current year earnings increasing 0.6% over the last 60 days.\n\nCushman & Wakefield PLC Price and Consensus Cushman & Wakefield PLC Price and Consensus\n\nCushman & Wakefield PLC price-consensus-chart | Cushman & Wakefield PLC Quote\n\nCushman & Wakefield has a PEG ratio of 1.08 compared with 2.34 for the industry. The company possesses a Growth Score of A.\n\nCushman & Wakefield PLC PEG Ratio (TTM) Cushman & Wakefield PLC PEG Ratio (TTM)\n\nCushman & Wakefield PLC peg-ratio-ttm | Cushman & Wakefield PLC Quote\n\nSignet Jewelers Limited SIG: This retailer of diamond jewelry, watches, and other products carries a Zacks Rank #1, has witnessed the Zacks Consensus Estimate for its current year earnings increasing 11.8% over the last 60 days.\n\nSignet Jewelers Limited Price and Consensus Signet Jewelers Limited Price and Consensus\n\nSignet Jewelers Limited price-consensus-chart | Signet Jewelers Limited Quote\n\nSignet has a PEG ratio of 1.07, compared with 2.46 for the industry. The company possesses a Growth Score of B.\n\nSignet Jewelers Limited PEG Ratio (TTM) Signet Jewelers Limited PEG Ratio (TTM)\n\nSignet Jewelers Limited peg-ratio-ttm | Signet Jewelers Limited Quote\n\nBraskem S.A. BAK: This producer and seller of thermoplastic resins carries a Zacks Rank #1, has witnessed the Zacks Consensus Estimate for its current year earnings increasing 1.2% over the last 60 days.\n\nBraskem S.A. Price and Consensus Braskem S.A. Price and Consensus\n\nBraskem S.A. price-consensus-chart | Braskem S.A. Quote\n\nBraskem's has a PEG ratio of 0.43, compared with 0.65 for the industry. The company possesses a Growth Score of A.\n\nBraskem S.A. PEG Ratio (TTM) Braskem S.A. PEG Ratio (TTM)\n\nBraskem S.A. peg-ratio-ttm | Braskem S.A. Quote\n\nSee the full list of top ranked stocks here.\n\nLearn more about the Growth score and how it is calculated here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n\r\nSignet Jewelers Limited (SIG) : Free Stock Analysis Report\r\n\r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n\r\nCushman & Wakefield PLC (CWK) : Free Stock Analysis Report\r\n\r\nTo read this article on Zacks.com click here.\r\n\r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/best-growth-stocks-buy-february-124112124.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","CWK.US","SIG.US","SZ2.F"],"tags":["CONSENSUS ESTIMATE","CUSHMAN & WAKEFIELD","PEG RATIO","SIGNET JEWELERS","STRONG BUY","ZACKS RANK"],"sentiment":{"polarity":0.965,"neg":0.047,"neu":0.862,"pos":0.09}},{"date":"2022-02-10T16:09:57+00:00","title":"7 High-Yield Dividend Stocks That Can More Than Cover Their Dividend Payments","content":"Many high-yield dividend stocks don’t have enough firepower to cover their dividend payments. Or else they barely have the earnings to cover the dividend. This could be one reason why the stocks have a high yield.\n\nOften these stocks either have to borrow money, sell assets, issue equity or debt just to be able to afford the dividends or “distributions.”\n\nIn fact, many REITs (real estate investment trusts) are in this situation. They sometimes camouflage their inability to finance their dividends out of net income earned by relying on sources other than net income.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nI wanted to find seven stocks (no preferreds) that have very clean dividend cover. The company does not have to rely on some sort of financing arrangement in order to pay its dividends.\n\nSo I sought out seven large market cap stocks, whose net income earnings can more than cover their dividends out of net income earned by at least 2 times. This is on a forward estimated earnings and forecast dividend basis.\n\nThis filter eliminates many high-yield stocks, almost all partnerships, REITs and pipelines and other assorted stocks (including foreign stocks where we can’t easily project earnings).\n\nIn addition, the dividend yield has to be equal to or greater than 4.5%. Given the 2x cover requirement and the 4.5% yield filter, this implies the market is severely undervaluing these stocks.\n\n7 Struggling Chinese Stocks Set for a Turnaround in 2022\n\nLastly, the market cap has to be greater than $1 billion. This eliminates any iffy situations with smaller-cap stocks that might have had one good year. These high-yield, well-covered stocks are:\n\nChina Petroleum & Chemical Corp (NYSE:SNP) Braskem (NYSE:BAK) Ternium (NYSE:TX) OneMain Holdings (NYSE:OMF) New York Community Bancorp (NYSE:NYCB) Sinopec Shanghai Petrochemical (NYSE:SHI) Vector Group (NYSE:VGR)\n\nLet’s dive in and take a closer look at these dividend stocks.\n\nDividend Stocks: China Petroleum & Chemical Corp (SNP)\n\nStory continues Detail of chemical plant, silos and pipes\n\nSource: Shutterstock\n\nMarket Cap: $76.5 billionYield: 8.33%Dividend Coverage: 2.2x\n\nChina Petroleum & Chemical Corporation is a large energy and chemical company, based in Beijing, China. It is involved in both upstream and downstream operations in the petroleum and related chemical industries as well as gasoline stations and depots throughout China.\n\nAnalysts forecast earnings-per-share (EPS) this year of $9.67 and next year of $9.33. This means that its semiannual dividends which totaled $4.48 per share so far this year are covered over 2 times by EPS.\n\nMoreover, the stock is cheap. At Feb. 8’s price of $53.59, SNP stock had a forecast dividend yield of 8.33%. In addition, its forward price-to-earnings (P\/E) multiple is low at just 5.5 times earnings (2021).\n\nOne reason this could be cheap is that investors fear that the U.S. government could end up kicking off all Chinese stocks from U.S. exchanges. There is no reason to believe this will happen in the short term.\n\nEven if it does, anyone would be able to convert their SNP ADRs (American Depository Receipts) into the appropriate number of underlying ordinary shares. These trade on the Hong Kong Stock Exchange under the symbol “0318.HK.” So the fear about lack of liquidity in one’s investment is not borne out by real facts. Value investors will take advantage of this bargain opportunity.\n\nBraskem (BAK) Several natural gas tanks with a sunrise in the background\n\nSource: OlegRi \/ Shutterstock\n\nMarket Cap: $7.8 billionYield: 12.92%Dividend Coverage: 2.8x\n\nBraskem SA is a Brazilian chemical company that makes resins, chemicals, gasoline, plastics, gases, steam and petrochemicals. It has plants and sells in the U.S., Mexico, Brazil and Europe.\n\nAnalysts expect to see EPS this year of $7.29 and next year at $3.89. So its dividend this year of declared on Dec. 2, of $2.6307 (for the full year) is more than covered by earnings by 2 times for 2021. However, if earnings come in at just $3.89 for 2022, its earnings will not cover the same dividend by 2 times.\n\nThe dividend is declared once a year and there is no guarantee, as this is a foreign company, that it will maintain the same dividend. It is likely to be volatile as a percentage of profits.\n\nThe 7 Highest Dividend Stocks for Income Investors\n\nAs a result, even though this stock covers the dividend this year, it may not be able to maintain the same dividend in 2022. Value investors may want to watch the Q1 earnings and prospects for the company before taking a position.\n\nDividend Stocks: Ternium (TX) a steel frame for a building\n\nSource: Shutterstock\n\nMarket Cap: $8.18 billionYield: 6.75%Cover: 7.22x\n\nTernium is a Luxembourg-based steel and ore mining company with operations throughout South America, as well as the U.S. The company produces all forms of steel and mines iron ore and pellets.\n\nSo far this year the company has declared two dividends (a final dividend in April 2021 for $2.10 and a preliminary dividend in November 2021 for 80 cents). The total dividend of $2.o9 per share works out to a 6.75% dividend yield on its Feb. 8 price of $42.92 per share.\n\nThe full-year dividend appears to be covered by well more than 2 times, even though, like BAK stock above, its earnings could dip this year.\n\nFor example, analysts forecast EPS for 2021 of $20.93, but just $11.70 for the year ending December 2022. Nevertheless, the $2.90 dividend per share is covered more than 4 times even if the EPS falls to just $11.72 this year.\n\nThis high yield makes TX stock a very compelling value play for investors, especially since it appears to be so well covered by earnings by the company. Short of a global recession investors can assume that demand for steel and iron ore will continue to develop well over the next several years.\n\nOneMain Holdings (OMF) a person holds up a scrap of paper that asks \"Are you covered?\"\n\nSource: Shutterstock\n\nMarket Cap: $6.83 billionYield: 6.97%Cover: 2.3x\n\nOn Feb. 2, OneMain Financial released its full-year results showing that the consumer lending and insurance company made $2.02 per share in Q4 2021. That puts the company on a solid financial footing going forward, implying a run rate EPS of $8.08 for 2022. That makes the stock, at $54.02 as of Feb. 8, very cheap at just 6.7 times forward run-rate earnings.\n\nMoreover, management raised the quarterly dividend by 36% to 95 cents per share. This puts the dividend per share at an annual rate of $3.80.\n\nAs a result, the dividend yield is now 6.97%. In addition, given that OneMain Financial made $9.87 in EPS in the last 12 months, the dividend has annual coverage of 2.6 times.\n\nAnalysts expect to see EPS this year of $8.66, according to Seeking Alpha. That puts the dividend on a coverage ratio of 2.3x. It also gives OMF ample room to buy back shares.\n\nFor example, in the last 12 months OMF repurchased $368 million in stock, including $192 million in Q4 alone. In fact, the board approved a new $1 billion share buyback program.\n\nTherefore, at the $192 million quarterly rate, its full year buy back rate is $768 million. With 130 million shares outstanding this is worth $5.91 per share for every investor, or 10.8% of its market value.\n\n7 Top Growth Stocks to Add to Your Buy List Now\n\nTherefore, this shows OneMain is very shareholder friendly. The 7% yield and 10% buyback yield provide a 17% total yield for investors. That could propel OMF stock significantly higher in 2022.\n\nDividend Stocks: New York Community Bancorp (NYCB) A customer makes a transaction at a bank\n\nSource: Africa Studio \/ Shutterstock.com\n\nMarket Cap: $5.32 billionYield: 5.95%Cover: 2.0x\n\nOn Jan. 26, NewYork Community Bancorp reported solid Q4 and 2021 earnings and kept its dividend stable at 17 cents per quarter. The five-state community bank holding company reported EPS of $1.20, up 18% year-over-year on a GAAP basis. On a non-GAAP basis EPS was up 43% year-over-year.\n\nMoreover, its full year dividend rate is 68 cents per share. This gives NYCB stock, which closed at $11.10 on Feb. 8, a dividend yield of 6.13%. Moreover, given that analysts forecast 2022 EPS of $1.39 and $1.56 in 2023, the dividend is 2 times covered for 2022 and more for 2023.\n\nMoreover, as a new catalyst for the stock, the board announced that it had reinstated its share repurchase program. This will help push up the stock. It has a $17 million authorization remaining in its existing buyback program.\n\nAs a result of its profitability and its new buyback program, I would not be surprised to see NYCB raise the dividend sometime in the next year. It has kept the dividend at 68 cents annually ever since 2015. At some point, management might consider this, although there is no guarantee this could happen.\n\nSinopec Shanghai Petrochemical (SHI) a silo containing chemicals\n\nSource: Shutterstock\n\nMarket Cap: $5.45 billionYield: 6.69%Cover: 3.0x\n\nSinopec is another petrochemical company based in Shanghai, China, just like SNP stock above. The company is forecast to make $4.62 in EPS in 2021 and estimates are for $5.22 next year.\n\nGiven that its annual dividend was $1.56 per ADR this year, the stock has a dividend yield of 6.69% at Feb. 8’s price of $23.27 per share. The dividend is more than 2 times covered both for 2021 and 2022, although the payment is just once a year.\n\nThat also means its 2021 price-to-earnings multiple is cheap at just 4.5 times forecast EPS of $5.22 this year. So, here we have a similar situation as SNP stock above. Everyone is afraid of these Chinese conglomerates, especially if the company delists from the NYSE.\n\nBut not to worry. It’s also listed on the Hong Kong Stock Exchange under symbol “338.HK.” So, worse comes to worse, investors would just have to have their brokerage firm convert their ADRs to ordinary shares and they could sell them on the HK stock exchange.\n\n7 Struggling Chinese Stocks Set for a Turnaround in 2022\n\nThis makes the stock a unique value investment opportunity, given the arbitrage opportunities.\n\nDividend Stocks: Vector Group Ltd (VGR) hand of person in a suit dangling keys with a house symbol on the ring. Windows overlooking city skyline in background.\n\nSource: ImageFlow\/shutterstock.com\n\nMarket Cap: $1.72 billionYield: 4.58%Cover: 2.0x\n\nVector Group is a two-pronged conglomerate. It has two divisions. The first makes and sells discount cigarettes. The second provides real estate services, such as brokerage, relocation, real estate sales and marketing and title insurance. It’s a sort of “barbell,” diversification strategy, especially since selling cigarettes is not considered especially millennial friendly, or let’s say, conventional.\n\nVector Group’s dividend yield is 4.58% at Feb. 8’s price of $11.29, based on its annual dividend 51.72 cents per share. This is more than covered earnings, even though they are forecast to fall to $1.04 EPS this year from $1.77 last year. That puts the dividend cover at 2x this year.\n\nSo, I suppose, if you can hold your nose for the way the company makes money pushing nicotine, then investing in VGR stock could be worthwhile as a value stock.\n\nOn the date of publication, Mark R. Hake did not hold any position (either directly or indirectly) in the securities mentioned in this article.The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMark Hake writes about personal finance on mrhake.medium.comand Newsbreak.com runs the Total Yield Value Guidewhich you can review here.\n\nMore From InvestorPlace\n\nStock Prodigy Who Found NIO at $2… Says Buy THIS Now Man Who Called Black Monday: “Prepare Now.” #1 EV Stock Still Flying Under the Radar Interested in Crypto? Read This First...\n\nThe post 7 High-Yield Dividend Stocks That Can More Than Cover Their Dividend Payments appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/7-high-yield-dividend-stocks-160957730.html","symbols":["0386.HK","600028.SHG","BAK.US","CHU.F","CHUA.F","NYCB-PA.US","NYCB.US","OMF.US","QC1.F","SHI.US","SNP.US","SNPMF.US","SNPN.MX","T5Z.F","TX.MX","TX.US"],"tags":["COVER","DIVIDEND COVER","DIVIDEND COVERAGE","DIVIDEND STOCKS","DIVIDEND YIELD","MARKET CAP","SHUTTERSTOCK","VECTOR GROUP"],"sentiment":{"polarity":0.999,"neg":0.022,"neu":0.894,"pos":0.084}},{"date":"2022-02-01T13:05:01+00:00","title":"Petrobras (PBR) Postpones Offering of Its Stake in Braskem","content":"Brazilian state-owned energy major, Petrobras PBR, along with privately held Novonor own about 36.1% and 38.3% in Braskem BAK, respectively. Both companies announced that they have decided to postpone the sale of their interests in the chemical giant, Braskem. The deferment was blamed on capital market instability, which led to levels of demand and price that were not suitable to close the transaction. Further, Novonor's creditors considered the price offered by investors too low.\n\nPetrobras also declared that the Term Sheet, which it signed with Novonor, establishing commitment by both companies to sell their respective stakes in Braskem, is in effect.\n\nBraskem SA figures as the largest petrochemical operation in Latin America and among the five largest private companies in Brazil. As part of the ongoing plans, PBR and Novonor were looking to offload as many as 154,886,547 preferred shares of Braskem. For Petrobras, the proposed sale was an attempt to divest assets and lower its massive debt as it had a net debt of $48.1 billion at the end of the third quarter.\n\nHeadquartered in Rio de Janeiro, Petroleo Brasileiro S.A. or Petrobras S.A. is the largest integrated energy firm in Brazil and one of the largest in Latin America. The company’s activities include exploration, exploitation, and production of oil from reservoir wells, shale, and other rocks as well as refining, processing, trading, and transportation.\n\nPetrobras currently has a Zacks Rank #2 (Buy). Other players from the energy space that warrant a look include Ranger Oil ROCC and BP BP, each sporting a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nRanger Oil’s stock has rallied around 198.1% in a year. The Zacks Consensus Estimate for Ranger Oil’s 2022 earnings is projected at $9.02 per share, which is an increase of a massive 152.7% from the projected year-ago earnings of $3.57.\n\nStory continues\n\nROCC beat the Zacks Consensus Estimate for earnings in three of the trailing four quarters, the average being around 25%.\n\nThe Zacks Consensus Estimate for BP’s earnings for the upcoming quarter is projected at $1.06 per share, up about 37.7% from the year-ago quarter’s 77 cents.\n\nBP’s stock has increased about 39.2% in a year. BP beat the Zacks Consensus Estimate for earnings in three of the trailing four quarters, the average being around 10.8%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\r\n \r\nBP p.l.c. (BP) : Free Stock Analysis Report\r\n \r\nPetroleo Brasileiro S.A. Petrobras (PBR) : Free Stock Analysis Report\r\n \r\nBraskem S.A. (BAK) : Free Stock Analysis Report\r\n \r\nRanger Oil Corporation (ROCC) : Free Stock Analysis Report\r\n \r\nTo read this article on Zacks.com click here.\r\n \r\nZacks Investment Research","link":"https:\/\/finance.yahoo.com\/news\/petrobras-pbr-postpones-offering-stake-130501695.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","PBR-A.US","PBR.US","PBRN.MX","PETR3.SA","PETR4.SA","PJX.F","PJXA.F","PJXB.F","PJXC.F"],"tags":["BRASKEM","CONSENSUS ESTIMATE","PBR","PETROBRAS","ZACKS INVESTMENT RESEARCH"],"sentiment":{"polarity":0.986,"neg":0.032,"neu":0.858,"pos":0.109}},{"date":"2022-02-01T13:00:00+00:00","title":"Braskem Invests in Nexus Circular to Accelerate Advanced Recycling of Plastics","content":"Braskem's investment supports the goal of a circular economy where hard-to-recycle plastic waste is captured as a valuable feedstock for new materials\n\nPHILADELPHIA, Feb. 1, 2022 \/PRNewswire\/ -- Braskem S.A. (B3: BRKM3, BRKM5 and BRKM6; NYSE: BAK; LATIBEX: XBRK) (\"Braskem\"), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, today announced its investment in Nexus Circular LLC (\"Nexus\"), a commercial leader in advanced recycling that converts landfill-bound plastics into circular feedstocks used in the production of sustainable virgin plastics.\n\nMark Nikolich, CEO, Braskem America, stated, \"At Braskem we have a clear, long-term vision which is committed to a Carbon Neutral Circular Economy where nothing is wasted, and everything is transformed. A critical element of achieving this vision is investing in pathways that advance the circular conversion of hard-to-recycle plastic waste to valuable new materials, diverting it from landfills and improving our environmental footprint. Nexus shares our vision for accelerating the commercialization of advanced recycling with their own proprietary innovations and we couldn't be more excited to be a new investor in their journey.\"\n\nEric Hartz, President and Co-Founder at Nexus Circular said, \"We are so pleased to have Braskem join Nexus' advanced recycling endeavors and receive their support to accelerate our impact and growth worldwide.\"\n\nUsing a proprietary advanced recycling technology, Nexus converts a range of hard-to-recycle plastics especially landfill bound plastic films into its circular feedstocks which can then be converted back into virgin plastics (fully circular). Nexus has optimized the technology to create a highly efficient and economic system providing cost-effective, superior quality and environmentally friendly products for its partners and customers.\n\nStory continues\n\nToday's investment in Nexus is one component of Braskem's strategy to drive plastics circularity, which includes projects aimed at recycling infrastructure, mechanical recycling, and advanced recycling – all of which are critical to meeting Braskem's and our clients' ESG commitments in the years to come. In addition to the expansion of Braskem's recycled product portfolio in 2021, Braskem is also a founding member of the Alliance to End Plastic Waste, The Recycling Partnership's Polypropylene Recycling Coalition and Cyclyx.\n\nBraskem is strongly committed to a Carbon Neutral Circular Economy where nothing is wasted, and everything is transformed. To support this vision for the future Braskem has clearly stated targets for growing the company's recycled content product portfolio to sales of 300,000 tons by 2025 and 1 million tons by 2030. Braskem' transition to a circular economy is deeply rooted in mechanical and advanced recycling solutions. By engaging and investing in partnership with other members of the value chain the company is strengthening mechanical and advanced recycling, overcoming barriers and ensuring the increased production of high-quality recycled material. All these initiatives are aligned with Braskem's feedstock diversification strategy and its macro goals of expanding the circular economy concept in the plastic chain and becoming a carbon-neutral company by 2050. For more information on Braskem's global sustainable development strategy, please visit www.braskem.com.br\/sustainabledevelopmentstrategy.\n\nABOUT NEXUS Nexus Circular is a commercial leader in advanced recycling technology that converts landfill-bound plastics into circular feedstocks for production of sustainable virgin plastics used in packaging and other applications. Nexus Circular's end-to-end solution is economically validated as demonstrated by consistent bulk sales of high quality, ISCC Plus circular feedstocks for virgin plastic production. Aligned with global partners who seek proven scalable solutions to meet ambitious plastic circularity goals and with the support of investors including Cox Enterprises, Chevron Phillips Chemical, Printpack and Braskem, Nexus Circular is rapidly expanding its innovation footprint worldwide, moving decisively to address the complex challenges of plastics accumulation in the environment. For more information, visit www.nexuscircular.com.\n\nABOUT BRASKEM With a global vision of the future oriented towards people and sustainability, Braskem is committed to contributing to the value chain for strengthening the circular economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improve people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico, and Germany, Braskem exports its products to clients in more than 80 countries.\n\nBraskem America, Inc. is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa.\n\nThis press release shall not constitute an offer to sell, or the solicitation of an offer to buy, any securities of Braskem or any other company.\n\nBraskem on English social media:\n\nwww.facebook.com\/BraskemGlobal\r\nwww.linkedin.com\/company\/braskem\r\nwww.twitter.com\/BraskemSA\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/braskem-invests-in-nexus-circular-to-accelerate-advanced-recycling-of-plastics-301471599.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/braskem-invests-nexus-circular-accelerate-130000079.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["ADVANCED RECYCLING","BRASKEM","BRASKEM AMERICA","CIRCULAR ECONOMY","PLASTIC WASTE","RECYCLING TECHNOLOGY","VIRGIN PLASTICS"],"sentiment":{"polarity":0.999,"neg":0.016,"neu":0.819,"pos":0.165}},{"date":"2022-01-28T12:25:04+00:00","title":"UPDATE 1-Brazil's Petrobras, Novonor postpone Braskem share offering","content":"(Updates with details, context)\n\nSAO PAULO, Jan 28 (Reuters) - Brazilian state-run oil company Petrobras confirmed on Friday it has decided alongside conglomerate Novonor to postpone the sale via a share offering of their stakes in petrochemical producer Braskem SA due to inadequate demand and price conditions.\n\nBraskem also confirmed the cancellation of the share sale.\n\nReuters had first reported on Thursday, citing sources, that the oil giant and Novonor - which is in bankruptcy proceedings - had called off the move after lackluster demand and as Novonor's creditors considered the price offered by investors too low.\n\n\"The instability of the capital market conditions resulted, at this moment, in levels of demand and price that are not appropriate for the transaction,\" Petrobras said in a securities filing.\n\nPetroleo Brasileiro SA, as the company is formally known, said it still wants to sell its stake but will wait for favourable market conditions, without providing a timeframe.\n\nPetrobras and Novonor decided to jointly sell their preferred shares in Braskem as part of a broader plan to fully divest from the firm.\n\nNovonor, formerly known as Odebrecht, plans to use the offering proceeds mainly to pay creditors.\n\nFor Petrobras, the move is part of its plan to sell assets and reduce debt.\n\n(Reporting by Gabriel Araujo; editing by Jason Neely)","link":"https:\/\/finance.yahoo.com\/news\/1-brazils-petrobras-novonor-postpone-122504685.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","PBR-A.US","PBR.US","PBRN.MX","PETR3.SA","PETR4.SA","PJX.F","PJXA.F","PJXB.F","PJXC.F"],"tags":["BRASKEM","PETROBRAS","PETROLEO BRASILEIRO SA","PRICE CONDITIONS"],"sentiment":{"polarity":-0.202,"neg":0.061,"neu":0.895,"pos":0.044}},{"date":"2022-01-27T22:37:58+00:00","title":"Novonor, Petrobras postpone Braskem share offering after lackluster demand -sources","content":"Jan 27 (Reuters) - Brazilian state-controlled oil company Petrobras and engineering conglomerate Novonor postponed the sale of their stakes in petrochemical company Braskem SA after lackluster demand for the share offering, three sources familiar with the matter said on Thursday.\n\nThe company's follow-on was postponed as Novonor’s creditors considered the price offered by investors too low.\n\nBoth companies decided to jointly sell their preferred shares in the company as part of a broader plan to fully divest of Braskem. Novonor, formerly known as Odebrecht, plans to use the offering proceeds mainly to pay creditors, as it filed for bankruptcy protection in 2019 after being a key player in the country's Car Wash corruption scandal. For Petrobras, this sale is part of its plan to sell non-core assets and cut debt. (Reporting by Tatiana Bautzer and Carolina Mandl; Writing by Carolina Pulice; Editing by Leslie Adler)","link":"https:\/\/finance.yahoo.com\/news\/novonor-petrobras-postpone-braskem-share-223758216.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","PBR-A.US","PBR.US","PBRN.MX","PETR3.SA","PETR4.SA","PJX.F","PJXA.F","PJXB.F","PJXC.F"],"tags":["BRASKEM","CONGLOMERATE","OIL COMPANY","PETROBRAS","PETROCHEMICAL COMPANY"],"sentiment":{"polarity":-0.785,"neg":0.105,"neu":0.848,"pos":0.047}},{"date":"2022-01-27T22:35:38+00:00","title":"Petrobras, Novonor Said to Mull Postponing Braskem Share Sale","content":"(Bloomberg) -- Worsening market conditions have led Braskem’s controlling holders to discuss postponing the transaction as price offered by investors didn’t meet their minimum target, people familiar with the matter said.\n\nMost Read from Bloomberg\n\nApple to Rival Square by Turning iPhones Into Payment Terminals Stocks Drop in Roller-Coaster Ride for Wall Street: Markets Wrap Post-Vaccine Menstruation Changes Are Smaller Than Natural Ones Crypto Secrecy Makes DeFi a Financial Felon’s Wonderland Jeremy Grantham Has an Even Scarier Prediction Than His Crash Call\n\nNo final decision has been made yet, according to the people, who asked not to be identified discussing confidential information Representatives for Petrobras and Braskem didn’t immediately reply to a message seeking comments outside business hours; Novonor declined to comment Note: Petrobras, Novonor to Unload Braskem Stake in $1.4 Billion Sale\n\nMost Read from Bloomberg Businessweek\n\nMarket Turmoil Is Ultimate Test of What’s Real and What’s Not Pharmacy Workers Are the Pandemic’s Invisible Victims What Happens When Russian Hackers Come for the Electrical Grid Amazon’s Banned China Sellers Turn to Walmart’s Marketplace The Charismatic Developer and the Ponzi Scheme That Suckered San Diego\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/petrobras-novonor-said-mull-postponing-223538722.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","PBR-A.US","PBR.US","PBRN.MX","PETR3.SA","PETR4.SA","PJX.F","PJXA.F","PJXB.F","PJXC.F"],"tags":["BLOOMBERG","BRASKEM","BRASKEM STAKE","PETROBRAS"],"sentiment":{"polarity":-0.949,"neg":0.111,"neu":0.871,"pos":0.018}},{"date":"2022-01-20T13:00:00+00:00","title":"Braskem Expands U.S. Propylene Supply Import Capabilities","content":"Braskem's Partnership with Repauno Port & Rail Terminal Provides Enhanced Propylene Feedstock Availability and Optionality for its Marcus Hook, Pa. Manufacturing Facility\n\nPHILADELPHIA, Jan. 20, 2022 \/PRNewswire\/ -- Braskem (B3: BRKM3, BRKM5 and BRKM6; NYSE: BAK; LATIBEX: XBRK) (\"Braskem\"), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, and Repauno Port & Rail Terminal (\"Repauno\"), announces today that the parties successfully completed the first propylene import in more than a decade to the United States East Coast. The vessel arrived at Repauno's new multi-use port terminal facility for energy products in Gibbstown, New Jersey. Today's announcement follows a strategic initiative by Braskem to further enhance its feedstock optionality to supply propylene to its polypropylene (PP) manufacturing facility located in Marcus Hook, Pa. and allow the business to capture arbitrage opportunities for competitive propylene abroad. (PRNewsfoto\/Braskem)\n\nAlexandre Elias, VP Polypropylene, Braskem America, stated, \"Our new partnership with Repauno provides Braskem with increased flexibility and optionality to import propylene particularly when international prices are competitive. Additionally, it provides the flexibility to import in the event of supply disruptions to the asset. I am extremely proud of our team for bringing this opportunity to fruition, and successfully completing the import delivery.\"\n\nBraskem's Marcus Hook facility produces 415 kilotons of polypropylene each year, which are used in medical, automotive, food packaging, and appliance applications. Since Braskem acquired the plant in 2010, it has expanded the production capacity of the plant by 25 percent through multiple improvement projects. In early 2020 during the beginning of the COVID-19 pandemic, Braskem's Marcus Hook based manufacturing team members lived on site at the production facility for 28 days to ensure the continuous supply of raw material to produce medical personal protective equipment (PPE) such as N-95 respirator masks, medical gowns, as well as other healthcare packaging caps and closures.\n\nStory continues\n\nRepauno Port & Rail Terminal (\"Repauno\") is located on a 1,600-acre site along the Delaware River in Greenwich Township, New Jersey, one of the most active maritime markets in the nation. Repauno offers tremendous logistical optionality as it sits directly on the Delaware River, served by Conrail with access to CSX and Norfolk Southern, and easy truck access to I-295 and I-95 highways. Additionally, the site features a new multi-purpose dock with 40-foot draft, capable of safely handling a wide variety of products and available acreage with build-to-suit logistical solutions available for development.\n\nTo support the sustainable use of polypropylene through the development of, and investment in, the circular economy, Braskem America is a founding member and funding partner of the Polypropylene Recycling Coalition, with a primary focus on increasing U.S. polypropylene recovery and reuse. To learn more about the Polypropylene Recycling Coalition, the founding members, and how to join, visit https:\/\/recyclingpartnership.org\/polypropylene-coalition. For additional information about Braskem's circular economy position please visit online at www.braskem.com\/circulareconomy.\n\nABOUT REPAUNO Repauno Port & Rail Terminal (\"Repauno\") is located on a 1,600-acre site along the Delaware River in Greenwich Township, New Jersey, one of the most active maritime markets in the nation. Formerly the home of a DuPont manufacturing facility, the site is being redeveloped into a multi-use Port facility for energy products, roll-on\/roll-off, project cargo, bulk cargo, warehousing, and logistics. For more information about Repauno please visit www.repauno.com.\n\nABOUT BRASKEM With a global vision of the future oriented towards people and sustainability, Braskem is committed to contributing to the value chain for strengthening the circular economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improve people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico, and Germany, Braskem exports its products to clients in more than 80 countries.\n\nBraskem America, Inc.is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa.\n\nThis press release shall not constitute an offer to sell, or the solicitation of an offer to buy, any securities of Braskem or any other company.\n\nBraskem on English social media:\n\nwww.facebook.com\/BraskemGlobal\r\nwww.linkedin.com\/company\/braskem\r\nwww.twitter.com\/BraskemSA Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/braskem-expands-us-propylene-supply-import-capabilities-301464227.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/braskem-expands-u-propylene-supply-130000230.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["BRASKEM","BRASKEM AMERICA","FOOD PACKAGING","GREENWICH TOWNSHIP","MANUFACTURING FACILITY","MARCUS HOOK","NEW JERSEY","POLYPROPYLENE","RAIL TERMINAL","REPAUNO PORT & RAIL TERMINAL"],"sentiment":{"polarity":0.998,"neg":0.003,"neu":0.862,"pos":0.135}},{"date":"2022-01-17T14:32:34+00:00","title":"Petrobras, Novonor to Sell $1.5 Billion Braskem Stake","content":"(Bloomberg) -- The controlling shareholders of Braskem SA are seeking to raise about $1.5 billion by selling shares in the petrochemical firm in what is expected to be one of Brazil’s largest equity offerings this year.\n\nMost Read from Bloomberg\n\nOne of the World’s Wealthiest Oil Exporters Is Becoming Unlivable Deadly Strikes on UAE Upset Efforts to Ease Gulf Frictions Djokovic Loses Shot at Tennis History as Australia Deports Star China Cuts Interest Rate as Growth Risks Worsen With Omicron Stocks, Futures Mixed as Bond Yields March Higher: Markets Wrap\n\nState-owned oil producer Petroleo Brasileiro SA and Novonor, the industrial conglomerate previously known as Odebrecht, filed for a secondary offering to sell as many as 154,886,547 preferred Braskem shares. They can raise a combined 8.1 billion reais ($1.5 billion) based on the stock’s close on Friday. The price per share will be set on Jan. 27, according to the prospectus.\n\nBraskem said that Morgan Stanley, JPMorgan Chase & Co., Banco Bradesco BBI, Banco Itau BBA, Citigroup Inc., UBS BB Investment Bank, Banco BTG Pactual SA and Banco Santander Brasil SA are handling the transaction. If the offering is fully sold, Petrobras and Novonor will virtually scrap all of their Braskem’s preferred stock, keeping just common shares.\n\nNovonor, which has been struggling to recover from the Carwash corruption probe, said it will use part of the proceeds to pay debt with creditors Bradesco, Itau and Santander. For Petrobras, the sale is another breakthrough in its strategy of divesting from non-core assets to focus on the pre-salt region in Brazil’s deep waters.\n\nShares of Braskem, one of the world’s top petrochemicals makers, fell as much as 5.1% in Sao Paulo Monday on the back of the announcement. The stock jumped 145% last year, the second-best performer on Brazil’s main stock gauge. Analysts are forecasting potential gains of about 33% from current levels, Bloomberg data show.\n\nInvestment bankers are predicting a drop in Brazil’s share offering activity following a strong 2021, but bigger deals are expected to arise as rising interest rates and election anxiety heighten the appeal of more liquid transactions.\n\nStory continues\n\n(Adds context and stock move starting in fourth paragraph.)\n\nMost Read from Bloomberg Businessweek\n\nA $13 Billion Bet That Air Travel Will Soon Take Off One Thing Covid Can’t Stop: Alcohol Sales As Fintech Eats Into Profits, Big Banks Fight Back in Washington No, Really, Flying Taxis Are Getting Close to Takeoff For Macron and France, It’s the Economy, Stupide\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/petrobras-novonor-sell-1-5-143234339.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","PBR-A.US","PBR.US","PBRN.MX","PETR3.SA","PETR4.SA","PJX.F","PJXA.F","PJXB.F","PJXC.F"],"tags":["BANCO BRADESCO","BLOOMBERG","BRASKEM","PETROLEO BRASILEIRO SA"],"sentiment":{"polarity":0.412,"neg":0.064,"neu":0.864,"pos":0.072}},{"date":"2022-01-05T23:01:15+00:00","title":"Petrobras, Novonor Pick Banks for $1.5 Billion Braskem Share Sale","content":"(Bloomberg) -- The controlling shareholders of Braskem SA, one of the world’s top petrochemical makers, have picked banks to unload a roughly $1.5 billion stake in the firm, people familiar with the matter said.\n\nMost Read from Bloomberg\n\nWHO Downplays Threat of Covid-19 Variant Found in France U.S. Logs Record 1 Million Virus Cases With Data Delay Omicron Cases Are Hitting Highs, But New Data Put End in Sight Hawkish Fed Sparks Tech Rout, Treasury Selloff: Markets Wrap Hong Kong Scraps Flights, Shuts Bars, Gyms on Omicron Threat\n\nNovonor -- previously known as Odebrecht -- and oil giant Petrobras are working with JPMorgan Chase & Co., Morgan Stanley, Banco Bradesco BBI, Banco Itau BBA, Citigroup Inc., UBS BB Investment Bank, Banco BTG Pactual SA and Banco Santander Brasil SA on the transaction, the people said, asking not to be identified discussing confidential information. The goal is to sell the shares by the end of January.\n\nRepresentatives for Novonor, Petrobras, Citi, UBS BB and BTG declined to comment, while Braskem and the other banks didn’t reply to messages seeking comments.\n\nTogether, Novonor and Petrobras would unload as much as 20% of Braskem by selling all of the preferred shares they hold in the company, according to a Petrobras filing last month. That stake is currently worth about 8.3 billion reais ($1.5 billion), according to data compiled by Bloomberg. After the sale, the firms would still hold almost 55% of Braskem through ordinary shares.\n\nShares of the petrochemicals producer rallied 145% last year, the second-best performer on Brazil’s benchmark Ibovespa equity index. Analysts are forecasting potential gains of about 30% from current levels, according to data compiled by Bloomberg.\n\nMost Read from Bloomberg Businessweek\n\nHow Jessica Simpson Almost Lost Her Name Prescription Weight Loss Drugs Are Working, If You Can Get One Europe Sleepwalked Into an Energy Crisis That Could Last Years Customer Service at the IRS Is So Bad, Even Tax Pros Are Fed Up Strava’s Hardcore Fitness Following Is Powering Through the Pandemic\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/petrobras-novonor-pick-banks-1-230115792.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","PBR-A.US","PBR.US","PBRN.MX","PETR3.SA","PETR4.SA","PJX.F","PJXA.F","PJXB.F","PJXC.F"],"tags":["BANCO BTG PACTUAL SA","BANCO ITAU BBA","BANCO SANTANDER BRASIL SA","BLOOMBERG","BRASKEM","PETROBRAS","UBS BB INVESTMENT BANK"],"sentiment":{"polarity":-0.649,"neg":0.06,"neu":0.879,"pos":0.062}},{"date":"2021-12-11T18:05:25+00:00","title":"Is Owens Corning (OC) A Good Stock To Buy?","content":"While the market driven by short-term sentiment influenced by the accommodative interest rate environment in the US, virus news and stimulus spending, many smart money investors are starting to get cautious towards the current bull run since March, 2020 and hedging or reducing many of their long positions. Some fund managers are betting on Dow hitting 40,000 to generate strong returns. However, as we know, big investors usually buy stocks with strong fundamentals that can deliver gains both in bull and bear markets, which is why we believe we can profit from imitating them. In this article, we are going to take a look at the smart money sentiment surrounding Owens Corning (NYSE:OC).\n\nIs Owens Corning (NYSE:OC) a good stock to buy now? Prominent investors were getting less optimistic. The number of long hedge fund bets decreased by 10 lately. Owens Corning (NYSE:OC) was in 24 hedge funds' portfolios at the end of September. The all time high for this statistic is 47. Our calculations also showed that OC isn't among the 30 most popular stocks among hedge funds (click for Q3 rankings). Noam Gottesman GLG Partners\n\nNoam Gottesman of GLG Partners\n\nAt Insider Monkey, we scour multiple sources to uncover the next great investment idea. For example, lithium prices have more than doubled over the past year, so we go through lists like the 10 best EV stocks to pick the next Tesla that will deliver a 10x return. Even though we recommend positions in only a tiny fraction of the companies we analyze, we check out as many stocks as we can. Now we're going to take a look at the fresh hedge fund action regarding Owens Corning (NYSE:OC).\n\nDo Hedge Funds Think OC Is A Good Stock To Buy Now?\n\nHeading into the fourth quarter of 2021, a total of 24 of the hedge funds tracked by Insider Monkey were long this stock, a change of -29% from one quarter earlier. The graph below displays the number of hedge funds with bullish position in OC over the last 25 quarters. With hedge funds' positions undergoing their usual ebb and flow, there exists an \"upper tier\" of notable hedge fund managers who were boosting their holdings considerably (or already accumulated large positions).\n\nStory continues Is OC A Good Stock To Buy?\n\nMore specifically, AQR Capital Management was the largest shareholder of Owens Corning (NYSE:OC), with a stake worth $95.4 million reported as of the end of September. Trailing AQR Capital Management was Citadel Investment Group, which amassed a stake valued at $72.7 million. GLG Partners, Renaissance Technologies, and Millennium Management were also very fond of the stock, becoming one of the largest hedge fund holders of the company. In terms of the portfolio weights assigned to each position Levin Easterly Partners allocated the biggest weight to Owens Corning (NYSE:OC), around 2.39% of its 13F portfolio. Skylands Capital is also relatively very bullish on the stock, designating 1.71 percent of its 13F equity portfolio to OC.\n\nBecause Owens Corning (NYSE:OC) has witnessed bearish sentiment from the aggregate hedge fund industry, it's safe to say that there was a specific group of hedgies that decided to sell off their full holdings last quarter. It's worth mentioning that Gregg Moskowitz's Interval Partners dumped the biggest investment of the \"upper crust\" of funds watched by Insider Monkey, totaling an estimated $5.2 million in call options, and Gregg Moskowitz's Interval Partners was right behind this move, as the fund cut about $2.9 million worth. These bearish behaviors are interesting, as aggregate hedge fund interest was cut by 10 funds last quarter.\n\nLet's go over hedge fund activity in other stocks similar to Owens Corning (NYSE:OC). We will take a look at Lattice Semiconductor Corporation (NASDAQ:LSCC), Thoughtworks Holding Inc. (NASDAQ:TWKS), AutoNation, Inc. (NYSE:AN), Store Capital Corporation (NYSE:STOR), Cabot Oil & Gas Corporation (NYSE:COG), Braskem SA (NYSE:BAK), and Smartsheet Inc. (NYSE:SMAR). This group of stocks' market valuations match OC's market valuation.\n\n[table] Ticker, No of HFs with positions, Total Value of HF Positions (x1000), Change in HF Position LSCC,19,366512,-5 TWKS,20,235543,20 AN,29,680901,5 STOR,16,857066,3 COG,29,559497,4 BAK,8,18606,2 SMAR,50,1378238,1 Average,24.4,585195,4.3 [\/table]\n\nView table here if you experience formatting issues.\n\nAs you can see these stocks had an average of 24.4 hedge funds with bullish positions and the average amount invested in these stocks was $585 million. That figure was $454 million in OC's case. Smartsheet Inc. (NYSE:SMAR) is the most popular stock in this table. On the other hand Braskem SA (NYSE:BAK) is the least popular one with only 8 bullish hedge fund positions. Owens Corning (NYSE:OC) is not the least popular stock in this group but hedge fund interest is still below average. Our overall hedge fund sentiment score for OC is 29.4. Stocks with higher number of hedge fund positions relative to other stocks as well as relative to their historical range receive a higher sentiment score. Our calculations showed that top 5 most popular stocks among hedge funds returned 95.8% in 2019 and 2020, and outperformed the S&P 500 ETF (SPY) by 40 percentage points. These stocks gained 31.1% in 2021 through December 9th and still beat the market by 5.1 percentage points. A small number of hedge funds were also right about betting on OC as the stock returned 9.4% since the end of the third quarter (through 12\/9) and outperformed the market by an even larger margin.\n\nGet real-time email alerts: Follow Owens Corning (NYSE:OC)\n\nSuggested Articles:\n\nTop 10 Electric Utility Dividend Stocks to Buy Top 10 Artificial Intelligence Stocks to Buy 15 Biggest Companies That Originated In Silicon Valley\n\nDisclosure: None. This article was originally published at Insider Monkey.\n\nFollow Insider Monkey on Twitter","link":"https:\/\/finance.yahoo.com\/news\/owens-corning-oc-good-stock-180525848.html","symbols":["AN.US","BAK.US","COG.US","LSCC.US","O5Q.F","OC.US","SMAR.US","STOR.US","TWKS.US"],"tags":["FUND MANAGERS","GLG PARTNERS","HEDGE FUND","HEDGE FUNDS","INSIDER MONKEY","OWENS CORNING"],"sentiment":{"polarity":0.996,"neg":0.01,"neu":0.899,"pos":0.091}},{"date":"2021-12-10T18:36:46+00:00","title":"Is AutoNation, Inc. (AN) Going to Burn These Hedge Funds?","content":"As we already know from media reports and hedge fund investor letters, hedge funds delivered their best returns in a decade. Most investors who decided to stick with hedge funds after a rough 2018 recouped their losses by the end of the fourth quarter of 2019. A significant number of hedge funds continued their strong performance in 2020 and 2021 as well. We get to see hedge funds' thoughts towards the market and individual stocks by aggregating their quarterly portfolio movements and reading their investor letters. In this article, we will particularly take a look at what hedge funds think about AutoNation, Inc. (NYSE:AN).\n\nIs AutoNation, Inc. (NYSE:AN) the right investment to pursue these days? The best stock pickers were buying. The number of bullish hedge fund bets moved up by 5 recently. AutoNation, Inc. (NYSE:AN) was in 29 hedge funds' portfolios at the end of the third quarter of 2021. The all time high for this statistic is 36. Our calculations also showed that AN isn't among the 30 most popular stocks among hedge funds (click for Q3 rankings).\n\nAt Insider Monkey, we scour multiple sources to uncover the next great investment idea. For example, lithium prices have more than doubled over the past year, so we go through lists like the 10 best EV stocks to pick the next Tesla that will deliver a 10x return. Even though we recommend positions in only a tiny fraction of the companies we analyze, we check out as many stocks as we can. With all of this in mind we're going to review the fresh hedge fund action regarding AutoNation, Inc. (NYSE:AN). ESL INVESTMENTS\n\nEdward Lampert of ESL Investments\n\nDo Hedge Funds Think AN Is A Good Stock To Buy Now?\n\nHeading into the fourth quarter of 2021, a total of 29 of the hedge funds tracked by Insider Monkey were bullish on this stock, a change of 21% from one quarter earlier. The graph below displays the number of hedge funds with bullish position in AN over the last 25 quarters. With hedgies' capital changing hands, there exists a few noteworthy hedge fund managers who were adding to their holdings meaningfully (or already accumulated large positions).\n\nStory continues\n\nAccording to Insider Monkey's hedge fund database, Peter Rathjens, Bruce Clarke and John Campbell's Arrowstreet Capital has the largest position in AutoNation, Inc. (NYSE:AN), worth close to $157.6 million, corresponding to 0.2% of its total 13F portfolio. Sitting at the No. 2 spot is Edward Lampert of ESL Investments, with a $107.3 million position; the fund has 69.3% of its 13F portfolio invested in the stock. Other peers that are bullish consist of Cliff Asness's AQR Capital Management, Mario Gabelli's GAMCO Investors and Murray Stahl's Horizon Asset Management. In terms of the portfolio weights assigned to each position ESL Investments allocated the biggest weight to AutoNation, Inc. (NYSE:AN), around 69.3% of its 13F portfolio. Horizon Asset Management is also relatively very bullish on the stock, dishing out 1.11 percent of its 13F equity portfolio to AN.\n\nAs one would reasonably expect, some big names were breaking ground themselves. Point72 Asset Management, managed by Steve Cohen, established the biggest position in AutoNation, Inc. (NYSE:AN). Point72 Asset Management had $14.7 million invested in the company at the end of the quarter. Paul Marshall and Ian Wace's Marshall Wace LLP also made a $11.1 million investment in the stock during the quarter. The other funds with brand new AN positions are Anand Parekh's Alyeska Investment Group, Dmitry Balyasny's Balyasny Asset Management, and Stephen J. Errico's Locust Wood Capital Advisers.\n\nLet's also examine hedge fund activity in other stocks similar to AutoNation, Inc. (NYSE:AN). We will take a look at Store Capital Corporation (NYSE:STOR), Cabot Oil & Gas Corporation (NYSE:COG), Braskem SA (NYSE:BAK), Smartsheet Inc. (NYSE:SMAR), Sensata Technologies Holding plc (NYSE:ST), Alleghany Corporation (NYSE:Y), and Western Midstream Partners, LP (NYSE:WES). This group of stocks' market values match AN's market value.\n\n[table] Ticker, No of HFs with positions, Total Value of HF Positions (x1000), Change in HF Position STOR,16,857066,3 COG,29,559497,4 BAK,8,18606,2 SMAR,50,1378238,1 ST,29,1546287,-3 Y,30,325413,-2 WES,10,141259,1 Average,24.6,689481,0.9 [\/table]\n\nView table here if you experience formatting issues.\n\nAs you can see these stocks had an average of 24.6 hedge funds with bullish positions and the average amount invested in these stocks was $689 million. That figure was $681 million in AN's case. Smartsheet Inc. (NYSE:SMAR) is the most popular stock in this table. On the other hand Braskem SA (NYSE:BAK) is the least popular one with only 8 bullish hedge fund positions. AutoNation, Inc. (NYSE:AN) is not the most popular stock in this group but hedge fund interest is still above average. Our overall hedge fund sentiment score for AN is 59.2. Stocks with higher number of hedge fund positions relative to other stocks as well as relative to their historical range receive a higher sentiment score. This is a slightly positive signal but we'd rather spend our time researching stocks that hedge funds are piling on. Our calculations showed that top 5 most popular stocks among hedge funds returned 95.8% in 2019 and 2020, and outperformed the S&P 500 ETF (SPY) by 40 percentage points. These stocks gained 28.6% in 2021 through November 30th and beat the market again by 5.6 percentage points. Unfortunately AN wasn't nearly as popular as these 5 stocks and hedge funds that were betting on AN were disappointed as the stock returned 1.7% since the end of September (through 11\/30) and underperformed the market. If you are interested in investing in large cap stocks with huge upside potential, you should check out the top 5 most popular stocks among hedge funds as many of these stocks already outperformed the market since 2019.\n\nGet real-time email alerts: Follow Autonation Inc. (NYSE:AN)\n\nSuggested Articles:\n\n25 Most Climate-Resilient Cities in the US 10 Best Alternative Fuel Stocks to Buy Now 15 Largest Entertainment Companies\n\nDisclosure: None. This article was originally published at Insider Monkey.","link":"https:\/\/finance.yahoo.com\/news\/autonation-inc-going-burn-hedge-183646118.html","symbols":["AN.US","BAK.US","COG.US","RWI.F","SMAR.US","ST.US","STOR.US","WES.US","Y.US"],"tags":["AUTONATION","HEDGE FUND","HEDGE FUNDS","INC","INSIDER MONKEY"],"sentiment":{"polarity":0.996,"neg":0.017,"neu":0.893,"pos":0.09}},{"date":"2021-12-09T12:17:51+00:00","title":"Braskem shares plunge on delayed Petrobras disposal","content":"SAO PAULO (Reuters) -Shares in Brazil's Braskem SA plunged on Thursday after state-run oil company Petrobras said it has yet to decide when and how to proceed with the proposed sale of its stake in the petrochemicals producer.\n\nPetroleo Brasileiro SA, as Petrobras is formally known, said in a securities filing that it is still conducting studies on the planned deal.\n\nShares in Braskem were down 5.8% at 54.65 reais in early trading in Sao Paulo, making it the biggest loser on the Bovespa index, which fell by 1.3%.\n\nPetrobras, which owns 36.1% of Braskem, has repeatedly expressed its intention to sell its stake.\n\nThe latest remarks came after the Estado de S. Paulo newspaper reported that Petrobras and Brazilian conglomerate Novonor were expected to start selling their stakes through a share offering in February.\n\nNovonor, formerly known as Odebrecht, declined to comment.\n\nLast week the conglomerate said it was considering exiting its 38.3% stake in Braskem via a share offering.\n\nNovonor had previously sought bidders for its stake in Braskem. After that process failed, various media outlets, including Reuters, reported that the company was planning to exit Braskem via a share offering.\n\n(Reporting by Gabriel AraujoEditing by David Goodman)","link":"https:\/\/finance.yahoo.com\/news\/brazils-petrobras-yet-decide-date-121751090.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA","PBR-A.US","PBR.US","PBRN.MX","PETR3.SA","PETR4.SA","PJX.F","PJXA.F","PJXB.F","PJXC.F"],"tags":["BRASKEM","PETROBRAS","PETROLEO BRASILEIRO SA","STAKE"],"sentiment":{"polarity":0.542,"neg":0.032,"neu":0.904,"pos":0.063}},{"date":"2021-12-02T02:33:21+00:00","title":"Brazil's Braskem says Novonor considering secondary share offering","content":"RIO DE JANEIRO, Dec 1 (Reuters) - Brazilian industrial conglomerate Novonor is considering exiting its majority stake in petrochemical company Braskem SA via a secondary share offering, Braskem said in a securities filing late Wednesday.\n\nNovonor, formerly known as Odebrecht, had previously organized a competitive merger and acquisition process in an attempt to attract bidders for its stake in Braskem. After that process failed, various media outlets, including Reuters, reported that Novonor was planning to exit Braskem via a share offering.\n\nIn the latest filing, Braskem said it had received correspondence from Novonor indicating that the company was considering a secondary share offering, though no final decision had been reached.\n\nBraskem added that it would assist Novonor in carrying out studies regarding the possible consequences of the share offering.\n\n(Reporting by Gram Slattery; Editing by Rashmi Aich)","link":"https:\/\/finance.yahoo.com\/news\/brazils-braskem-says-novonor-considering-023321113.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA"],"tags":["BRASKEM","MAJORITY STAKE","PETROCHEMICAL COMPANY"],"sentiment":{"polarity":0.796,"neg":0.039,"neu":0.844,"pos":0.117}},{"date":"2021-12-01T13:00:00+00:00","title":"Braskem Launches Amazon E-Commerce Store to Make Polypropylene Filaments for 3D Printing Accessible to Consumers","content":"Braskem Partnered with Xenon arc to Launch its New Online Business-to-Consumer (B2C) Sales Channel and Simplify Supply Chain Complexity\n\nPHILADELPHIA, Dec. 1, 2021 \/PRNewswire\/ -- Braskem (B3: BRKM3, BRKM5 and BRKM6; NYSE: BAK; LATIBEX: XBRK) (\"Company\"), the largest polyolefins producer in the Americas, as well as a market leader and pioneer producer of biopolymers on an industrial scale, and Xenon arc partnered to launch Braskem's first-ever consumer-facing e-commerce marketplace on Amazon. Through the partnership Xenon arc is providing Braskem data-driven marketing and sales platform technologies focused on enhancing the way Braskem engages online with its small-to-mid-sized clients. Braskem's new Amazon online storefront features Braskem's polypropylene (PP) filaments for 3D printing in 1.75 mm and 2.85 mm diameters, as well as their award-winning carbon fiber reinforced polypropylene (PP) filament, made from 100% recycled carbon fiber. (PRNewsfoto\/Braskem)\n\nPolypropylene is ideal for additive manufacturing based on its dimensional stability, impact strength, chemical resistance, durability to support living hinge capabilities as well as a lower density than other plastics making it up to 40% lighter than traditional PLA. These properties, combined with the recyclability of polypropylene, make it an attractive material for a wide range of 3D printing and additive manufacturing applications.\n\nJason Vagnozzi, Braskem Commercial Director of Additive Manufacturing, stated, \"We are continuously looking for new ways to make our materials more accessible to consumers and small enterprise clients. Through our partnership with Xenon arc, we have built a new e-commerce channel that overcomes some of the supply chain complexities that larger commodity producers face when trying to directly reach consumers. Amazon will allow us to better serve smaller makerspaces, hobbyists, and educational institutions that would benefit from our polypropylene innovations.\"\n\nStory continues\n\n\"Braskem is transforming the way they connect with customers, and we are excited to expand our partnership to the Amazon platform. Using our unique approach to marketplace management, we will generate profitable growth in a sustainable manner,\" stated Mica Zuniga, Senior Vice President, Strategic Growth.\n\nBraskem filaments are designed with the end user in mind, making them a great choice for rapid prototyping, custom product design, lightweighting, optimizing geometries, and designing spare parts. Braskem filaments are available in both 1.75 mm and 2.85 mm diameters to fit a wide range of printer applications. To learn more about Braskem's expanding portfolio for 3D printing and additive manufacturing, visit https:\/\/www.braskem.com\/usa\/3d-printing.\n\nABOUT BRASKEM With a global vision of the future oriented towards people and sustainability, Braskem is committed to contributing to the value chain for strengthening the Circular Economy. The petrochemical company's almost 8,000 team members dedicate themselves every day to improve people's lives through sustainable chemicals and plastics solutions. Braskem has an innovative DNA and a comprehensive portfolio of plastic resins and chemical products for diverse segments, such as food packaging, construction, manufacturing, automotive, agribusiness, healthcare, and hygiene, among others. With 41 industrial units in Brazil, the United States, Mexico and Germany, and net revenue of R$58.5 billion (US$11.4 billion), Braskem exports its products to clients in more than 80 countries.\n\nBraskem America is an indirect wholly owned subsidiary of Braskem S.A. headquartered in Philadelphia. The company is the leading producer of polypropylene in the United States, with six production plants located in Texas, Pennsylvania and West Virginia, an Innovation and Technology Center in Pittsburgh, and operations in Boston focused on leveraging groundbreaking developments in biotechnology and advanced materials. For more information, visit www.braskem.com\/usa.\n\nABOUT XENON ARC Since 2010, Xenon arc has built an excellent reputation for expanding market share of chemical and materials producers by up to 30 percent across their non-core, ancillary markets. Leveraging deep domain and technological expertise, Xenon arc simplifies the direct-to-market strategy for clients to deepen market penetration and extend brand promise down channel to untouched or underserved markets. With offices in the US, Europe, Mexico, and Brazil, Xenon arc serves distinguished brands in the materials industry with private label, direct-to-market teams. For more information, visit www.xenonarc.com.\n\nBraskem on English social media:\n\nwww.facebook.com\/BraskemGlobal\r\nwww.linkedin.com\/company\/braskem\r\nwww.twitter.com\/BraskemSA Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/braskem-launches-amazon-e-commerce-store-to-make-polypropylene-filaments-for-3d-printing-accessible-to-consumers-301434379.html\n\nSOURCE Braskem","link":"https:\/\/finance.yahoo.com\/news\/braskem-launches-amazon-e-commerce-130000856.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA","BRKM6.SA"],"tags":["3D PRINTING","AMAZON","BRASKEM","BRASKEM AMERICA","POLYPROPYLENE"],"sentiment":{"polarity":0.998,"neg":0.003,"neu":0.851,"pos":0.146}},{"date":"2021-11-13T00:30:32+00:00","title":"Braskem SA (BAK) Q3 2021 Earnings Call Transcript","content":"BAK earnings call for the period ending September 30, 2021.","link":"https:\/\/finance.yahoo.com\/m\/00b15613-d086-3e3f-979e-7adc9027e77d\/braskem-sa-%28bak%29-q3-2021.html","symbols":["BAK.US","BRDA.F","BRKM3.SA","BRKM5.SA"],"tags":[],"sentiment":{"polarity":0,"neg":0,"neu":1,"pos":0}}]