[{"date":"2022-06-21T13:05:00+00:00","title":"CBAK Energy Devlopes Cylindrical Batteries for Jemmell","content":"DALIAN, China, June 21, 2022 \/PRNewswire\/ -- CBAK Energy Technology, Inc. (NASDAQ: CBAT) (\"CBAK Energy,\" or the \"Company\"), a leading lithium-ion battery manufacturer and electric energy solution provider in China, today announced that its wholly owned subsidiary, Nanjing CBAK New Energy Technology Co., Ltd. (\"Nanjing CBAK\"), has entered into a strategic framework agreement with Jiangsu JPK New Energy Co., Ltd. (\"JPK\"), a subsidiary of Jiangsu Jemmell New Energy Automobile Co., Ltd. (\"Jemmell\") to develop and supply large cylindrical batteries used on Jemmell's A00-grade mini passenger vehicles.\n\nAccording to the framework agreement, Nanjing CBAK and JPK will closely cooperate to develop a competitive EV power battery system. Specifically, Nanjing CBAK will be responsible for providing batteries with an EV-used battery solution that allows its products to be applicable under several scenarios. Jimmell's A00-grade mini passenger vehicles are reportedly among the Top 10 best sellers in China's mini passenger vehicle market. This agreement is thus expected to generate tens of millions of revenues (in RMB) to the Company, subject to the actual number of batteries supplied.\n\nMr. Yunfei Li, Chief Executive Officer of CBAK Energy commented, \"The cooperation with JPK and Jemmell is a proof that our large cylindrical batteries are getting tractions in the EV\/LEV market. We are very pleased to enter into this framework agreement, and expect the synergy will benefit both of us in this fast-growing market.\"\n\nAbout Jemmell\n\nJimmel is a Jiangsu-based electric vehicle manufacturer with business covering R&D, manufacture and sale of electric vehicles. Jimmel is an affiliate with JP Group, one of China's biggest light electric vehicle manufacturers.\n\nAbout CBAK Energy\n\nCBAK Energy Technology, Inc. is a leading high-tech enterprise in China engaged in the development, manufacturing, and sales of new energy high power lithium batteries. The applications of the Company's products and solutions include electric vehicles, light electric vehicles, electric tools, energy storage, uninterruptible power supply (UPS), and other high-power applications. In January 2006, CBAK Energy became the first lithium battery manufacturer in China listed on the Nasdaq Stock Market. CBAK Energy has multiple operating subsidiaries in Dalian and Nanjing, as well as a large-scale R&D and production base in Dalian.\n\nStory continues\n\nFor more information, please visit www.cbak.com.cn.\n\nSafe Harbor Statement\n\nThis press release contains \"forward-looking statements\" that involve substantial risks and uncertainties. All statements other than statements of historical facts contained in this press release, including statements regarding our future results of operations and financial position, strategy and plans, and our expectations for future operations, are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. We have attempted to identify forward-looking statements by terminology including \"anticipates,\" \"believes,\" \"can,\" \"continue,\" \"could,\" \"estimates,\" \"expects,\" \"intends,\" \"may,\" \"plans,\" \"potential,\" \"predicts,\" \"should,\" or \"will\" or the negative of these terms or other comparable terminology. Our actual results may differ materially or perhaps significantly from those discussed herein, or implied by, these forward-looking statements.\n\nAny forward-looking statements contained in this press release are only estimates or predictions of future events based on information currently available to our management and management's current beliefs about the potential outcome of future events. Whether these future events will occur as management anticipates, whether we will achieve our business objectives, and whether our revenues, operating results, or financial condition will improve in future periods are subject to numerous risks.  There are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including: significant legal and operational risks associated with having substantially all of our business operations in China, the Chinese government may exercise significant oversight and discretion over the conduct of our business and may intervene in or influence our operations at any time, which could result in a material change in our operations and\/or the value of our securities or could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and could cause the value of such securities to significantly decline or be worthless, trading in our securities may be prohibited under the Holding Foreign Companies Accountable Act if the PCAOB subsequently determines our audit work is performed by auditors that the PCAOB is unable to inspect or investigate completely, the effects of the global Covid-19 pandemic, changes in domestic and foreign laws, regulations and taxes, uncertainties related to China's legal system and economic, political and social events in China, the volatility of the securities markets; and other risks including, but not limited to, the ability of the Company to meet its contractual obligations, the uncertain market for the Company's lithium battery cells and business, macroeconomic, technological, regulatory, or other factors affecting the profitability of battery cells designed for energy storage that we discussed or referred to in the Company's disclosure documents filed with the U.S. Securities and Exchange Commission (the \"SEC\") available on the SEC's website at www.sec.gov, including the Company's most recent Annual Report on Form 10-K as well as in our other reports filed or furnished from time to time with the SEC. You should read these factors and the other cautionary statements made in this press release. If one or more of these factors materialize, or if any underlying assumptions prove incorrect, our actual results, performance or achievements may vary materially from any future results, performance or achievements expressed or implied by these forward-looking statements. The forward-looking statements included in this press release are made as of the date of this press release and the Company undertakes no obligation to publicly update or revise any forward-looking statements, other than as required by applicable law.\n\nFor investor and media inquiries, please contact:\n\nIn China:\n\nCBAK Energy Technology, Inc.\r\nInvestor Relations Department\r\nMr. Thierry Jiewei Li\r\nPhone: 86-18675423231\r\nEmail: ir@cbak.com.cn\n\nRelated Links\r\nhttps:\/\/ir.cbak.com.cn\/ Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/cbak-energy-devlopes-cylindrical-batteries-for-jemmell-301571768.html\n\nSOURCE CBAK Energy Technology, Inc.","link":"https:\/\/finance.yahoo.com\/news\/cbak-energy-devlopes-cylindrical-batteries-130500095.html","symbols":["CBAT.US"],"tags":["BATTERY MANUFACTURER","CBAK ENERGY","CHINA","DALIAN","ELECTRIC VEHICLE","FRAMEWORK AGREEMENT","JIANGSU JEMMELL NEW ENERGY AUTOMOBILE CO","JIANGSU JPK NEW ENERGY CO","JPK","LITHIUM BATTERIES","LTD","NANJING","NANJING CBAK","PASSENGER VEHICLES","STRATEGIC FRAMEWORK AGREEMENT"],"sentiment":{"polarity":0.995,"neg":0.018,"neu":0.88,"pos":0.102}},{"date":"2022-06-03T11:23:00+00:00","title":"2022 Insights on the Lithium Battery Global Market - Players Include Manz, Northvolt, Samsung SDI and Tesla Among Others","content":"Dublin, June  03, 2022  (GLOBE NEWSWIRE) -- The \"Lithium Battery Market Report: Trends, Market Analysis, OEM and Suppliers, Technology, Cost and Material Breakdown\" report has been added to ResearchAndMarkets.com's offering. \r\n\r\nThe market of lithium batteries is one of the most thriving businesses in the current economy. Due to the government restriction and laws aiming to convert all engines from thermal combustion to electric powertrain in the next few years, many automotive companies and entrepreneurs are investing massive quantities of money in this business, accelerating the product development and world transition.\n\nThe aim of this report is to provide a pool of helpful information for who want to join in the battery business and even who want to know more about lithium battery technology.\r\n\r\nThis report is already used as based for business plans by multiple companies and investing fund from Asia and Europe.\r\n\r\nThe first section of the report is dedicated to market trends and analysis with a deep dive into American and European investment plan and companies schedule: the reader will understand the entity of total investments for each area and have a clear idea about the next giga factories in term of location, product type and production capacity.\r\n\r\nA second chapter try to explain and give an overview about lithium battery raw material and components, market and technology: a list of supplier for each battery component is provided and a deep dive into raw material price.\r\n\r\nA very detailed section is dedicated to comparison between 18650 - 21700 and 4680 cylindrical batteries. The third and latest chapter is a practical guideline for gigafactories and answer to the following question: which cost have a giga factory?\r\n\r\nThe reader can find a complete overview and breakdown cost for material, battery parts, manufacturing process and equipment.\r\n\r\nAt the end of the chapter a full list of long date and new suppliers split by automation equipment technology and geographical location.\r\n\r\nThis report answers the following key questions:\n\nWhat is the EV battery market trend?What is the market trend for anode and cathode?Which companies are investing in battery business?Which production capacity will have the next gigafactories in USA and Europe?Which are main suppliers in term of lithium battery and Lithium battery components?What is the difference between Cylindrical 18650 , 21700 and 4680 tabless battery?What is a cylindrical battery material weight and cost breakdown?What is the Lithium Manufacturing cost manufacturing cost breakdown?How the dry room and equipment affect the production cost?Which are the equipment suppliers for lithium battery equipment?\n\nKey Topics Covered:\n\nIntroductionMarket trends and outlook with Focus in EuropeCurrent players (OEM and suppliers), market shares and newerTop Automotive OEMBattery Manufacturers and market trend: demand vs supply forecastBattery Manufacturers expansion plansBattery chemistry and raw material: typology and forecastBattery market analysis resumeBudget: raw material, equipment buildingBattery cost breakdownRaw material costWaste management (example of LFP battery)Utilities consumptionBuilding costEquipment player\n\nCompanies Mentioned\n\nBMWDurr-MegtecCOESIAIMALG ESManzNorthvoltSamsung SDITeslaVARTAWuXi Lead\n\nFor more information about this report visit https:\/\/www.researchandmarkets.com\/r\/x3sxd5","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/06\/03\/2455911\/28124\/en\/2022-Insights-on-the-Lithium-Battery-Global-Market-Players-Include-Manz-Northvolt-Samsung-SDI-and-Tesla-Among-Others.html","symbols":[],"tags":["BATTERIES MATERIAL","BATTERY MANUFACTURER","BATTERY MATERIAL","BATTERY TECHNOLOGY","LITHIUM BATTERIES","LITHIUM BATTERY","RESEARCH ANALYSIS AND REPORTS","RESEARCH AND MARKETS"],"sentiment":{"polarity":0.93,"neg":0.007,"neu":0.953,"pos":0.04}},{"date":"2022-06-03T11:18:00+00:00","title":"Outlook on the Battery Energy Storage System Global Market to 2027 - Increasing Rural Electrification Projects Worldwide Presents Opportunities","content":"Dublin, June  03, 2022  (GLOBE NEWSWIRE) -- The \"Global Battery Energy Storage System Market (2022-2027) by Component, Connection Type, Ownership, Energy Capacity, Application, End User, Geography, Competitive Analysis, and the Impact of Covid-19 with Ansoff Analysis\" report has been added to ResearchAndMarkets.com's offering. \r\n\r\nThe Global Battery Energy Storage System Market is estimated to be USD 3.9 Bn in 2022 and is expected to reach USD 14.59 Bn by 2027, growing at a CAGR of 30.2%.\r\n\r\nMarket Dynamics\n\nMarket dynamics are forces that impact the prices and behaviors of the Global Battery Energy Storage System Market stakeholders. These forces create pricing signals which result from the changes in the supply and demand curves for a given product or service. Forces of Market Dynamics may be related to macro-economic and micro-economic factors. There are dynamic market forces other than price, demand, and supply. Human emotions can also drive decisions, influence the market, and create price signals.\r\n\r\nAs the market dynamics impact the supply and demand curves, decision-makers aim to determine the best way to use various financial tools to stem various strategies for speeding the growth and reducing the risks.\n\nCompany Profiles\n\nThe report provides a detailed analysis of the competitors in the market. It covers the financial performance analysis for the publicly listed companies in the market. The report also offers detailed information on the companies' recent development and competitive scenario. Some of the companies covered in this report are ABB Ltd, Black & Veatch Holding Company, Corvus Energy, Delta Electronics Inc., East Penn Manufacturing Company, EnerDel, Inc., EVE Energy, Fluence Energy (Siemens and AES Company), General Electric, Hitachi, Ltd., Honeywell International, Inc., Johnson Controls International, etc.\r\n\r\nCountries Studied\n\nAmerica (Argentina, Brazil, Canada, Chile, Colombia, Mexico, Peru, United States, Rest of the Americas)Europe (Austria, Belgium, Denmark, Finland, France, Germany, Italy, Netherlands, Norway, Poland, Russia, Spain, Sweden, Switzerland, United Kingdom, Rest of Europe)Middle-East and Africa (Egypt, Israel, Qatar, Saudi Arabia, South Africa, United Arab Emirates, Rest of MEA)Asia-Pacific (Australia, Bangladesh, China, India, Indonesia, Japan, Malaysia, Philippines, Singapore, South Korea, Sri Lanka, Thailand, Taiwan, Rest of Asia-Pacific)\n\nCompetitive Quadrant\n\nThe report includes a Competitive Quadrant a proprietary tool to analyze and evaluate the position of companies based on their Industry Position score and Market Performance score. The tool uses various factors for categorizing the players into four categories. Some of these factors considered for analysis are financial performance over the last 3 years, growth strategies, innovation score, new product launches, investments, growth in market share, etc. \r\n\r\nAnsoff Analysis\n\nThe report presents a detailed Ansoff matrix analysis for the Global Battery Energy Storage System Market. Ansoff Matrix, also known as Product\/Market Expansion Grid, is a strategic tool used to design strategies for the growth of the company. The matrix can be used to evaluate approaches in four strategies viz. Market Development, Market Penetration, Product Development and Diversification. The matrix is also used for risk analysis to understand the risk involved with each approach.\r\n\r\nThe analyst analyses the Global Battery Energy Storage System Market using the Ansoff Matrix to provide the best approaches a company can take to improve its market position.\r\n\r\nBased on the SWOT analysis conducted on the industry and industry players, this Global Research has devised suitable strategies for market growth.\r\n\r\nWhy buy this report?\n\nThe report offers a comprehensive evaluation of the Global Battery Energy Storage System Market. The report includes in-depth qualitative analysis, verifiable data from authentic sources, and projections about market size. The projections are calculated using proven research methodologies.The report has been compiled through extensive primary and secondary research. The primary research is done through interviews, surveys, and observation of renowned personnel in the industry.The report includes an in-depth market analysis using Porter's 5 forces model and the Ansoff Matrix. In addition, the impact of Covid-19 on the market is also featured in the report.The report also includes the regulatory scenario in the industry, which will help you make a well-informed decision. The report discusses major regulatory bodies and major rules and regulations imposed on this sector across various geographies.The report also contains the competitive analysis using Positioning Quadrants, the analyst's Proprietary competitive positioning tool.\n\nKey Topics Covered:\r\n\r\n1 Report Description\r\n\r\n2 Research Methodology\n\n3 Executive Summary\r\n\r\n4 Market Dynamics\r\n4.1 Drivers\r\n4.1.1 Rising Demand for Grid Energy Storage Systems\r\n4.1.2 Growing Adoption of Lithium Battery in Renewable Energy\r\n4.2 Restraints\r\n4.2.1 High Capital Expenditure for Energy Installation\r\n4.2.2 Continuous Disruptions in Supply Chain\r\n4.3 Opportunities\r\n4.3.1 Increasing Rural Electrification Projects Worldwide\r\n4.3.2 Stringent Carbon Reduction Norms\r\n4.4 Challenges\r\n4.4.1 Installation Complexities at Islands or in Remote Areas\r\n\r\n5 Market Analysis\r\n5.1 Regulatory Scenario\r\n5.2 Porter's Five Forces Analysis\r\n5.3 Impact of COVID-19\r\n5.4 Ansoff Matrix Analysis \r\n\r\n6 Global Battery Energy Storage System Market, By Component\r\n6.1 Introduction\r\n6.2 Battery \r\n6.2.1 Lithium-ion\r\n6.2.2 Lead-acid \r\n6.2.3 Flow \r\n6.2.4 Others \r\n6.3 Other Hardware\r\n\r\n7 Global Battery Energy Storage System Market, By Connection Type\r\n7.1 Introduction\r\n7.2 On-Grid Connection\r\n7.3 Off-Grid Connection\r\n\r\n8 Global Battery Energy Storage System Market, By Ownership\r\n8.1 Introduction\r\n8.2 Customer-Owned\r\n8.3 Third-Party-Owned\r\n8.4 Utility-Owned\r\n\r\n9 Global Battery Energy Storage System Market, By Energy Capacity\r\n9.1 Introduction\r\n9.2 Below 100 Mwh\r\n9.3 Between 100 And 500 Mwh\r\n9.4 Above 500 Mwh\r\n\r\n10 Global Battery Energy Storage System Market, By Application\r\n\r\n10.1 Introduction\r\n10.2 Load Management (Energy Demand Management)\r\n10.3 Energy Time-Shift (Arbitrage)\r\n10.4 Backup Power\r\n10.5 Black-Start Capability\r\n10.6 Frequency Control\r\n10.7 Renewable Energy Integration\r\n10.8 Transmission and Distribution (T&D) Deferral\r\n10.9 Microgrids\r\n\r\n11 Global Battery Energy Storage System Market, By End User\r\n11.1 Introduction\r\n11.2 Residential\r\n11.3 Commercial\r\n11.4 Utility\r\n\r\n12 Americas' Battery Energy Storage System Market\r\n12.1 Introduction\r\n12.2 Argentina\r\n12.3 Brazil\r\n12.4 Canada\r\n12.5 Chile\r\n12.6 Colombia\r\n12.7 Mexico\r\n12.8 Peru\r\n12.9 United States\r\n12.10 Rest of Americas\r\n\r\n13 Europe's Battery Energy Storage System Market\r\n13.1 Introduction\r\n13.2 Austria\r\n13.3 Belgium\r\n13.4 Denmark\r\n13.5 Finland\r\n13.6 France\r\n13.7 Germany\r\n13.8 Italy\r\n13.9 Netherlands\r\n13.10 Norway\r\n13.11 Poland\r\n13.12 Russia\r\n13.13 Spain\r\n13.14 Sweden\r\n13.15 Switzerland\r\n13.16 United Kingdom\r\n13.17 Rest of Europe\r\n\r\n14 Middle East and Africa's Battery Energy Storage System Market\r\n14.1 Introduction\r\n14.2 Egypt\r\n14.3 Israel\r\n14.4 Qatar\r\n14.5 Saudi Arabia\r\n14.6 South Africa\r\n14.7 United Arab Emirates\r\n14.8 Rest of MEA\r\n\r\n15 APAC's Battery Energy Storage System Market\r\n15.1 Introduction\r\n15.2 Australia\r\n15.3 Bangladesh\r\n15.4 China\r\n15.5 India\r\n15.6 Indonesia\r\n15.7 Japan\r\n15.8 Malaysia\r\n15.9 Philippines\r\n15.10 Singapore\r\n15.11 South Korea\r\n15.12 Sri Lanka\r\n15.13 Thailand\r\n15.14 Taiwan\r\n15.15 Rest of Asia-Pacific \r\n\r\n16 Competitive Landscape\r\n16.1 Competitive Quadrant\r\n16.2 Market Share Analysis\r\n16.3 Strategic Initiatives\r\n16.3.1 M&A and Investments\r\n16.3.2 Partnerships and Collaborations\r\n16.3.3 Product Developments and Improvements\r\n\r\n17 Company Profiles\r\n17.1 ABB Ltd \r\n17.2 AES Corporation\r\n17.3 Black & Veatch Holding Company\r\n17.4 BYD Company Limited\r\n17.5 Corvus Energy\r\n17.6 Delta Electronics Inc.\r\n17.7 East Penn Manufacturing Company\r\n17.8 EnerDel, Inc.\r\n17.9 EVE Energy\r\n17.10 Fluence Energy (Siemens and AES Company)\r\n17.11 General Electric\r\n17.12 Hitachi, Ltd.\r\n17.13 Honeywell International, Inc.\r\n17.14 Johnson Controls International\r\n17.15 Kokam (SolarEdge)\r\n17.16 LG Energy Solutions CO., LTD.\r\n17.17 Mitsubishi Heavy Industries Ltd.\r\n17.18 Narada Power \r\n17.19 NEC Corporation\r\n17.20 Nextera Energy, Inc.\r\n17.21 NGK Insulators, Ltd.\r\n17.22 Panasonic Corporation\r\n17.23 Parker Hannifin Corp\r\n17.24 Primus Power Solutions \r\n17.25 Samsung SDI Co., Ltd.\r\n17.26 Siemens Energy\r\n17.27 Toshiba Corporation\r\n\r\n18 Appendix\r\n\r\nFor more information about this report visit https:\/\/www.researchandmarkets.com\/r\/h7e5uc\n\nAttachment\n\nGlobal Battery Energy Storage System Market","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/06\/03\/2455909\/28124\/en\/Outlook-on-the-Battery-Energy-Storage-System-Global-Market-to-2027-Increasing-Rural-Electrification-Projects-Worldwide-Presents-Opportunities.html","symbols":[],"tags":["BATTERY ENERGY STORAGE","ENERGY STORAGE","ENERGY STORAGE SYSTEMS","GEOGRAPHY","GRID ENERGY STORAGE","LITHIUM BATTERIES","LITHIUM BATTERY","RESEARCH ANALYSIS AND REPORTS","RESEARCH AND MARKETS"],"sentiment":{"polarity":0.999,"neg":0.015,"neu":0.855,"pos":0.13}},{"date":"2022-05-31T11:00:00+00:00","title":"Effective Growth Strategy To Counter Raw Material Price Hikes Challenges With Supply Chain Integration Supported By Strong Market Demands &amp; Increased Production Capacity","content":"NEW YORK, May 31, 2022 \/PRNewswire\/ -- On May 19, 2022, CBAK Energy Technology, Inc. (Nasdaq: CBAT), a leading China-based lithium-ion battery manufacturer and electric energy solution provider released its first quarter earnings ended March 31, 2022.\n\nMomentous Revenue Growth\n\nCBAT kicked off 2022 with net revenues in 1Q-2022 surging more than eight-fold year-over-year to reach $80.2 million; of which, $65 million was from lithium battery cells materials business acquired from Hitran's merger completed in 4Q-2022. Nevertheless, demand for CBAT's high power lithium batteries has continued to prove robust.\n\nSales of the Company's high-power lithium-ion batteries increased ~70% year-over-year in the fourth quarter of 2022, especially driven by the Light Electric Vehicle end-product application, as well as by the continued momentum in its Uninterruptible Supplies products, achieved even when CBAT was still ramping up production capacity at its Nanjing battery manufacturing facility.\n\nCBAK Energy's production facilities, both in Dalian and Nanjing, currently have a total battery production capacity of 2GWh, and its Nanjing facility is ramping towards a maximum capacity of 18GWh. Based on the strong lithium batteries sales registered in 1Q-2022, CBAT has tremendous potential to multiply its battery sales once the facility has reached its maximum production capacity, supported by strong market demand from the EV and LEV battery ecosystem.\n\nStrong Order Backlog with More Larger Orders Expected in The Near Term\n\nOwing to the positive market feedback on the Company's products, CBAT has an order backlog of approximately $69 million as of May 9, 2022, including the order for lithium-ion batteries supply worth of ~$29.3 million from a leading European provider of heating, cooling and renewable energy systems company, to be met by the full capacity at its main factory in Dalian, together with increased production at its Nanjing plant.\n\nCBAT also expects to receive more orders in the coming quarters, and some in bigger orders starting in the 3rd quarter of 2022.\n\nStory continues\n\nRecent Product Development & 2022 Operating Focus\n\nCBAT continued to develop Large Cylindrical batteries targeting at the LEV and passenger-grade EV markets. The design and R&D for model 42140 battery were completed, and its model prototype production is being worked on catered to the robust market demand.\n\nThe Company's main focus in the second quarter is to maintain stable revenues from its uninterruptible supplies and raw material businesses, and will also continue to expand its large-cylindrical batteries through signing new contracts with the LEV and EV manufacturer customers.\n\nParticularly benefiting from the rapidly rising global commodity prices, the new raw material business resulting from Hitran's acquisition has now accounted for a major stream of the Company's total revenues. With reliable product quality, Hitran is able to develop and accumulate a number of strategic customers, and is now in full production and expected to further make high nickel, cathode materials used for EV safety and driving range improvement.\n\n3-Step Strategic Plan to Counter Material Price Hikes and Improve Margins\n\nIn order to combat the impact of rising raw material costs which decreased the profitability of its downstream battery production, CBAT management is proactively taking measures in three main aspects:\n\nStep 1. Sign long-term supply agreements with major suppliers to secure major materials supplies.\n\nStep 2. Expand into the upstream raw material business and use material price inflation to offset the decrease in gross margins of battery plants.\n\nStep 3. Renegotiate prices with downstream customers to successfully raise product prices for the Company's key customers.\n\nManagement expects the gross margin to improve once its raw-material production capacity and downstream price increases are implemented through the 3-step strategic plan, and subsequently becomes a leading lithium-ion battery and electric energy solutions provider, with secured raw materials and augmented downstream battery production capacity, despite the short-term pressure on the Company's cash flow by the rising material prices.\n\nThe Company also plans to actively search for quality assets for value-add acquisitions, aiming at stabilized supply chain and enhanced investment returns.\n\nFirst Quarter 2022 Financial Highlights\n\nNet revenues were $80.2 million, representing a year-over-year increase of 752%, and a quarter-over-quarter increase of 188%. The increases were mainly driven by incremental revenues from integrating lithium battery materials business post Hitran acquisition, as well as by ~70% year-over-year growth in high power lithium batteries sales.\n\nAdditionally in terms of net revenues by end-product applications, revenues from high power lithium batteries used in LEV grew 329% YoY in the quarter.\n\n1Q-2022 gross profit margin was 6.6%, down from 19.5% in 1Q-2021 while up from 3.7% in 4Q-2021, primarily due to the increase in raw material costs, which are expected to abate when new capacity is being added by the overall industry.\n\nTotal operating expenses increased 256% YoY, primarily due to growing headcount and consolidation of Hitran; among which, R&D expense in particular increased 585% YoY, coupled with 290% YoY increase in Sales & Marketing expenses. Despite the increases, operating expenses was limited to 8.3% of revenues in the quarter, down significantly from 19.8% from a year ago.\n\nNet income attributable to CBAT shareholders was $0.4 million, compared to $29.6 million in 1Q-2021 when the fair value of its warrant's liability decreased significantly due to lower stock prices, which in turn led to higher GAAP earnings. Change in CBAT warrant's fair value was merely $1.6 million in 1Q-2022, compared to $28.4 million in the same period of 2021. Basic and fully-diluted net income per share were both $0.01 in the quarter, compared to a net income per share of $0.35 in 1Q-2021.\n\nCash and cash equivalents were $5.6 million as of March 31, 2022, compared to $7.4 million as of December 31, 2021.\n\nDISCLOSURES AND DISCLAIMERS\n\nStone Street Group LLC (\"Stone Street\") publishes research reports on publicly-traded companies. Stone Street has been retained by the Company discussed in this report (the \"Company\") to provide ongoing digital investor relations services, including the creation and dissemination of this report. All research published by Stone Street is based on public information, or on information from the Company that the Company is required to promptly make public.\n\nStone Street is not a broker-dealer or a \"covered person\" under SEC Regulation AC, and does not distribute its research through a registered broker-dealer or any associated person of a registered broker-dealer. Accordingly, Stone Street is exempt from the provisions of Regulation AC. Nevertheless, Stone Street makes the following voluntary disclosures and disclaimers in connection with its research reports:\n\nNO GUARANTEE: This research report is not a substitute for the exercise of an investor's independent due diligence and independent investment determinations. Information contained herein is based on sources we believe to be reliable but we do not guarantee their accuracy. It should be presumed that the analyst who authored this report has had discussions with the Company to endeavor to ensure factual accuracy prior to publication, however, no independent due diligence or verification has been undertaken by the analyst. No endorsements are made in respect of information provided or published by the subject Company and relied upon by the analyst for purposes of this research report. Recipients of this report should consider this report as only one factor in making any investment decision. This report is for information purposes only and is not intended as an offer to sell or a solicitation to buy securities. Any and all information provided by the Company which has been publicly disclosed as \"forward looking information\" remains subject to all uncertainties in such regard and Stone Street makes no assurances or guaranties of actual outcomes.\n\nNO CONFLICTS OF INTEREST: Stone Street does NOT own securities of the issuers described herein, and Stone Street does not make a market in any securities. Stone Street does not engage in, or receive compensation from, any investment banking or corporate finance-related activities with the Company discussed in the report. Stone Street's contracts with issuers protect Stone Street's full editorial control of all research, timing of release of reports, and release from liability for negative reports.\n\nANALYST INDEPENDENCE: Each Stone Street analyst has full discretion on the analysis and revenue targets contained in the report, based on his or her own due diligence. Analysts are paid in part based on overall profitability of Stone Street. No part of analyst compensation was, or will be, directly or indirectly, related to the specific recommendations or views expressed in any report or article. Stone Street policy does not allow an analyst or a member of their household (i) to own, trade, or have any beneficial interest in any securities of any Company that analyst covers, or (ii) serve as an officer or director of a covered Company.\n\nRISK FACTORS: Earnings targets and opinions concerning the composition of market sectors included in this report reflect analyst judgments as of this date and are subject to change without notice. A risk to our earnings targets is that the analyst's estimates or forecasts may not be met. This report contains forward-looking statements, which involve risks and uncertainties. Actual results may differ significantly from such forward-looking statements. Factors that may cause such differences include, but are not limited to, those discussed in the \"Risk Factors\" section in the issuer's SEC filings available in electronic format through SEC Edgar filings at www.sec.gov.\n\nCOMPENSATION: Stone Street received a flat fee from or on behalf of the Company for the creation and dissemination of the report. Stone Street has not received investment banking income from the Company in the past 12 months, and does not expect to receive investment banking income from the Company in the next 12 months.\n\nANALYST CERTIFICATION: The research analyst certifies that this report accurately reflects his\/her personal views about the Company's securities that none of the research analyst's compensation was, is or will be, directly or indirectly, related to the analyst's specific recommendations or views contained in this research report. Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/effective-growth-strategy-to-counter-raw-material-price-hikes-challenges-with-supply-chain-integration-supported-by-strong-market-demands--increased-production-capacity-301557578.html\n\nSOURCE CBAK Energy","link":"https:\/\/finance.yahoo.com\/news\/effective-growth-strategy-counter-raw-110000150.html","symbols":["CBAT.US"],"tags":["CBAT","COMPANY","HITRAN","LITHIUM BATTERIES","LITHIUM BATTERY","PRODUCTION CAPACITY","RAW MATERIAL","THE COMPANY"],"sentiment":{"polarity":0.993,"neg":0.038,"neu":0.877,"pos":0.085}},{"date":"2022-05-27T19:04:54+00:00","title":"Why EV Stocks Lit Up on Friday","content":"Let's begin today's review with Livent, which has the most obvious good news powering its rally. Early this morning, Livent announced that it will collaborate with electric air-taxi start-up Lilium N.V. (NASDAQ: LILM) to jointly develop new lithium metal technology for use in high-performance battery cells.","link":"https:\/\/finance.yahoo.com\/m\/9e304c48-2da5-3b86-bc16-0b6e8f52e1bf\/why-ev-stocks-lit-up-on-friday.html","symbols":["8LV.F","LILM.US","LTHM.US"],"tags":["BLINK CHARGING","LITHIUM BATTERIES","LIVENT"],"sentiment":{"polarity":0.49,"neg":0,"neu":0.934,"pos":0.066}},{"date":"2022-05-25T08:18:00+00:00","title":"Global and China Power Battery Management System (BMS) Markets Report 2022-2026: Preferential Policies Draw to an End, and the NEV BMS Market will be Impacted","content":"Dublin, May  25, 2022  (GLOBE NEWSWIRE) -- The \"Global and China Power Battery Management System (BMS) Industry Report, 2022-2026\" report has been added to ResearchAndMarkets.com's offering. \r\n\r\nNew energy vehicle sales have been growing rapidly worldwide over the recent years, reaching 6.5 million units with a year-on-year upsurge of 108% and with a penetration rate up to 8.1% in 2021. There exists vigorous demand for new energy vehicles whose sales would be even stronger if not for the \"long-term shortage of auto parts\" faced by OEMs.\r\n\r\nAs the global new energy vehicle market springs up, BMS for new energy vehicle takes a sizable market scale. In 2021, global NEV sales soared 108% year on year, which boosted the BMS market value to register $11.5 billion and rise 56.5% on an annualized basis.\r\n\r\nIn 2021, China's NEV sales reported 3.521 million units as a percentage of 54.2% in global total, with a year-on-year spike of 157.6% and the market penetration of 13.4%. As the world's largest producer and consumer of new energy vehicles, China's demand for BMS has been climbing continuously. The Chinese new energy vehicle BMS market was estimated to be worth RMB22.51 billion in 2021, up 90.6% from a year earlier.\r\n\r\nCompetition pricks up and OEMs enjoy superiorities\r\n\r\nThe global new energy vehicle BMS market is tripartite: carmakers represented by Tesla and BYD; the battery manufacturers like CATL and LGC; and the third-party BMS providers such as Ningbo Preh Joyson Automotive Electronics and SINOEV Technologies.\r\n\r\nAmong them, Tesla and BYD, with handsome NEV sales, were the top two giants sweeping 14.4% and 9.1% of the global new energy vehicle BMS market in 2021 respectively, followed by Preh Joyson (8.8%). Battery vendors CATL and LGC were ranked fourth and fifth.\r\n\r\nIn the Chinese NEV BMS market, BYD, CATL and Tesla stay ahead of others; wherein, BYD (FinDreams Battery) overtook CATL in 2021 to become the No.1 (a 15.5% share) whose deliveries skyrocketed 253.3% year on year.\r\n\r\nPreferential policies draw to an end, and the NEV BMS market will be impacted.\r\n\r\nIn April 2020, the Ministry of Finance, the State Taxation Administration and the Ministry of Industry and Information Technology jointly issued the Announcement on Policies Relating to the Exemption of New Energy Vehicles from Vehicle Purchase Tax, proposing that from January 1, 2021 to December 31, 2022, it will be exempt from purchase tax to buy NEVs.\r\n\r\nThe NEV subsidy policy will end on December 31, 2022, and vehicles licensed after December 31 will no longer be subsidized, according to the latest new energy vehicle purchase subsidy policy issued jointly by four ministries on December 31, 2021,\r\n\r\nStarting from 2023, the new energy vehicle purchase tax exemption and NEV purchase subsidies in China will be terminated concurrently, which will affect the NEV sales to a certain extent, thus inflicting the demand for BMS.\r\n\r\nNew energy vehicle BMS is evolving towards 'wireless, integrated and cloud-based'\r\n\r\nWireless\r\n\r\nWireless BMS has the merits of low power consumption, reduced in-package wiring harness, simplified structure, flexible deployment, etc., enabling lower assembly costs and weight reduction to agree with the lightweight trend of NEV. To date, ADI (Linear Technology), Texas Instruments, Visteon, NXP, etc. have forayed into wireless BMS.\r\n\r\nIntegrated\r\n\r\nWith a universe of data brought by intelligent connectivity, the automotive electronic and electrical architecture (EEA) has also been upgraded, with the domain controller highly integrating all features of the split BMS, VCU and MCU into one, for centralized control and management to form a true one \"system\".\r\n\r\nIn June 2020, ENOVATE's self-developed and world's first power domain controller --Vehicle Battery Unit (VBU) was successfully produced, integrating the key technologies of Vehicle Controller Unit (VCU) and Battery Management System (BMS), managing the 'motor, battery, electric control' system in a more efficient and accurate manner, while facilitating platform scalability and rapid iteration.\r\n\r\nCloud-based\r\n\r\nThe cloud-based BMS connects the BMS on electric vehicle to the cloud, enabling the whole life cycle of battery data to be \"uploaded to the cloud\" and the data collected to be evaluated with machine learning algorithms over the cloud to deliver better battery management strategies and battery failure warning functions.\r\n\r\nIn 2021, Huawei unveiled the pioneering AI BMS solution to address battery safety issue by a fusion of high-precision BMS chips with cloud-based AI technology. A number of automakers have cooperated with Huawei commercially and in depth, and Huawei's AI BMS cloud platform system has accessed to data of over 100,000 NEVs, successfully warning 10-plus cases of battery thermal runaway failures and enabling early treatment of some high-risk vehicles.\r\n The report highlights the following:\n\nPolicies about BMS, including NEV industry policy, BMS standards;Global and China new energy vehicle industry;Global and China BMS industry (status quo, market size, competition, development trend, etc.);14 global and 18 Chinese BMS vendors (operation, BMS business, etc.);3 global BMS chip vendors (operation, BMS chip solutions, etc.)\n\nKey Topics Covered:\r\n\r\n1 Overview\r\n1.1 Definition of BMS\r\n1.2 BMS Classification\r\n1.3 Core Functions of BMS\r\n1.3.1 Battery Cell Monitoring Technology\r\n1.3.2 Estimation Technology\r\n1.3.3 Balancing Technologies\r\n1.3.4 Core Features of BMS Software\r\n1.4 BMS Industry Chain\r\n\r\n2. Policies on BMS\r\n2.1 New Energy Vehicle Industry Policy\r\n2.1.1 Purchase Tax Reduction & Exemption Policy\r\n2.1.2 Fiscal Subsidies for Purchase\r\n2.2 BMS National Standards Updated and Improved in Line with Technological Advances\r\n\r\n3. Global and China EV Industry\r\n3.1 Global\r\n3.2 China EV Industry\r\n\r\n4. Global and China BMS Industry\r\n4.1 Battery Safety\r\n4.1.1 Fire Accidents of NEV\r\n4.1.2 Causes for NEV Fire Accidents and Prevention\r\n4.2 BMS Market\r\n4.2.1 Global\r\n4.2.2 China\r\n4.2.3 BMS Chip\r\n4.3 BMS Market Size\r\n4.4 Competitive Landscape\r\n4.4.1 Global\r\n4.4.2 China\r\n4.5 Development Trends\r\n4.5.1 Gradually Concentrating BMS Industry, Squeezing out SMEs in Market\r\n4.5.2 Rapid Growth in Market Demand\r\n4.5.3 Key Concerns of BMS as Cost Reduction and Extending Service Life\r\n4.5.4 Crucial BMS Algorithms Still Need Optimization\r\n4.5.5 Improvement of Estimation Standard System\r\n4.5.6 Emphasis on Innovation of BMS Software and Hardware Technology\r\n4.5.7 BMS Heading towards Wireless\r\n4.5.8 BMS Evolving towards Integration\r\n4.5.9 BMS Moving to Cloud\r\n\r\n5. Global BMS Vendors\r\n5.1 Denso (Japan)\r\n5.1.1 Profile\r\n5.1.2 Operation\r\n5.1.3 R&D Costs\r\n5.1.4 BMS Business\r\n5.2 MARELLI (Japan)\r\n5.3 Hitachi Astemo (Japan)\r\n5.4 Mitsubishi Electric (Japan)\r\n5.5 Hyundai Kefico (Korea)\r\n5.6 LG Energy Solution (Korea)\r\n5.7 SK Innovation (Korea)\r\n5.8 Tesla (USA)\r\n5.9 Lithium Balance (Denmark)\r\n5.10 Eberspaecher Vecture (Canada)\r\n5.11 Rimac Automobili (Croatia)\r\n5.12 Digi-Triumph Technology (Taiwan)\r\n5.13 Clayton Power (Denmark)\r\n5.14 NXP Semiconductors (Netherlands)\r\n\r\n6. Chinese BMS Vendors (Independent Third Parties)\r\n6.1 Huizhou E-power Electronics\r\n6.1.1 Profile\r\n6.1.2 BMS Business\r\n6.1.3 Application Cases\r\n6.2 Shenzhen Klclear Technology\r\n6.3 SINOEV (Hefei) Technologies\r\n6.4 Ningbo Joyson Electronic Corp. (German Preh GmbH)\r\n6.5 Anhui LIGOO New Energy Technology Co., Ltd.\r\n6.6 Shanghai G-Pulse Electronics Technology Co., Ltd.\r\n6.7 Neusoft Reach Automotive Technology (Shanghai) Co., Ltd.\r\n6.8 United Automotive Electronic Systems Co., Ltd.\r\n6.9 Guochuang New Energy Technology Co., Ltd.\r\n\r\n7. Chinese BMS Vendors (OEMs)\r\n7.1 BYD\r\n7.1.1 Profile\r\n7.1.2 Operation\r\n7.1.3 BMS Business\r\n7.2 BAIC BJEV\r\n7.3 Shanghai E-Propulsion Auto Technology Co., Ltd.\r\n\r\n8. Chinese BMS Vendors (Power Battery)\r\n8.1 Beijing Pride Power Systems Technology Co., Ltd.\r\n8.1.1 Profile\r\n8.1.2 Battery Business\r\n8.2 CATL\r\n8.3 Hefei Gotion High-tech Power Energy Co., Ltd.\r\n8.4 China Aviation Lithium Battery Co., Ltd.\r\n8.5 Sunwoda Electronic Co., Ltd.\r\n8.6 SVOLT Energy Technology Co., Ltd.\r\n\r\n9. Global BMS Chip Vendors\r\n9.1 Analog Devices (USA)\r\n9.1.1 Profile\r\n9.1.2 Operation\r\n9.1.3 Revenue Structure\r\n9.1.4 Gross Margin\r\n9.1.5 BMS Solutions\r\n9.2 Texas Instruments (USA)\r\n9.3 Infineon (Germany)\n\nFor more information about this report visit https:\/\/www.researchandmarkets.com\/r\/txy1ka","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/05\/25\/2449970\/28124\/en\/Global-and-China-Power-Battery-Management-System-BMS-Markets-Report-2022-2026-Preferential-Policies-Draw-to-an-End-and-the-NEV-BMS-Market-will-be-Impacted.html","symbols":[],"tags":["BATTERY MANAGEMENT","BATTERY MANUFACTURER","BATTERY TECHNOLOGY","LITHIUM BATTERIES","LITHIUM BATTERY","RESEARCH ANALYSIS AND REPORTS","RESEARCH AND MARKETS","UPS"],"sentiment":{"polarity":0.998,"neg":0.03,"neu":0.868,"pos":0.102}},{"date":"2022-05-24T10:46:00+00:00","title":"Lithium Battery Charger IC Market Forecasted to Hit USD 36 Billion by 2030 with a CAGR of 22.2% - Report by Market Research Future (MRFR)","content":"New York, US, May  24, 2022  (GLOBE NEWSWIRE) -- Lithium Battery Charger ICs Market Overview: \r\nAccording to a comprehensive research report by Market Research Future (MRFR), “Lithium Battery Charger IC Market” information by Charger Type, by Appliance, by End-user and Region – Forecast to 2030” market size to reach USD 36 billion, growing at a compound annual growth rate of 22.2% by 2030.\n\nLithium Battery Charger ICs Market Scope: \r\nThe growing popularity of wearables, health diagnostic products, and hearing aids are inducing the demand for charger ICs that can boost battery life which in turn will fuel the market growth over the forecast period.\n\nReport MetricDetailsMarket SizeUSD 36 Billion (2030)CAGR22.2%Base Year2019Forecast Period2020-2030Historical Data2018Forecast UnitsValue (USD Billion)Report CoverageRevenue Forecast, Competitive Landscape, Growth Factors, and TrendsSegments CoveredCharger Type, Appliance, End-user and RegionGeographies CoveredNorth America, Europe, Asia-Pacific, and Rest of the World (RoW)Key VendorsSTMicroelectronics NV (Switzerland), Vishay Intertechnology Inc. (US), Microchip Technology Inc (US), TOREX Semiconductor Ltd. (Japan), ROHM Company Ltd (Japan), Future Technology Devices International (FTDI) Chip (UK), ON Semiconductor Corporation (US), Diodes Incorporated (US), Intersil Corporation (US), Active-Semi Inc. (US), Monolithic Power Systems Inc (US) and Shanghai Nanxin Semiconductor Technology Co. Ltd. (China),Key Market OpportunitiesRise in Consumer Electronics Sector to Present Robust OpportunitiesKey Market DriversRising Uses of Lithium-ion Battery to Bolster Growth\n\nGet Free Sample PDF Brochure: \r\nhttps:\/\/www.marketresearchfuture.com\/sample_request\/7318\n\nMarket USP Exclusively Encompassed:\r\nLithium Battery Charger ICs Market Drivers\r\nIncreasing Adoption in Different Appliances & Electronics Industries to offer Robust Opportunities \r\nLithium-ion batteries along with being rechargeable also have a long life cycle, as well as high energy density, improved performance, and increased reliability. Lithium-ion batteries are an excellent choice for modern technologies that improve the market. Thus, lithium-ion batteries are widely utilized in a variety of appliances and electronics sectors, including energy and electricity, automotive, and others which will offer robust opportunities for the market over the forecast period.\n\nOver the last decade, the global market for lithium-ion batteries has grown dramatically. As a result of this tendency, the market is expected to grow significantly. The growing need for smart devices & other consumer electrical products is also boosting the market for lithium battery charger ICs. In addition, the growing popularity of electric and hybrid vehicles is driving up demand for lithium battery charger ICs.\n\nStringent Environmental Regulations to act as Market Restraint \r\nLithium batteries use nickel and cobalt cathodes, and solvent-based electrode manufacturing, which have the most negative environmental consequences. Global warming, ecological damage, resource depletion, & human health effects are among them. Lithium toxicity has negative pulmonary, respiratory, and neurological repercussions in people who are exposed to it. The implementation of severe environmental regulations in numerous countries may stifle current market growth, impacting lithium battery charger ICs sales and consumption in the next years.\n\nConcerns related to Thermal Stability and Overheating to act as Market Challenge\r\nThe concerns related to thermal stability and overheating of li-ion batteries may act a market challenge over the forecast period.\n\nBrowse In-depth Market Research Report (146 Pages) on Lithium Battery Charger ICs Market: \r\nhttps:\/\/www.marketresearchfuture.com\/reports\/lithium-battery-charger-ics-market-7318\n\nSegmentation of Market Covered in the Research:\r\nThe global lithium battery charger ICs market is bifurcated based on end user, appliance, and charger type.\n\nBy charger type, switching battery chargers will lead the market over the forecast period.\n\nBy appliance, small appliances will dominate the market over the forecast period.\n\nBy end user, consumer electronics will spearhead the market over the forecast period.\n\nRegional Analysis\r\nNorth America to Hold Winning Streak in Lithium Battery Charger ICs Market \r\nNorth America will hold a winning streak in the global lithium battery charger ICs market over the forecast period. Consumption and sales of lithium-ion battery charger ICs in the region are increasing due to factors such as rising need for Li-ion batteries in smartphones as well as other consumer electronic gadgets. This is due to the presence of notable players and company investments to improve the li-on batteries’ charging capacities. The market in the region in 2017 was valued at USD 4.10 billion, and is predicted to grow to USD 12,225.9 million by 2023, representing a 21.32 percent compound annual growth rate (CAGR).\n\nTalk to Expert: \r\nhttps:\/\/www.marketresearchfuture.com\/ask_for_schedule_call\/7318\n\nEurope to Hold Second Largest Share in Lithium Battery Charger ICs Market \r\nIn 2017, Europe had the second-largest proportion of the global market, with USD 1.79 billion in revenue. During the assessment period, the market in Europe is estimated to rise at a 17.89 percent CAGR. Factors such as increased renewable energy generation and a focus on reducing reliance on fossil fuels are expected to boost the market share in the region.\n\nThe market for lithium battery charger ICs is being driven by the rising creation of hybrid and electric vehicles in the region. In the area, Germany is predicted to be the largest market. With the presence of several automotive behemoths, the market in the region is expected to reach USD 978.87 million by 2023. The region's market will benefit from rising usage across various industries and also favourable legislation in several regional marketplaces.\n\nDominant Key Players in Lithium Battery Charger ICs Market Covered are:\n\nSTMicroelectronics NV (Switzerland)Vishay Intertechnology Inc. (US)Microchip Technology Inc (US)TOREX Semiconductor Ltd. (Japan)ROHM Company Ltd (Japan)Future Technology Devices International (FTDI) Chip (UK)ON Semiconductor Corporation (US)Diodes Incorporated (US)Intersil Corporation (US)Active-Semi Inc. (US)Monolithic Power Systems Inc (US) Shanghai Nanxin Semiconductor Technology Co. Ltd. (China)\n\nCOVID-19 Impact on the Global Lithium Battery Charger ICs Market\r\nThe COVID-19 epidemic has forced the closure of multiple IC charger lithium battery production sites around the world, resulting in significant revenue losses in industries such as consumer electronics, automotive, energy and power, and others. The coronavirus-caused shutdown halted manufacturing of numerous important raw materials on the global market, causing its costs to skyrocket.\n\nHowever, the market is again preparing for the tighter restrictions, which are gradually becoming less restrictive. Innovative industry companies have been actively looking for new applications for such charger ICs in COVID 19 treatment monitoring and tracking systems. Following the lifting of the lockdown in a number of nations, product need in end-use sectors may go up.\n\nBuy this Report:\r\nhttps:\/\/www.marketresearchfuture.com\/checkout?currency=one_user-USD&report_id=7318\n\nCompetitive Landscape\r\nGiven the existence of leading manufacturers and distributors, the global lithium battery charger ICs market looks to be extremely fragmented. To gain traction, they look for chances to integrate across the whole value chain, focusing on research and development investments, mergers and acquisitions, and production facility development. New ICs makers join the market with high pricing in order to undercut incumbent players and gain traction in international markets.\n\nRelated Reports:\r\nPassive Optical LAN Market, By Component, By Type, By Application, By End User - Forecast to 2027\n\nElectronic Security System Market By Type and By End-user and By Region- Forecast 2027\n\nService Robotics Market Information By Type, By End-User and By Region - Forecast 2027\n\nAbout Market Research Future:\r\nMarket Research Future (MRFR) is a global market research company that takes pride in its services, offering a complete and accurate analysis regarding diverse markets and consumers worldwide. Market Research Future has the distinguished objective of providing the optimal quality research and granular research to clients. Our market research studies by products, services, technologies, applications, end users, and market players for global, regional, and country level market segments, enable our clients to see more, know more, and do more, which help answer your most important questions.\n\nFollow Us: LinkedIn | Twitter","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/05\/24\/2449122\/0\/en\/Lithium-Battery-Charger-IC-Market-Forecasted-to-Hit-USD-36-Billion-by-2030-with-a-CAGR-of-22-2-Report-by-Market-Research-Future-MRFR.html","symbols":[],"tags":["COMPANY ANNOUNCEMENT","FEATURE ARTICLE","LITHIUM BATTERY","LITHIUM BATTERY CHARGER","LITHIUM BATTERY CHARGER IC","LITHIUM BATTERY CHARGER ICS","LITHIUM ION CELL","MARKET RESEARCH FUTURE","MARKET RESEARCH REPORTS","PRESS RELEASES","RESEARCH ANALYSIS AND REPORTS"],"sentiment":{"polarity":0.999,"neg":0.019,"neu":0.864,"pos":0.117}},{"date":"2022-05-21T12:00:50+00:00","title":"Tesla Supplier Livent Leads Five Stocks With These Two Winning Traits","content":"Lithium producer Livent, a Tesla supplier, is outperforming in a challenging market, along with these four top stocks.","link":"https:\/\/finance.yahoo.com\/m\/3c6b75b9-94f8-3f61-ae55-d41bebe7e944\/tesla-supplier-livent-leads.html","symbols":["CHV.F","CHV.XETRA","CVX.MX","CVX.US","NOC.US","NOCG34.SA","NTH.F","TSLA.US","TSLA34.SA","WWE.US","WWFA.F"],"tags":["CHEVRON","LITHIUM BATTERY","LIVENT","NORTHROP GRUMMAN","RELATIVE STRENGTH","WORLD WRESTLING ENTERTAINMENT"],"sentiment":{"polarity":0.34,"neg":0,"neu":0.805,"pos":0.195}},{"date":"2022-05-19T10:00:00+00:00","title":"In Chile's Atacama, lithium mining stirs fight over flamingos","content":"By Alexander Villegas and Cristian Rudolffi\n\nATACAMA DESERT, May 19 (Reuters) - On the white plains of Chile's lithium-rich Atacama desert, bright pink flamingos enliven the sprawling salt flats where sporadic blue pools provide much needed hydration.\n\nBut flamingo numbers are falling, with a new study linking this to the water extracted by mining firms to pump up brine filled with lithium, the metal used to make batteries for mobile phones, laptop computers and electric vehicles.\n\nMiners contend their operations do not affect flamingo herds and say the studies are based on unreliable data.\n\nThe stand-off underscores growing tensions in the Andean nation over water use and mining's impact on local communities and the environment. Tougher regulation is a risk for firms in the world's No. 2 lithium producer and No. 1 for copper.\n\n\"You can explain the effects specifically from lithium extraction,\" said Cristina Dorador, co-author of the study in the Royal Society's Proceedings B journal, referring to findings that flamingo numbers dropped as more water was used up.\n\nThe scientists examined salt flats throughout Chile to measure the effects of other variables on water levels. Satellite imagery of mining ponds on the Atacama, home to most of Chile's lithium, was used to calculate how much water was extracted.\n\nFlamingos reproduce less with less water, which over time could impact herd numbers, said co-author Nathan Senner, a researcher of ecosystems and environmental change.\n\n\"It's not like they all die at once, but if you're not reproducing all of a sudden, even things that live as long as flamingos start to die. And that's where numbers really start to tumble quite rapidly.\"\n\nIn other salt flats without mining, flamingo populations remained steady over the last decade despite natural water variations linked to rainfall and climate shifts. In the Atacama, though, James and Andean flamingos declined 10-12%.\n\nStory continues\n\nChile's National Mining Society declined to comment. Albemarle Corp, one of the main two lithium miners in Chile, did not respond to a request for comment.\n\nSQM, the other main lithium miner, disagreed with key parts of the study, saying in a statement that its own monitoring indicated that \"flamingo populations have remained stable.\"\n\nSQM said satellite analysis could considerably over- or under-estimate water use, and called for more research on the ground.\n\nDorador, a scientist from the region and an elected official working on Chile's new constitution, said locals have noticed a decline in flamingos in the salt flats affected by mining for years.\n\n\"They are incredibly important because they're one of big tourist attractions of San Pedro de Atacama,\" said Dorador.\n\nDorador said indigenous elders collect flamingo eggs on the flats for their regular diet, while the birds regulate the ecosystem eating plankton, crustaceans and microorganisms, helping avoid damaging bacterial blooms on the water.\n\nChile's flamingo numbers overall have held up, thanks to herds on other flats not affected by mining. But the consequences could be severe as demand spikes for lithium batteries powering electric vehicles, Dorador warned.\n\n\"We have to think where these materials come from, because we're not always aware. We buy all these things but we often don't know what had to happen to make that product.\" (Reporting by Alexander Villegas and Cristian Rudolffi; Editing by Adam Jourdan and Richard Chang)","link":"https:\/\/finance.yahoo.com\/news\/chiles-atacama-lithium-mining-stirs-100000107.html","symbols":["ALB.US","AMC.F","HG.COMM"],"tags":["ATACAMA DESERT","CHILE","CRISTINA DORADOR","LITHIUM BATTERIES","PINK FLAMINGOS","SALT FLATS"],"sentiment":{"polarity":-0.948,"neg":0.068,"neu":0.897,"pos":0.035}},{"date":"2022-05-19T09:30:00+00:00","title":"CBAK Energy Reports First Quarter 2022 Unaudited Financial Results","content":"– Net revenues up 752% year over year in the first quarter –\n\nDALIAN, China, May 19, 2022 \/PRNewswire\/ -- CBAK Energy Technology, Inc. (NASDAQ: CBAT) (\"CBAK Energy,\" or the \"Company\") a leading lithium-ion battery manufacturer and electric energy solution provider in China, today reported its unaudited financial results for the first quarter ended March 31, 2022.\n\nFirst Quarter 2022 Financial Highlights\n\nNet revenues were $80.2 million, an increase of 752% from $9.4 million in the same period of 2021. Gross profit was $5.3 million, an increase of 189% from $1.8 million in the same period of 2021. Net income attributable to shareholders of CBAK Energy was $0.4 million, compared to a net income attributable to CBAK Energy shareholders of $29.6 million in the same period of 2021.\n\nYunfei Li, Chairman and Chief Executive Officer of the Company, commented: \"We are very excited to kick off 2022 with our net revenues surging more than eight-fold year over year to reach $80.2 million in the first quarter, primarily driven by the material business brought by the Hitrans merger and robust demand for our high power lithium batteries.\"\n\nMr. Li continued: \"We will continue attentive operations in the material business with additional strategies to enhance its core competitiveness while actively combining them with other alternatives to counter the impact of increased raw material costs on the battery production. Additionally, we remain focused on product innovations to meet various demands and drive higher lithium battery sales. With our expansion into producing key materials for battery products and our relentless efforts into addressing the dynamic market, we are very confident in our capabilities to grow and thrive in the battery industry.\"\n\nXiangyu Pei, Interim Chief Financial Officer of the Company, noted: \"Our significant revenue expansion exemplified the efficacies of our growth strategies. Despite short-term challenges from raw material price hikes, we furthered our investments for our infrastructure to propel higher revenue levels.  Looking ahead, we will remain committed to driving our next phase of growth by leveraging and building upon our solid financial position and competitive advantages.\"\n\nStory continues\n\nFirst Quarter 2022 Business Highlights & Recent Developments\n\nIn May, CBAK Energy received an order from a leading European provider of heating, cooling and renewable energy systems (the \"Customer\"), for a supply of lithium-ion batteries worth EUR 28.2 million ($29.3 million). The Customer has a global presence with annual sales of billions of Euros. CBAK Energy has been collaborating with the Customer since 2020.\n\nFirst Quarter 2022 Financial Results\n\nNet revenues were $80.2 million, an increase of 752% from $9.4 million in the same period of 2021. The increase was driven by additional revenues from lithium battery materials brought by the acquisition of Hitrans, and strong sales of high power lithium batteries.\n\nNet Revenues by End-product Applications\r\n($ thousands) 2022\n\nFirst\n\nQuarter 2021\r\nFirst\n\nQuarter % \r\nChange\r\nYoY Segment 1\n\nHigh power lithium batteries used in: Uninterruptable supplies $14,875 $8,764 70 Light electric vehicles 146 34 329 Electric vehicles - 101 -100 Segment 2 (Hitrans)\n\nMaterials for use in manufacturing of lithium battery \r\ncell\n\nPrecursor\n\nCathode 36,813\n\n28,363 -\n\n- -\n\n- Trading of raw materials used in lithium batteries - 517 -100 Total  $80,196 $9,416 752\n\nCost of revenues was $74.9 million, an increase of 888% from $7.6 million in the same period of 2021. This was primarily due to increased net revenues.\n\nGross profit was $5.3 million, an increase of 189% from $1.8 million in the same period of 2021. Gross margin was 6.6%, compared to 19.5% for the same period of 2021. The decrease in gross margin was primarily due to the increase in raw material costs.\n\nTotal operating expenses were $6.7 million, an increase of 256% from $1.9 million in the same period of 2021, primarily due to growing headcount and the consolidation of Hitrans.\n\nResearch and development expenses were $3.3 million, an increase of 585% from $0.5 million in the same period of 2021. Sales and marketing expenses were $0.8 million, an increase of 290% from $0.2 million in the same period of 2021. General and administrative expenses were $2.2 million, an increase of 69% from $1.3 million in the same period of 2021. Provision for doubtful accounts was $0.3 million, compared to recovery of doubtful accounts of $0.2 million in the same period of 2021.\n\nOperating loss was $1.3 million, compared to $27,882 in the same period of 2021.\n\nFinance income, net was $5,014, compared to finance expenses of $7,598 in the same period of 2021.\n\nChange in fair value of warrants was $1.6 million, compared to $28.4 million in the same period of 2021. The change in fair value of the warrants liability is mainly due to share price decline.\n\nNet income attributable to shareholders of CBAK Energy was $0.4 million, compared to a net income attributable to CBAK Energy shareholders of $29.6 million in the same period of 2021.\n\nBasic and diluted income per share were both $0.01, compared to both $0.35 in the same period of 2021.\n\nCash and cash equivalents were $5.6 million as of March 31, 2022, compared to $7.4 million as of December 31, 2021.\n\nConference Call\n\nCBAK Energy's management will host an earnings conference call at 8:00 AM U.S. Eastern Time on Thursday, May 19, 2022 (8:00 PM Beijing\/Hong Kong Time on May 19, 2022).\n\nDetails of the conference call are as follows:\n\nInternational: +61-2-9253-5921 United States: +1-855-824-5644 \/ +1 646-722-4977 Hong Kong, China: +852-3027-6500 Mainland, China: +86-800-988-0563 \/ +86-400-821-0637 Event ID: EV00135062 Participants Pin: 36584787#\n\nAdditionally, a live and archived webcast of the conference call will be available at: https:\/\/edge.media-server.com\/mmc\/p\/bgp5bgms\n\nA replay of the conference call may be accessed by phone within seven days after the conclusion of the live call at the following numbers. To access the replay, please reference the Access code: 520002274#\n\nInternational: +61-2-8325-2405 United States: +1-646-982-0473 Hong Kong, China: +852-3027-6520 Mainland, China: +86-400-821-0623\n\nAbout CBAK Energy\n\nCBAK Energy Technology, Inc. is a leading high-tech enterprise in China engaged in the development, manufacturing, and sales of new energy high power lithium batteries and raw materials used for manufacturing high power lithium batteries. The applications of the Company's battery products and solutions include light electric vehicles, electric vehicles, electric tools, energy storage, uninterruptible power supply (UPS), and other high-power applications. In January 2006, CBAK Energy became the first lithium battery manufacturer in China listed on the Nasdaq Stock Market. CBAK Energy has multiple operating subsidiaries in Dalian, Nanjing and Shaoxing, as well as a large-scale R&D and production base in Dalian.\n\nFor more information, please visit www.cbak.com.cn.\n\nSafe Harbor Statement\n\nThis press release contains \"forward-looking statements\" that involve substantial risks and uncertainties. All statements other than statements of historical facts contained in this press release, including statements regarding our future results of operations and financial position, strategy and plans, and our expectations for future operations, are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. We have attempted to identify forward-looking statements by terminology including \"anticipates,\" \"believes,\" \"can,\" \"continue,\" \"could,\" \"estimates,\" \"expects,\" \"intends,\" \"may,\" \"plans,\" \"potential,\" \"predicts,\" \"should,\" or \"will\" or the negative of these terms or other comparable terminology. Our actual results may differ materially or perhaps significantly from those discussed herein, or implied by, these forward-looking statements. Any forward-looking statements contained in this press release are only estimates or predictions of future events based on information currently available to our management and management's current beliefs about the potential outcome of future events. Whether these future events will occur as management anticipates, whether we will achieve our business objectives, and whether our revenues, operating results, or financial condition will improve in future periods are subject to numerous risks.  There are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including: significant legal and operational risks associated with having substantially all of our business operations in China, the Chinese government may exercise significant oversight and discretion over the conduct of our business and may intervene in or influence our operations at any time, which could result in a material change in our operations and\/or the value of our securities or could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and could cause the value of such securities to significantly decline or be worthless, trading in our securities may be prohibited under the Holding Foreign Companies Accountable Act if the PCAOB determines our audit work is performed by auditors that the PCAOB is unable to inspect or investigate completely for three consecutive years, the effects of the global Covid-19 pandemic, changes in domestic and foreign laws, regulations and taxes, uncertainties related to China's legal system and economic, political and social events in China, the volatility of the securities markets; and other risks including, but not limited to, the ability of the Company to meet its contractual obligations, the uncertain market for the Company's lithium battery cells and business, macroeconomic, technological, regulatory, or other factors affecting the profitability of our products and solutions that we discussed or referred to in the Company's disclosure documents filed with the U.S. Securities and Exchange Commission (the \"SEC\") available on the SEC's website at www.sec.gov, including the Company's most recent Annual Report on Form 10-K as well as in our other reports filed or furnished from time to time with the SEC. You should read these factors and the other cautionary statements made in this press release. If one or more of these factors materialize, or if any underlying assumptions prove incorrect, our actual results, performance or achievements may vary materially from any future results, performance or achievements expressed or implied by these forward-looking statements. The forward-looking statements included in this press release are made as of the date of this press release and the Company undertakes no obligation to publicly update or revise any forward-looking statements, other than as required by applicable law.\n\nFor investor and media inquiries, please contact:\n\nIn China:\n\nCBAK Energy Technology, Inc.\r\nInvestor Relations Department\r\nMr. Thierry Jiewei Li\r\nPhone: 86-18675423231\r\nEmail: ir@cbak.com.cn\n\nThe Blueshirt Group\r\nMs. Feifei Shen\r\nPhone: +86 13466566136\r\nEmail: feifei@blueshirtgroup.com\n\nThe Blueshirt Group\r\nMs. Suwen Feng\r\nPhone: +86 13917110134\r\nEmail: suwen@blueshirtgroup.com\n\nIn the United States:\n\nThe Blueshirt Group\r\nMs. Julia Qian\r\nPhone: +1 973-619-3227\r\nEmail: Julia@blueshirtgroup.com\n\nRelated Links\r\nhttps:\/\/ir.cbak.com.cn\/\n\nCBAK Energy Technology, Inc. and Subsidiaries Unaudited Condensed Consolidated Balance Sheets (In $ except for number of shares) December 31, 2021 March 31, 2022 (Unaudited) Assets Current assets Cash and cash equivalents $ 7,357,875 $ 5,608,465 Pledged deposits 18,996,749 25,142,097 Trade accounts and bills receivable, net 49,907,129 50,265,784 Inventories 30,133,340 41,871,149 Prepayments and other receivables 12,746,990 14,516,068 Receivables from former subsidiary 2,263,955 1,134,585 Amount due from non-controlling interest, current 125,883 126,161 Amount due from related party, current 472,061 473,104 Income tax recoverable 47,189 47,295 Investment in sales-type lease, net 790,516 792,262 Total current assets 122,841,687 139,976,970 Property, plant and equipment, net 90,042,773 88,532,811 Construction in progress 27,343,092 28,410,293 Non-marketable equity securities 712,930 714,504 Prepaid land use rights 13,797,230 13,737,871 Intangible assets, net 1,961,739 1,834,351 Operating lease right-of-use assets, net 1,968,032 1,659,214 Investment in sales-type lease, net 838,528 714,933 Amount due from related party, non-current 62,941 63,081 Deferred tax assets, net 1,403,813 1,500,564 Goodwill 1,645,232 1,650,629 Total assets $ 262,617,997 $ 278,795,221 Liabilities Current liabilities Trade accounts and bills payable $ 65,376,212 $ 79,270,001 Short-term bank borrowings 8,811,820 14,674,721 Other short-term loans 4,679,122 746,699 Accrued expenses and other payables 22,963,700 24,477,309 Payables to former subsidiaries, net 326,507 325,624 Deferred government grants, current 3,834,481 2,270,463 Product warranty provisions 127,837 104,122 Warrants liability 5,846,000 4,214,000 Operating lease liability, current 801,797 711,034 Total current liabilities 112,767,476 126,793,973 Deferred government grants, non-current 6,189,196 7,207,728 Product warranty provisions 1,900,429 1,923,542 Operating lease liability, non-current 876,323 837,930 Total liabilities 121,733,424 136,763,173 Commitments and contingencies Shareholders' equity Common stock $0.001 par value; 500,000,000 \r\nauthorized; 88,849,222 issued and 88,705,016 \r\noutstanding as of December 31, 2021 and March \r\n31, 2022 88,849 88,849 Donated shares 14,101,689 14,101,689 Additional paid-in capital 241,946,362 241,981,141 Statutory reserves 1,230,511 1,230,511 Accumulated deficit (122,498,259) (122,053,806) Accumulated other comprehensive loss 2,489,017 2,880,201 137,358,169 138,228,585 Less: Treasury shares (4,066,610) (4,066,610) Total shareholders' equity 133,291,559 134,161,975 Non-controlling interests 7,593,014 7,870,073 Total equity 140,884,573 142,032,048 Total liabilities and shareholder's equity $ 262,617,997 $ 278,795,221\n\nCBAK Energy Technology, Inc. and Subsidiaries Unaudited Condensed Consolidated Statements of Operations and Comprehensive \r\nIncome (Loss) (In $ except for number of shares) Three months ended March 31, Note 2021 2022 Net revenues 25 $ 9,416,049 $ 80,196,298 Cost of revenues (7,576,620) (74,879,944) Gross profit 1,839,429 5,316,354 Operating expenses: Research and development expenses (483,749) (3,313,124) Sales and marketing expenses (213,142) (829,674) General and administrative expenses (1,324,481) (2,237,374) Recovery of (Provision for) doubtful accounts 4 154,061 (271,443) Total operating expenses (1,867,311) (6,651,615) Operating loss (27,882) (1,335,261) Finance (expenses) income, net (7,598) 5,014 Other income, net 1,217,648 285,204 Changes in fair value of warrants liability 28,426,000 1,632,000 Income before income tax 29,608,168 586,957 Income tax credit 18 - 93,546 Net income 29,608,168 680,503 Less: Net loss (income) attributable to non-controlling \r\ninterests 1,114 (236,050) Net income attributable to shareholders of CBAK \r\n Energy Technology, Inc. $ 29,609,282 $ 444,453 Net income 29,608,168 680,503 Other comprehensive income – Foreign currency translation adjustment 89,138 432,193 Comprehensive income 29,697,306 1,112,696 Less: Comprehensive loss (income) attributable to non-\r\n controlling interests 6,017 (277,059) Comprehensive income attributable to CBAK Energy \r\n Technology, Inc. $ 29,703,323 $ 835,637 Income per share 26 – Basic $ 0.35 $ 0.01 - Diluted $ 0.35 $ 0.01 Weighted average number of shares of common stock: 20 – Basic 84,283,605 88,713,841 – Diluted 84,933,913 88,734,957 Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/cbak-energy-reports-first-quarter-2022-unaudited-financial-results-301550849.html\n\nSOURCE CBAK Energy Technology, Inc.","link":"https:\/\/finance.yahoo.com\/news\/cbak-energy-reports-first-quarter-093000490.html","symbols":["CBAT.US"],"tags":["CBAK ENERGY","CBAK ENERGY TECHNOLOGY","CHINA","ENERGY TECHNOLOGY","INC","LITHIUM BATTERIES","LITHIUM BATTERY","NET INCOME","NET INCOME ATTRIBUTABLE"],"sentiment":{"polarity":0.999,"neg":0.032,"neu":0.859,"pos":0.11}},{"date":"2022-05-14T00:00:00+00:00","title":"Who Will Be King of the Road?","content":"Readers weigh in on Barron’s first transportation roundtable, Toyota, GM, and Tesla; also, the case for bonds and gold.","link":"https:\/\/finance.yahoo.com\/m\/da60d168-1372-3358-b9d2-04a06f55973e\/who-will-be-king-of-the-road%3F.html","symbols":["TM.US","TMCO34.SA","TMN.MX","TOM.F","TOMA.F","TOYOF.US"],"tags":["CARGO VEHICLES","COVER STORY","ELECTRIC VEHICLES","LITHIUM BATTERIES","PAUL FRANKLIN","TOYOTA","TRANSPORTATION AGENCIES","“THE FUTURE OF TRANSPORTATION"],"sentiment":{"polarity":0,"neg":0,"neu":1,"pos":0}},{"date":"2022-05-13T13:15:00+00:00","title":"CBAK Energy Obtains $29 Million Battery Order from European Customer","content":"DALIAN, China, May 13, 2022 \/PRNewswire\/ -- CBAK Energy Technology, Inc. (NASDAQ: CBAT) (\"CBAK Energy,\" or the \"Company\"), a leading lithium-ion battery manufacturer and electric energy solution provider in China, today announced that the Company has received an order from a leading European provider of heating, cooling and renewable energy systems (the \"Customer\"), for a supply of lithium-ion batteries worth EUR 28.2 million ($29.3 million).\n\nPursuant to the order, CBAK Energy will ship approximately 13.9 million units of batteries to the Customer. This will bring the total order value CBAK Energy has received from the Customer in 2022 to approximately EUR 31.2 million, for which the Company will deliver the products this year and next.\n\nThe Customer has a global presence with annual sales of billions of Euros. CBAK Energy has been collaborating with the Customer since 2020. In 2022, CBAK Energy is expected to deliver 9.9 million units of batteries to the Customer for estimated EUR 17.1 million.\n\nMr. Yunfei Li, Chief Executive Officer of CBAK Energy commented, \"We are very pleased to increase our supplies to this valued Customer and partner. We will continue to expand the global market for our reliable high power lithium batteries, which are well suited to a variety of applications.\"\n\nAbout CBAK Energy\n\nCBAK Energy Technology, Inc. is a leading high-tech enterprise in China engaged in the development, manufacturing, and sales of new energy high power lithium batteries. The applications of the Company's products and solutions include electric vehicles, light electric vehicles, electric tools, energy storage, uninterruptible power supply (UPS), and other high-power applications. In January 2006, CBAK Energy became the first lithium battery manufacturer in China listed on the Nasdaq Stock Market. CBAK Energy has multiple operating subsidiaries in Dalian and Nanjing, as well as a large-scale R&D and production base in Dalian.\n\nStory continues\n\nFor more information, please visit www.cbak.com.cn.\n\nSafe Harbor Statement\n\nThis press release contains \"forward-looking statements\" that involve substantial risks and uncertainties. All statements other than statements of historical facts contained in this press release, including statements regarding our future results of operations and financial position, strategy and plans, and our expectations for future operations, are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. We have attempted to identify forward-looking statements by terminology including \"anticipates,\" \"believes,\" \"can,\" \"continue,\" \"could,\" \"estimates,\" \"expects,\" \"intends,\" \"may,\" \"plans,\" \"potential,\" \"predicts,\" \"should,\" or \"will\" or the negative of these terms or other comparable terminology. Our actual results may differ materially or perhaps significantly from those discussed herein, or implied by, these forward-looking statements.\n\nAny forward-looking statements contained in this press release are only estimates or predictions of future events based on information currently available to our management and management's current beliefs about the potential outcome of future events. Whether these future events will occur as management anticipates, whether we will achieve our business objectives, and whether our revenues, operating results, or financial condition will improve in future periods are subject to numerous risks. There are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including: significant legal and operational risks associated with having substantially all of our business operations in China, the Chinese government may exercise significant oversight and discretion over the conduct of our business and may intervene in or influence our operations at any time, which could result in a material change in our operations and\/or the value of our securities or could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and could cause the value of such securities to significantly decline or be worthless, trading in our securities may be prohibited under the Holding Foreign Companies Accountable Act if the PCAOB subsequently determines our audit work is performed by auditors that the PCAOB is unable to inspect or investigate completely, the effects of the global Covid-19 pandemic, changes in domestic and foreign laws, regulations and taxes, uncertainties related to China's legal system and economic, political and social events in China, the volatility of the securities markets; and other risks including, but not limited to, the ability of the Company to meet its contractual obligations, the uncertain market for the Company's lithium battery cells and business, macroeconomic, technological, regulatory, or other factors affecting the profitability of battery cells designed for energy storage that we discussed or referred to in the Company's disclosure documents filed with the U.S. Securities and Exchange Commission (the \"SEC\") available on the SEC's website at www.sec.gov, including the Company's most recent Annual Report on Form 10-K as well as in our other reports filed or furnished from time to time with the SEC. You should read these factors and the other cautionary statements made in this press release. If one or more of these factors materialize, or if any underlying assumptions prove incorrect, our actual results, performance or achievements may vary materially from any future results, performance or achievements expressed or implied by these forward-looking statements. The forward-looking statements included in this press release are made as of the date of this press release and the Company undertakes no obligation to publicly update or revise any forward-looking statements, other than as required by applicable law.\n\nFor investor and media inquiries, please contact:\n\nIn China:\n\nCBAK Energy Technology, Inc.\r\nInvestor Relations Department\r\nMr. Thierry Jiewei Li\r\nPhone: 86-18675423231\r\nEmail: ir@cbak.com.cn\n\nThe Blueshirt Group\r\nMs. Feifei Shen\r\nPhone: +86 13466566136\r\nEmail: feifei@blueshirtgroup.com\n\nThe Blueshirt Group\r\nMs. Suwen Feng\r\nPhone: +86 13917110134\r\nEmail: suwen@blueshirtgroup.com\n\nIn the United States:\n\nThe Blueshirt Group\r\nMs. Julia Qian\r\nPhone: +1 973-619-3227\r\nEmail: Julia@blueshirtgroup.com\n\nRelated Links\r\nhttps:\/\/ir.cbak.com.cn\/ Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/cbak-energy-obtains-29-million-battery-order-from-european-customer-301546959.html\n\nSOURCE CBAK Energy Technology, Inc.","link":"https:\/\/finance.yahoo.com\/news\/cbak-energy-obtains-29-million-131500679.html","symbols":["CBAT.US"],"tags":["BATTERY MANUFACTURER","CBAK ENERGY","LITHIUM BATTERIES","RENEWABLE ENERGY SYSTEMS","VALUED CUSTOMER"],"sentiment":{"polarity":0.994,"neg":0.019,"neu":0.881,"pos":0.099}},{"date":"2022-05-11T14:23:20+00:00","title":"I’m Sorry, But Mullen Automotive Makes Little Sense","content":"In a business world dominated by toxic positivity, it’s dangerous for anyone to publicly criticize an investment, even one as flawed as electric vehicle (EV) manufacturer Mullen Automotive (NASDAQ:MULN). Although it has noble aspirations — to deliver attractive, high-performance EVs armed with groundbreaking solid-state batteries (SSBs) — almost everyone has big dreams. It’s executing the vision that separates the viable from the also-rans, which is why you should steer clear of MULN stock.\n\nOutside of its snazzy marketing literature, nothing really stands out to suggest that Mullen is a credible EV disrupter. InvestorPlace contributor Will Ashworth said it best when he compared the financial outlays that the company made relative to its peers. “Mullen spent just $3.1 million on research and development in 2021, just 2% of what QuantumScape (NYSE:QS), a leading developer of solid-state lithium batteries, spent. Yet, Mullen’s market capitalization is almost 6% of QuantumScape’s $5.06 billion valuation.”\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nTherefore, if you’re bullish on MULN stock, you’ve got to suspend disbelief and assume that with far fewer research and development dollars — and with arguably lower engineering acumen — that Mullen can nevertheless beat its far better capitalized and established rivals. Granted, it’s not an impossible circumstance, but I would consider it highly improbable.\n\n7 Great Growth Stocks to Buy in May\n\nBut it’s not just about raw spending power — or lack thereof — that worries me about MULN stock. There’s the other component that advanced, potentially game-changing technologies like SSBs require time to finetune their nuances and complexities. For instance, recent research suggests that SSBs may not be necessarily safer than their conventional lithium-ion counterparts. Such findings, if proven legitimate, could negate one of the key benefits of SSB integration.\n\nStory continues\n\nAside from this enormous challenge, Mullen would also have to overcome the unique struggles associated with the automotive supply chain disruption. Combined with inflationary pressures, the price of EVs have continued to swing higher and higher, far outside the reach of median-income households. Should Mullen be forced to compete in the premium space, it then faces the prospect of going up against heavy hitters like Tesla (NASDAQ:TSLA) and Lucid (NASDAQ:LCID).\n\nWith so many question marks surrounding Mullen, it’s best to sit on the sidelines regarding MULN stock. It has little going right for it and way more things that can go wrong.\n\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMore From InvestorPlace\n\nStock Prodigy Who Found NIO at $2… Says Buy THIS It doesn’t matter if you have $500 in savings or $5 million. Do this now.  Get in Now on Tiny $3 ‘Forever Battery’ Stock Early Bitcoin Millionaire Reveals His Next Big Crypto Trade “On Air”\n\nThe post Iâ&#128;&#153;m Sorry, But Mullen Automotive Makes Little Sense appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/m-sorry-mullen-automotive-makes-142320941.html","symbols":["LCID.US","MULN.US","QS.US","TSLA.US"],"tags":["LITHIUM BATTERIES","MULLEN AUTOMOTIVE"],"sentiment":{"polarity":0.935,"neg":0.07,"neu":0.833,"pos":0.097}},{"date":"2022-05-09T08:33:00+00:00","title":"Global Supercapacitors Market Trajectory &amp; Analytics Report 2022: Search for Efficient Energy Storage Solutions Beyond the Conventional Battery Brings Supercapacitors into the Spotlight","content":"Dublin, May  09, 2022  (GLOBE NEWSWIRE) -- The \"Supercapacitors - Global Market Trajectory & Analytics\" report has been added to ResearchAndMarkets.com's offering.\n\nAmid the COVID-19 crisis, the global market for Supercapacitors is projected to reach US$3.4 Billion by 2024, registering a compounded annual growth rate (CAGR) of 19.3% over the analysis period. China represents the largest regional market for Supercapacitors, accounting for an estimated 22.6% share of the global total. The market is projected to reach US$1.2 Billion by the end of the analysis period. China is expected to spearhead growth and emerge as the fastest growing regional market with a CAGR of 24.2% over the analysis period.\n\nSupercapacitors, also known as Ultracapacitors are gaining in prominence as an attractive alternate technology capable of overthrowing the shortfalls and performance gap of conventional batteries. Years of refining technology innovation have helped supercapacitors progress steadily towards achieving successful commercialization in key end-use industries, such as, energy, automobiles, medical devices and consumer electronics.\n\nThis alternative energy storage technology which was hitherto bogged down by a high cost structure and complexities in manufacturing, today stands at the vanguard of an era of practical usage.\n\nAlthough continuous technology innovations are helping increase the safety and capability of supercapacitors, the technology is not expected to completely replace batteries which still continue to have cost and size advantages. Lithium ion batteries have higher energy densities over 20 times higher when compared to a superconductor and are capable of storing 30 times more energy than their weight. In comparison, supercapacitors have very high power density which means energy can be released rapidly in powerful bursts and can be charged quickly. Combining both the technologies into a hybrid technology is gaining in prominence.\n\nA hybrid supercapacitor\/battery configuration is considered to be an ideal solution for applications with high power demands, as they benefit from both high power density feature of supercapacitors and superior energy storage capability of battery. Supercapacitors will remain a supplementary technology to batteries and engines that run on fuels in most applications - for example electric vehicles that need short bursts of power for acceleration. Although standalone use of supercapacitors in automobiles is still not a widespread practice, the numerous advantages offered, such as, its ecological benignity, higher energy conservation through efficient exploitation of existing power sources, superior conductivity, and physical and chemical stability, among others, promise a robust future in store.\n\nNevertheless, complete replacement will be seen in certain applications such as offshore wind turbines, where the technology is aptly suited for providing short bursts of power needed to adjust turbine blades in changing wind conditions; and hybrid buses where supercapacitors can completely replace batteries given their ability to quickly capture energy from regenerative braking systems and discharge the power for ignition. In the energy industry, renewable energy sources are especially characterized by variable power supply, requiring the use of supercapacitors, which flaunt superior power density, and the ability to facilitate 'load leveling' of power, thereby ensuring stable supply of power.\r\n\r\nThe technology`s quick response time makes them highly desirable for static condenser (STATCON), and dynamic voltage regulator (DVR) applications, since power can be rapidly absorbed or injected to help reduce voltage fluctuations. Strong potential lies in store for the use of supercapacitors in renewable energy production, given the indelible mark being made by renewable energy across the globe, and ensuing spotlight being shed on environment friendly energy storage technologies. The unmet energy storage needs opens up opportunities for alternative energy storage solutions such as flywheels, fuel cell and superconducting magnetic energy storage (SMES) in addition to supercapacitors. Supercapacitors especially as efficient energy storage technology aims to replace the battery technology in the long term.\r\n\r\nSelect Competitors-\n\nAVX Corp.CAP-XX LimitedEaton Corporation plcELNALoxus Inc.KORCHIPMaxwell Technologies Inc.Nippon Chemi-ConPanasonicSeiko Instruments Inc.Shanghai Aowei Technology Development Co. Ltd.Shenzhen Topmay ElectronicTOKIN\n\nKey Topics Covered:\r\n\r\n1. MARKET OVERVIEW\n\nSearch for Efficient Energy Storage Solutions Beyond the Conventional Battery Brings Supercapacitors into the SpotlightSupercapacitors - Global Key Competitors Percentage Market Share in 2022 (E)Competitive Market Presence - Strong\/Active\/Niche\/Trivial for 57 Players Worldwide in 2022 (E)\n\n2. FOCUS ON SELECT PLAYERS\n\n3. MARKET TRENDS & DRIVERS\n\nGrowing Importance of Backup Power Drives Demand for Supercapacitors in UPSLost Economic Value Due to Power Outages Pushes Up the Monetary Value of Electricity Reliability & the Significance of Supercapacitors in Offering Backup Power: Value Lost Due to Electrical Outages as a % of Sales of Affected FirmsAutomobile \"Electronification\"& Push Towards Commercializing EVs & HEVs Drive Focus on SupercapacitorsRise of Microgrids & Increased Integration of Renewable Energy in the Energy Mix Pushes Up the Importance of Efficient Energy Storage SolutionsSupercapacitors Find Use as Resiliency Enhancers in MicrogridsDevelopment of Newer Materials to Accelerate Commercialization of SupercapacitorsHybridization of Combustion Engines in Heavy Industrial Machinery & Industrial Automation to Spur Adoption of SupercapacitorsRising Renewable Energy Investments Drive Parallel Demand for Storage Solutions that Address Grid Stability & Power Quality IssuesSupercapacitors Step In to Replace Chemical Batteries in Solar Energy InfrastructureSupercapacitors Gain Traction in Pitch Control Applications in Wind Energy FacilitiesA Robust Consumer Electronics Industry Favors Complementary Integration of Supercapacitors With BatteriesRising Demand for Consumer Electronics amid Expanding Internet User Base & Consumer Appetite for Digital Media Spells OpportunitiesSmart Home: Major Opportunity for Consumer Grade SupercapacitorsSearch for Superior Alternatives to Batteries Drives Applications of Supercapacitors in Medical ImplantsThe Rise of Electronic Wearables Brings New Foldable, Flexible Supercapacitors Into the Spotlight\n\n4. GLOBAL MARKET PERSPECTIVE\n\nFor more information about this report visit https:\/\/www.researchandmarkets.com\/r\/e9ofos\n\nAbout ResearchAndMarkets.com\r\nResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends.","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/05\/09\/2438270\/28124\/en\/Global-Supercapacitors-Market-Trajectory-Analytics-Report-2022-Search-for-Efficient-Energy-Storage-Solutions-Beyond-the-Conventional-Battery-Brings-Supercapacitors-into-the-Spotlig.html","symbols":[],"tags":["BATTERY TECHNOLOGY","LI ION BATTERIES","LITHIUM BATTERIES","LITHIUM BATTERY","LITHIUM ION BATTERIES","LITHIUM ION BATTERY","RESEARCH ANALYSIS AND REPORTS","RESEARCH AND MARKETS","SUPERCAPACITOR"],"sentiment":{"polarity":0.999,"neg":0.016,"neu":0.784,"pos":0.2}},{"date":"2022-04-28T16:11:23+00:00","title":"10 Best Lithium Stocks To Buy Now","content":"In this article, we will look at 10 best lithium stocks to buy now. If you want to skip reading about how and why lithium prices are skyrocketing, you can go directly to 5 Best Lithium Stock To Buy Now.\n\nLithium prices are rallying during the EV boom. As concerns about climate change and global warming alarm governments to take action, and the global economy transitions to electrified transport and abandons combustion engines, the demand for lithium is bound to skyrocket. The biggest industrial application of lithium as of now is its use in powertrains of electric vehicles. Every big player in the automobile manufacturing industry has announced its plans to go all-electric at some point in the future, with some targeting achieving net-zero carbon emissions by 2035, and others planning all-electric fleets by 2050. Lithium manufacturers and miners are looking at lucrative days ahead, as the demand for lithium grows catalyzed by global EV adoption.\n\nGlobal EV Adoption\n\nAccording to Statista, even though a semiconductor shortage resulted in a rough year for the automobile industry in 2021, global electric vehicle sales saw a two-fold increase compared to 2020, peaking at 6.6 million up from 3 million. According to the EV volumes data, cited by the International Energy Agency, all net growth in global car sales in 2021 can be attributed to EVs. China was leading in 2021 having almost tripled electric car sales from 1.2 to 3.4 million. Europe was the runner-up region that reported new car registrations up by 70% from 2020, hitting 2.3 million, roughly half of which had electric powertrains. For the first time in history, new car sales crossed 1 million in the United States, and more than half of which were electric cars.\n\nStrong Demand For Lithium Ahead\n\nAccording to S&P Global Commodity Insights, the demand for lithium is expected to further strengthen in 2022. S&P Global Platts data shows that seaborne lithium carbonate prices went up by 413% in 2021 and hit $32,600 per metric ton last December. Lithium hydroxide prices gained 254% over the same period to reach $31,900 per metric ton. Lithium chemical supply is expected to hit 636,000 metric tons, up from roughly 497,000 metric tons in 2021. The demand for lithium is forecasted to grow to 641,000 metric tons of lithium carbonate equivalent in 2022, up from 504,000 metric tons in 2021. This creates a deficit of 5,000 metric tons, down from a deficit of 8,000 metric tons in 2021, and according to S&P Global Market Intelligence, this deficit is expected to drive lithium prices to record highs in 2022.\n\nStory continues\n\nSoaring lithium prices have resulted in EV manufacturers pondering about creating their own lithium power plants. This April, a tweet highlighted the exponential growth of the price of lithium from $4,450 per tonne in 2012 to $78,032 per tonne as of April 2022. Shortly after, Elon Musk, the CEO of Tesla, Inc. (NASDAQ:TSLA), was reported to be talking about exploring opportunities for Tesla, Inc. (NASDAQ:TSLA) to get into mining and refining lithium on its own unless prices for the commodity relax.\n\nProminent names in the lithium industry include Rio Tinto Group (NYSE:RIO), QuantumScape Corporation (NYSE:QS), and Albemarle Corporation (NYSE:ALB).\n\nOur Methodology\n\nTo determine the 10 best lithium stocks to buy now we looked for companies that are continually making progress with expansions of their facilities and are racing to become the go-to suppliers for major EV companies. We included the analyst and investor sentiment for each stock mentioned. The hedge fund sentiment was calculated using Insider Monkey's database, which as of the fourth quarter of 2021 tracks 924 elite hedge funds. We have ranked these stocks in an increasing number of hedge fund holders.\n\nWith this context in mind, let's look at the 10 best lithium stocks to buy now.\n\n10 Best Lithium Stocks To Buy Now\n\n10. Sigma Lithium Corporation (NASDAQ:SGML)\n\nNumber of Hedge Fund Holders: 3\n\nSigma Lithium Corporation (NASDAQ:SGML) operates as a mining company headquartered in Canada. The company is involved in the development of hard rock lithium deposits in the Americas and aims to become a leading cost-effective supplier of lithium batteries for the EV industry. Last December, Sigma Lithium Corporation (NASDAQ:SGML) commenced on-site construction to build the foundation and infrastructure installation of its production plant, at the company's Grota do Cirilo project.\n\nSigma Lithium Corporation (NASDAQ:SGML) is a compelling lithium stock to buy now as it has increasing momentum and bullish analyst and investor sentiment. As of April 26, the stock has gained an astounding 270.94% over the past twelve months. Moreover, this April, Canaccord analyst Katie Lachapelle raised her price target on Sigma Lithium Corporation (NASDAQ:SGML) to Canadian $25 from Canadian $24 and maintained a Speculative Buy rating on the shares.\n\nHedge funds are upping their stakes in Sigma Lithium Corporation (NASDAQ:SGML). Insider Monkey found that by the end of Q4 2021, Sigma Lithium Corporation (NASDAQ:SGML) was a part of 3 hedge fund portfolios that held collective stakes of $11.77 million in the company. Of these Waratah Capital Advisors was the most prominent shareholder. This is compared to 2 positions in the third quarter of 2021 with stakes worth $8.47 million. The hedge fund sentiment for the stock is positive.\n\nLike Rio Tinto Group (NYSE:RIO), QuantumScape Corporation (NYSE:QS), Albemarle Corporation (NYSE:ALB), and Tesla, Inc. (NASDAQ:TSLA), Sigma Lithium Corporation (NASDAQ:SGML) is making efforts to expand its lithium facilities and is becoming a prominent name in the space.\n\n9. CBAK Energy Technology, Inc. (NASDAQ:CBAT)\n\nNumber of Hedge Fund Holders: 5\n\nCBAK Energy Technology, Inc. (NASDAQ:CBAT) manufactures and sells lithium batteries in Mainland China, the United States, Korea, Europe, and internationally. Last November, the company announced that it has commenced operations at its lithium power plants in Nanjing and Dalian. The company aims to address the growing demand for lithium batteries in the electric vehicle and energy storage sectors and is poised to grow in the near term as the world goes through an electric vehicle boom.\n\nOn April 14, 2022, CBAK Energy Technology, Inc. (NASDAQ:CBAT) reported earnings for the fiscal fourth quarter of 2021. The company reported earnings per share of $0.10 which equates to a net income of $61.5 million and generated revenues of $27.8 million, up 80.5% year over year from $15.4 million in Q3 2021.\n\nHedge funds are upping their stakes in CBAK Energy Technology, Inc. (NASDAQ:CBAT). At the close of Q4 2021, 5 hedge funds held long positions in CBAK Energy Technology, Inc. (NASDAQ:CBAT). The total stakes of these funds came to $3.6 million, up from $2.2 million in the previous quarter with 6 positions.\n\nCBAK Energy Technology, Inc. (NASDAQ:CBAT) is one of the best lithium stocks to buy now. Other companies that are working on expanding their lithium operations include Rio Tinto Group (NYSE:RIO), QuantumScape Corporation (NYSE:QS), Albemarle Corporation (NYSE:ALB), and Tesla, Inc. (NASDAQ:TSLA).\n\n8. Standard Lithium Ltd. (NYSE:SLI)\n\nNumber of Hedge Fund Holders: 9\n\nStandard Lithium Ltd. (NYSE:SLI) explores for, develops, and processes lithium brine properties in the United States. Its flagship project is the Lanxess project with approximately 150,000 acres of brine leases located in southwestern Arkansas.\n\nOn February 24, Standard Lithium Ltd. (NYSE:SLI) announced that it has reached an agreement with LANXESS Corporation to accelerate the development of the first commercial lithium project in Arkansas, which will be constructed at the Lanxess facility in El Dorado. Standard Lithium Ltd. (NYSE:SLI) will control all development of the project leading up to and including the completion of the Front End Engineering Design study. Under the terms of the agreement, a minimum of 51% of equity will be granted to Standard Lithium Ltd. (NYSE:SLI) and the company may retain as much as 100% interest in the project.\n\nThis March, Stifel analyst Cole McGill resumed coverage of Standard Lithium Ltd. (NYSE:SLI) with a Buy rating and a Canadian $13 price target on the shares. The analyst believes that the company is well-positioned to benefit from the recent government policies that encourage domestic sourcing of critical minerals. Moreover, Standard Lithium Ltd. (NYSE:SLI) is experiencing bullish trading volumes and as of April 26, the stock's trailing-twelve-month returns are up 93.99%.\n\nStandard Lithium Ltd. (NYSE:SLI) is attracting bullish views from analysts and investors alike, which makes it rank among the best lithium stocks to buy now. Insider Monkey found that at the close of Q4 2021, 9 hedge funds were long Standard Lithium Ltd. (NYSE:SLI) with combined stakes of $12.97 million. This is compared to 5 positions in the previous quarter with stakes of $10.97 million.\n\n7. Piedmont Lithium Inc. (NASDAQ:PLL)\n\nNumber of Hedge Fund Holders: 9\n\nPiedmont Lithium Inc. (NASDAQ:PLL) operates as an exploration stage company and is involved in the exploration and development of resource projects in the United States. The company's flagship project is the Carolina Lithium Project which spans an area of roughly 3,116 acres located in North Carolina. The stock is ranked high among the 10 best lithium stocks to buy now because of its activity in the space, and its bullish trading volume. As of April 26, the stock's year-to-date returns are up 26.91% and the company boasts a market value of $1.23 billion.\n\nThe company plans on expanding its production capacity to over 60,000 metric tons of battery-grade lithium hydroxide per year, and on March 9, Piedmont Lithium Inc. (NASDAQ:PLL) completed its Preliminary Economic Assessment for its second lithium hydroxide plant in the United States. The PEA assumes a 30-year life of operations with a production capacity of 30,000 metric tons of battery-grade lithium hydroxide per year.\n\nThis March, JPMorgan analyst Tyler Langton raised his price target on Piedmont Lithium Inc. (NASDAQ:PLL) to $92 from $84 and maintained an Overweight rating on the shares. The analyst said that Piedmont Lithium Inc. (NASDAQ:PLL) is bound to see increased cash flows next year as its projects take off production. This makes Piedmont Lithium Inc. (NASDAQ:PLL) a cost-effective lithium producer in North American markets and a compelling vendor for electric vehicle companies.\n\nAccording to Insider Monkey's database, 9 hedge funds held long positions in Piedmont Lithium Inc.(NASDAQ:PLL) at the end of the fourth quarter of 2021. The total stakes of these funds were valued at $12.06 million. This is compared to 6 positions in the previous quarter with stakes worth $16.93 million.\n\n6. Lithium Americas Corp. (NYSE:LAC)\n\nNumber of Hedge Fund Holders: 19\n\nLithium Americas Corp. (NYSE:LAC) operates as a resource company in the United States and Argentina and explores lithium deposits. The company aims to become a leading supplier for the domestic battery and EV industries and is making unparalleled efforts. This April, the company announced that it has filed for a Department of Energy loan to fund its wholly-owned Thacker Pass lithium project in Nevada. With this, Lithium Americas Corp. (NYSE:LAC) is well-positioned to establish a local lithium supply chain to support the production of electric vehicles in the U.S.\n\nOn April 5, Deutsche Bank analyst Corinne Blanchard raised her price target on Lithium Americas Corp. (NYSE:LAC) to $40 from $34 and maintained a Buy rating on the shares. Blanchard noted that lithium manufacturers and miners are poised to grow as we move into the second quarter and the prices for the commodity increase throughout the year. As of April 25, Lithium Americas Corp. (NYSE:LAC) has gained 77.45% over the past twelve months, making it a high-moment lithium stock to buy now.\n\nLithium Americas Corp. (NYSE:LAC) was spotted on 19 hedge fund portfolios at the end of the fourth quarter of 2021. The total stakes of these funds in the company exceeded $184.84 million, up from $94.15 million in the previous quarter with 12 positions. The investor sentiment for the stock is positive.\n\nHimension Capital was the most prominent shareholder in Lithium Americas Corp. (NYSE:LAC) at the end of the fourth quarter of 2021. According to Insider Monkey, as of December 31, Himension Capital owns more than 2.34 million shares of stock which equate to a stake value of $68.33 million, representing 5.22% of Himension Capital's 13F portfolio.\n\nClick to continue reading and see 5 Best Lithium Stocks To Buy Now.\n\nSuggested Articles:\n\n11 Best Lithium and Battery Stocks To Buy 15 Biggest Lithium Mining Companies In The World 10 Best Lithium and Phosphate Stock to Buy Now\n\nDisclosure. None. 10 Best Lithium Stocks To Buy Now is originally published on Insider Monkey.","link":"https:\/\/finance.yahoo.com\/news\/10-best-lithium-stocks-buy-161123234.html","symbols":["ALB.US","CBAT.US","CRA1.F","LAC.TO","LAC.US","LTUM.US","PLL.AU","PLL.US","QS.US","RIO.AU","RIO.LSE","RIO.US"],"tags":["ALBEMARLE CORPORATION","CBAK ENERGY TECHNOLOGY","INC","LITHIUM BATTERIES","LITHIUM CARBONATE","LITHIUM CORPORATION","LITHIUM HYDROXIDE","LITHIUM STOCKS","SIGMA LITHIUM CORPORATION"],"sentiment":{"polarity":1,"neg":0.014,"neu":0.881,"pos":0.105}},{"date":"2022-04-26T18:15:00+00:00","title":"LICY Shareholder Update: Robbins LLP Reminds Investors of Class Action Against Li-Cycle Holdings Corp. (LICY) f\/k\/a Peridot Acquisition Corp. (PDAC)","content":"SAN DIEGO, April  26, 2022  (GLOBE NEWSWIRE) --\n\nThe Class: Shareholder rights law firm Robbins LLP reminds investors that a shareholder filed a class action on behalf of all persons and entities that purchased or otherwise acquired Li-Cycle Holdings Corp. (NYSE: LICY) securities between February 16, 2021 and March 23, 2022, for violations of the Securities Exchange Act of 1934. Li-Cycle purports to be an industry leader in lithium-ion battery resource recovery and the leading lithium-ion battery recycler in North America.\n\nIf you would like more information about Li-Cycle Holdings Corp.'s misconduct, click here.\n\nWhat is this Case About: Li-Cycle Holdings Corp. (LICY) Failed to Disclose its Business Failings to Investors\n\nAccording to the complaint, Li-Cycle merged with Peridot Acquisition Corp., a special purpose acquisition company, on August 10, 2021. During the class period, defendants touted Li-Cycle's patented technology and noted that the merger would enable Li-Cycle \"to fully fund its planned global expansion.\" However, defendants failed to disclose that Li-Cycle's largest customer was merely a broker providing working capital financial to the Company while trying to sell the product to end customers. Further, Li-Cycle engaged in questionable related party transactions. With regard to accounting, the Company gave a false impression of growth, reported revenues derived by marking up receivables on unsold products, and concealed that the Company would need an additional $1 billion to support planned growth.\n\nThe truth came to light on March 24, 2022, when market researcher Blue Orca Capital released a report describing the Company as \"a near fatal combination of stock promotion, laughable governance, a broker business hemorrhaging cash, and highly questionable Ernon-like accounting\" and detailing the Company's failings. On this news, Li-Cycle's shares fell approximately 5.6%, to close at $7.93 per share on March 24, 2022.\n\nNext Steps: If you acquired shares of Li-Cycle Holdings Corp. (LICY) between February 16, 2021 and March 23, 2022, you have until June 20,2022, to ask the court to appoint you lead plaintiff for the class. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. You do not have to participate in the case to be eligible for a recovery.\n\nAll representation is on a contingency fee basis. Shareholders pay no fees or expenses.\n\nContact us to learn more:\n\nAaron Dumas\r\n(800) 350-6003\r\nadumas@robbinsllp.com\r\nShareholder Information Form\n\nAbout Robbins LLP: A recognized leader in shareholder rights litigation, the attorneys and staff of Robbins LLP have been dedicated to helping shareholders recover losses, improve corporate governance structures, and hold company executives accountable for their wrongdoing since 2002. To be notified if a class action against Li-Cycle Holdings Corp. settles or to receive free alerts when corporate executives engage in wrongdoing, sign up for Stock Watch today.\n\nAttorney Advertising. Past results do not guarantee a similar outcome.\n\nContact:\r\nAaron Dumas \r\nRobbins LLP\r\n5040 Shoreham Place\r\nSan Diego, CA 92122\r\nadumas@robbinsllp.com\r\n(800) 350-6003\r\nwww.robbinsllp.com\n\nhttps:\/\/www.facebook.com\/RobbinsLLP\/\n\nhttps:\/\/www.linkedin.com\/company\/robbins-llp\/","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/04\/26\/2429545\/32719\/en\/LICY-Shareholder-Update-Robbins-LLP-Reminds-Investors-of-Class-Action-Against-Li-Cycle-Holdings-Corp-LICY-f-k-a-Peridot-Acquisition-Corp-PDAC.html","symbols":["LICY.US"],"tags":["$LICY","$LICY CLASS ACTION","$LICY INVESTOR RIGHTS","CLASS ACTION","COMPANY ANNOUNCEMENT","LI-CYCLE HOLDINGS","LITHIUM BATTERY","PERIDOT ACQUISITION CORP","RECYCLING","ROBBINS LLP"],"sentiment":{"polarity":0.882,"neg":0.075,"neu":0.827,"pos":0.098}},{"date":"2022-04-25T08:43:00+00:00","title":"Global EV Vehicle Company Solid State Batteries Market Report 2022: Market to Grow at a CAGR of 147.8% from 2021 to 2028","content":"Dublin, April  25, 2022  (GLOBE NEWSWIRE) -- The \"EV Vehicle Company Solid State Batteries Market Shares, Strategy, and Forecasts, Worldwide, 2022 to 2028\" report from Wintergreen Research, Inc has been added to ResearchAndMarkets.com's offering. \r\n\r\nEV Vehicle Company Hybrid Solid-State Batteries represent the next generation automation of EVs and home and campus electricity storage, a market in line for significant growth. It is expected to grow at a compound annual growth rate (CAGR) of 147.8% from 2021 to 2028. \r\n\r\nNext generation car companies will sell energy storage systems alongside vehicles. Rising demand for solidstate batteries among end-use sectors along with the rising research and development activities are focused on commercializing the battery. Lower costs for solid state batteries are expected to propel market growth. EVs represent a primary market. \r\n\r\nThe electrical solid state battery energy industry will reshape the future. The integrated business model of storage is becoming an application for energy consumption.\n\nAmid a greater industry focus on battery technology, automakers with EVs in their lineups are scrambling to position themselves for the arrival of solid-state battery cells soon. As EV sales increase driven by tighter regulation of carbon emissions, solid-state battery makers become indispensable for the renewable energy. \r\n\r\nKey Topics Covered:\r\n\r\n1. Hybrid Solid-State Battery Market Definition and Market Dynamics\r\n1.1 EVs with Hybrid Solid State Battery Chemistries\r\n1.2 Batteries with Solid-State Electrolytes Inherently Safer\r\n1.2.1 Hybrid Solid-State Battery Is a Cell Without Any Liquid or Gel Electrolytes \r\n1.3 Electric Vehicles to Use Solid-State Batteries\r\n\r\n2. Solid State Battery Market Shares and Forecasts\r\n2.1 Solid-State Battery Market Driving Forces\r\n2.1.1 Advantages of Solid-State Batteries\r\n2.1.1 Disadvantages of Lithium-ion Batteries\r\n2.2 Solid State Battery Market Shares\r\n2.3 Solid State Battery Market Forecasts\r\n2.4 Solid State Battery Market Segments\r\n2.4.1 Global Solid State Battery Market\r\n2.5 Solid State Battery Regional Analysis\r\n\r\n3. Solid State Battery Product Developments\r\n3.1 Companies Embrace Renewable Energy\r\n3.1.1 Anheuser-Busch\r\n3.2 New 4680 Tesla Batteries Vs. Solid-State Batteries\r\n3.3 Ship Filled with Porsches and Bentleys Has Lithium Batteries Catch Fire\r\n3.3.1 Ship Fire\r\n3.4 Using Light with Batteries\r\n\r\n4. Solid State Battery Research and Technology\r\n4.1 Silicon Battery Technology\r\n4.1.1 Silicon Nanowire\r\n4.2 Samsung Develops Solid-State Cell with Silver\/LG Researchers Eliminate Carbon and Binders from The Anode\r\n4.3 Amprius Silicon Nanowire Batteries\r\n4.4 ProLogium Core Technologies Ceramic SSBs\r\n4.5 Bollore Group\r\n4.6 Materials for Use as Solid Electrolytes\r\n4.7 Solid Power Solid State Battery Technology\r\n4.8 Japan's Tohoku University Hydride Lithium Superionic Conductor 4.8.1 Complex Hydrides\r\n4.9 Amprius Technologies Stores Lithium in Tiny Silicon Nanowires\r\n4.10 BMW Lithium Metal Battery\r\n4.11 Quantum scope Solid State battery\r\n4.12 Comparing Separator Materials\r\n\r\n5. Solid State Battery Company, University, and Government Agency Profiles\r\n5.1 Apple\r\n5.1.1 Apple, Samsung Electronics, Geely, Hyundai Motor\/Lishen\r\n5.2 Bollore\r\n5.2.1 Bollore Group Revenue\r\n5.2.2 Bollore BlueCar\r\n5.2.3 Autolib Blue Solutions\r\n5.2.4 Blue Solutions Solid State Battery Development\r\n5.2.5 Bollore Solid State Battery Production Capacity\r\n5.2.6 Autolib Red Car Solutions\r\n5.2.7 Bollore Energy Storage Ringo Project by RTE\r\n5.3 BMW\r\n5.4 Northvolt\r\n5.5 Enovate\r\n5.6 Ford\r\n5.7 General Motors Collaborating with LG Energy Solution on Solid State Batteries\r\n5.7.1 GM Ultium Lithium-Ion Battery\r\n5.8 Honda\r\n5.9 Hyundai\r\n5.10 Ilika 5.11 Mercedes-Benz\r\n5.11.1 Factorial Energy\r\n5.11.2 Factorial's new Solid-State EV Battery\r\n5.12 Mobis Energy\r\n5.13 Mullen Automotive\r\n5.14 Nissan\r\n5.15 Sony\r\n5.16 Schneider Electric\r\n5.16.1 Schneider Electric Positions to Implement Electrification of Society At Large\r\n5.17 Tesla\r\n5.17.1 Tesla Canada Industrial Research Chair, Canada Research Chair, Dalhousie University\r\n5.17.2 Tesla\/Toyota\/Nissan\/Honda\/Panasonic\r\n5.18 Toyota\r\n5.19 Volkswagen Group\r\n5.20 Volkswagen Group\/QuantumScape\n\nFor more information about this report visit https:\/\/www.researchandmarkets.com\/r\/gh28a4","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/04\/25\/2427832\/28124\/en\/Global-EV-Vehicle-Company-Solid-State-Batteries-Market-Report-2022-Market-to-Grow-at-a-CAGR-of-147-8-from-2021-to-2028.html","symbols":[],"tags":["EV","LITHIUM BATTERY","LITHIUM ION BATTERIES","LITHIUM ION BATTERY","RESEARCH ANALYSIS AND REPORTS","RESEARCH AND MARKETS","SION","SOLID STATE BATTERIES","SOLID STATE BATTERY","TESLA","UPS"],"sentiment":{"polarity":0.995,"neg":0.018,"neu":0.838,"pos":0.144}},{"date":"2022-04-24T14:04:00+00:00","title":"Electric vehicle demand spurs ‘white gold’ rush at California's largest lake","content":"The Salton Sea, California's largest lake, is best known for increasing salinity and receding shoreline over the course of multiple decades that led to the health crisis and a massive die-off of the area's wildlife.\n\nThat is changing as a White House push to rid cars of fossil fuels and a global hunt to source critical minerals for electric vehicle batteries is recasting the region 160 miles southeast of Los Angeles as an El Dorado for the country’s hopes to tackle climate change.\n\n“This is a very defined boundary, very defined field, and so you can put a well down anywhere within the field and you know, strike white gold, if you want to call it that,” Rod Colwell, CEO of Controlled Thermal Resources (CTR), an Australian mining firm developing a geothermal power plant with a lithium mining plant on site, told Yahoo Finance. “The lithium resource would be the largest on the planet, fully developed… so it’s a very, very unique resource.” Drilling has begun at Australian company Controlled Thermal Resources' geothermal energy and lithium plant on the south side of the Salton Sea on November 9, 2021 in Calipatria, California. (Gina Ferazzi \/ Los Angeles Times via Getty Images)\n\nColwell said the region, which California Governor Gavin Newsom has dubbed the “Saudi Arabia of Lithium,” has such an abundance of the resource that it can source enough “white gold” to be used in every electric vehicle manufactured in the U.S. and still have enough saved up to export abroad.\n\nLithium is critical for accelerating the transition to low-emission vehicles as the average electric car battery requires roughly 8-10kg of the metal. Growing demand has already sent the price of lithium skyrocketing nearly five-fold over the last year from $17,000 a ton to roughly $80,000. And global demand is projected to grow by 40 times in the next 20 years, according to the IEA, with a bulk of that supply coming from China.\n\nPrice of lithium has gone to insane levels! Tesla might actually have to get into the mining & refining directly at scale, unless costs improve.\r\n\r\nThere is no shortage of the element itself, as lithium is almost everywhere on Earth, but pace of extraction\/refinement is slow.\n\n— Elon Musk (@elonmusk) April 8, 2022\n\nThe demand has accelerated so quickly that it prompted Tesla (TSLA) CEO Elon Musk to tweet that his company should consider mining the metal itself.\n\nStory continues\n\n“Imagine those supply constraints, but magnified five, six, seven, eight, nine,10 times,” Eurasia Group U.S. Director Clayton Allen told Yahoo Finance, pointing to President Biden's goal to halve the number of new gas-powered car sales by 2030.\n\n“I think the thing that people ignore is that if Biden gets his way, it wouldn't just be that you would have 50% EV sales by 2030,” Allen added. “The market share of EVs will increase steadily to that point. It's going to put a lot of demand into a market that already has people asking, 'How are we going to fill this?'”\n\n'The whole supply chain can be located here'\n\nThe geology of the Salton Sea offers a solution for carmakers looking to localize their supply chains, according to Colwell.\n\nThe region already offers more geothermal capacity than anywhere in the world and has the potential to power more than 1.5 million homes. The brine that flows to the surface in the process of power generation also contains enough lithium to produce 600,000 tons of the mineral every year, which the California Energy Commission estimated to be six times the amount produced globally in 2021.\n\nAt its Hell’s Kitchen plant, CTR envisions a full-scale operation that mines lithium using renewable energy, within driving distance of key EV manufacturers in Southern California and Mexico. Electric vehicle and component makers have begun flocking to the area.\n\nLast summer, General Motors (GM) signed a strategic investment with CTR to secure lithium directly from the plant. Berkshire Hathaway Energy, which already operates 10 geothermal plants, announced its own plans to explore lithium extraction at scale in Imperial Valley. And Italian firm Italvolt recently launched a new company to develop a lithium battery gigafactory in the area with a production capacity that would serve roughly 650,000 electric vehicles.\n\n“The whole supply chain can be located here in the Imperial Valley or Lithium Valley,” Colwell said. A rechargeable Lithium-ion battery for the Volkswagen ID.3 electric car is pictured at the Volkswagen car factory in Zwickau, eastern Germany, on February 25, 2020. (Photo by RONNY HARTMANN\/AFP via Getty Images)\n\nRestoring a toxic lake and its surrounding communities\n\nEach company has touted a potential economic boom in the region, offering promises of thousands of jobs.\n\nBut local residents remain skeptical, in part because of the valley’s history. Imperial County is among the poorest counties in the state with nearly 20 percent of its residents living in poverty.\n\n“Industries are well known to fall short on their promises,” Salton Sea Program Director Frank Ruiz told Yahoo Finance. “And that can be the case unless an education pipeline is designed that will allow young kids to have a foot in those professions, identifying how many chemists, how many engineers, how many entry-level positions this industry will need, and making sure that these kids are put in the pipeline to get to those jobs.”\n\nCommunities in the Imperial Valley face challenges other than poverty. The shrinking desert lake poses a health hazard to nearby residents, creating an elevated asthma risk from the lung-irritating dust that rises from Salton Sea’s increasingly exposed bed. And the conditions have been exacerbated by an ongoing megadrought in the region. Former boat launches are seen on a beach at Salton Sea, California's largest inland lake, where the state's worst drought since 1977 has exacerbated an area already in decline, in Salton City, California, U.S., July 4, 2021. Picture taken July 4, 2021. REUTERS\/Aude Guerrucci\n\nThe state has struggled to take ownership of a restoration plan for years. The latest Salton Sea report from the California Natural Resources Agency shows that $113.5 million of state funding over the past two decades has been spent mostly on studies, planning, staff, and consultants. Relatively little has gone to actual construction at the lake.\n\nSylvia Paz, executive director of the local non-profit group Alianza, said even fewer investments have gone towards the community’s infrastructure needs.\n\nIn a recent call with the White House, Paz implored President Biden to consider these needs beyond economic opportunities and highlighted the region’s history of “unfulfilled promises.”\n\n“We have people who are willing and want to work. What we do not have is adequate roads, adequate transmission lines, or electricity for housing,” said Paz, who also serves as Chair of the newly formed Lithium Valley Commission. “We need to look holistically about what the needs are. What are the opportunities to be investing in order for us to start filling in those gaps.” Clouds and nearby mountains are reflected in a polluted canal, once used as a boating dock, along the Salton Sea in Desert Shores, Calif., Wednesday, July 14, 2021. (AP Photo\/Marcio Jose Sanchez)\n\nAt the same time, Paz said she sees the tide shifting, in part because of the focus on domestic production of critical minerals at the state and federal levels in addition to financial incentives to drive the growth.\n\nLast month, Biden invoked the Defense Production Act to fast-track domestic mining and production of EV battery materials. Paz said firms are also providing scholarships to enroll students in STEM courses to develop a pipeline for talent for companies expanding their footprint locally.\n\n“There’s interest in continuing this research to rapidly convert lithium from the brine of geothermal energy to battery-grade lithium in order to really bring economic opportunity,” Congressman Raul Ruiz, a Democrat representing California’s 36th Congressional District, told Yahoo Finance. “But without the meaningful consultation from local community residents and labor groups, and without tying it to the public health threat, and improving infrastructure for local communities, then it's not gonna be complete.”\n\nAkiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujita\n\nDani Romero is a reporter for Yahoo Finance. Follow her on Twitter: @daniromerotv\n\nRead the latest financial and business news from Yahoo Finance","link":"https:\/\/finance.yahoo.com\/news\/electric-vehicles-white-gold-rush-lithium-140400829.html","symbols":["8GM.F","GM.MX","GM.US","GMCO34.SA","LIGQX.US","TL0.F","TL0.XETRA","TSLA.MX","TSLA.US","TSLA34.SA"],"tags":["CALIFORNIA","CALIFORNIA GOVERNOR","ELECTRIC VEHICLE","GEOTHERMAL ENERGY","GEOTHERMAL POWER PLANT","GETTY IMAGES","LITHIUM BATTERY","SALTON SEA","WHITE HOUSE"],"sentiment":{"polarity":0.968,"neg":0.046,"neu":0.89,"pos":0.064}},{"date":"2022-04-21T15:20:00+00:00","title":"CBAT - 2021 Marked A Year of Turnaround, Backed By Strong Market Demands, Increasing Production Capacity &amp; Integrated Supply of Lithium-Battery Materials","content":"NEW YORK, April 21, 2022 \/PRNewswire\/ -- CBAK Energy (Nasdaq: CBAT) released its fourth quarter and full year earnings ended Dec. 31, 2021 on April 14, 2022.\n\n2021 marked a major year for CBAK Energy as the Company gained significant traction across its product lines, powered by strengthened technology and product competitiveness, and amplified by further expanded production capacity catered to increasing battery demands for light electric vehicles (\"LEV\") and electric vehicles (\"EV\").\n\nAccording to press release, CBAT turned profitable in 2021 on GAAP basis, with revenues growing 80% and 40% year-over-year to $27.8 million and $52.7 million in the fourth quarter and the full year, respectively. Sales of high power lithium batteries grew 92% year-over-year in the fourth quarter of 2021. Among which, revenues from high power lithium batteries used in LEV increased 3631% and 1779% year-over-year in 4Q-2021 and 2021, respectively.\n\nThe demonstrated strong financial and operational performance was also attributed to the stable supply of lithium-ion batteries raw materials, secured by CBAT's acquisition of majority stake in Zhejiang Hitrans Lithium Battery Technology Co. in November 2021, allowing the Company to build out its battery product ecosystem and scale the business. Having stable raw materials supply is especially crucial in an environment of rising commodity prices.\n\nWith the growth momentum in LEVs and EVs expected to remain strong in the foreseeable future, the Company has been mindful of the rising battery demands, and will continue to focus on scaling its battery production capacity, as well as expanding its battery material business to drive growth and cement its industry position as a frontrunner and leader in lithium-ion battery production and electric energy solutions. According to the Company, CBAT's Dalian lithium battery manufacturing plant is producing the model 26650\/26700 battery at full capacity. As of March, CBAT had ~ $36 million outstanding battery orders from its Dalian facility and 90% end users were overseas.\n\nStory continues\n\nCBAT's material business is expected to be benefited by the rising material price; According to the Company, CBAT's material business unit is at full capacity. Considering the rising prices and the fact that the market is getting hotter, CBAT's material business is expected to grow quickly.\n\nFor the full year of 2021, on top of the 40% year-over-year revenue growth, CBAT continued to expand its gross margin levels by 2.5% to 9.7%, driven by a higher proportion of high-power lithium batteries sales, coupled with the addition of material business from the acquisition of Hitrans, resulting in a net income of $61.5 million, compared to a net loss of $7.8 million in 2020.\n\nAdditionally, CBAT continues to invest in new headcounts, new business and R&D (up 252% YoY in 4Q-2021). These investments, together with the Company's comprehensive battery product ecosystem are expected to drive sustainable long-term growth for the Company.\n\nFourth Quarter and Full Year of 2021 Financial Highlights\n\nNet revenues were $27.8 million in 4Q-2021, representing a year-over-year increase of 80%, mainly driven by 92% year-over-year growth in high power lithium batteries sales, as well as consolidating the post-acquisition lithium battery materials revenues from Nov. 25, 2021 to Dec. 31, 2021. For the full year of 2021, net revenues increased 40% YoY to $52.7 million from $37.6 million in 2020.\n\nIn terms of net revenues by end-product applications, revenues from high power lithium batteries used in LEV were $485,000 and $733,000, representing a YoY increase of 3631% and 1779% in 4Q-2021 and 2021, respectively.\n\nGross margin down from 6.8% 4Q-2020 to 3.7% in 4Q-2021, primarily due to the increase in raw material costs; while for the full year of 2021, gross margin expanded to 9.7%, an increase of 250 bps from 2020, mainly driven by the increased quality passing rate of products resulting from the Company's product quality control.\n\nNet income attributable to CBAT shareholders increased to $9.2 million in 4Q-2021, compared to a net loss of $4.3 million in 4Q-2020. For the full year of 2021, GAAP net income was $61.5 million, compared to a net loss of $7.8 million in 2020, primarily driven by change in fair value of warrants liabilities from lower CBAT stock share prices.\n\nBasic and fully-diluted net income per share were both $0.1 in the fourth quarter of 2021, compared to a net loss per share of $0.07 in 4Q-2020. Basic and diluted income per share were both $0.70 in 2021, compared to $0.13 in 2020.\n\nCash and cash equivalents were $7.4 million as of December 31, 2021, compared to $2 million as of September 30, 2021, and $11.68 million as of December 31, 2020.\n\n4Q-2021 Business Highlights and Recent Developments\n\nIn November 2021, CBAT completed the acquisition of ~86% majority stake in Zhejiang Hitrans Lithium Battery Technology Co., and had started to consolidate financials since Nov. 25, 2021.\n\nOn December 21, 2021, CBAT subsidiary CBAK New Energy announced that the Company has agreed to develop a customized battery pack with AZAPA R&D China for the Sino-Japan joint venture, which designs and produces electronic control systems and battery and control systems for electric vehicles. Deal terms were not disclosed.\n\nThe battery pack will initially be used for testing low-speed electric vehicles produced by Daihatsu Motor Co., a subsidiary of Toyota Motor Corp. Meanwhile, CBAK Nanjing will cooperate with AZAPA to jointly explore international markets. CBAK targeted to deliver three sample battery pack sets to AZAPA by February 2022.\n\nThe designation of developing the battery pack demonstrates new recognition and trust from the industry in CBAT's technology capabilities, while empowering the Company to broaden product offerings for electric vehicles.\n\nDISCLOSURES AND DISCLAIMERS\n\nStone Street Group LLC (\"Stone Street\") publishes research reports on publicly-traded companies. Stone Street has been retained by the Company discussed in this report (the \"Company\") to provide ongoing digital investor relations services, including the creation and dissemination of this report. All research published by Stone Street is based on public information, or on information from the Company that the Company is required to promptly make public.\n\nStone Street is not a broker-dealer or a \"covered person\" under SEC Regulation AC, and does not distribute its research through a registered broker-dealer or any associated person of a registered broker-dealer. Accordingly, Stone Street is exempt from the provisions of Regulation AC. Nevertheless, Stone Street makes the following voluntary disclosures and disclaimers in connection with its research reports:\n\nNO GUARANTEE: This research report is not a substitute for the exercise of an investor's independent due diligence and independent investment determinations. Information contained herein is based on sources we believe to be reliable but we do not guarantee their accuracy. It should be presumed that the analyst who authored this report has had discussions with the Company to endeavor to ensure factual accuracy prior to publication, however, no independent due diligence or verification has been undertaken by the analyst. No endorsements are made in respect of information provided or published by the subject Company and relied upon by the analyst for purposes of this research report. Recipients of this report should consider this report as only one factor in making any investment decision. This report is for information purposes only and is not intended as an offer to sell or a solicitation to buy securities. Any and all information provided by the Company which has been publicly disclosed as \"forward looking information\" remains subject to all uncertainties in such regard and Stone Street makes no assurances or guaranties of actual outcomes.\n\nNO CONFLICTS OF INTEREST: Stone Street does NOT own securities of the issuers described herein, and Stone Street does not make a market in any securities. Stone Street does not engage in, or receive compensation from, any investment banking or corporate finance-related activities with the Company discussed in the report. Stone Street's contracts with issuers protect Stone Street's full editorial control of all research, timing of release of reports, and release from liability for negative reports.\n\nANALYST INDEPENDENCE: Each Stone Street analyst has full discretion on the analysis and revenue targets contained in the report, based on his or her own due diligence. Analysts are paid in part based on overall profitability of Stone Street. No part of analyst compensation was, or will be, directly or indirectly, related to the specific recommendations or views expressed in any report or article. Stone Street policy does not allow an analyst or a member of their household (i) to own, trade, or have any beneficial interest in any securities of any Company that analyst covers, or (ii) serve as an officer or director of a covered Company.\n\nRISK FACTORS: Earnings targets and opinions concerning the composition of market sectors included in this report reflect analyst judgments as of this date and are subject to change without notice. A risk to our earnings targets is that the analyst's estimates or forecasts may not be met. This report contains forward-looking statements, which involve risks and uncertainties. Actual results may differ significantly from such forward-looking statements. Factors that may cause such differences include, but are not limited to, those discussed in the \"Risk Factors\" section in the issuer's SEC filings available in electronic format through SEC Edgar filings at www.sec.gov.\n\nCOMPENSATION: Stone Street received a flat fee from or on behalf of the Company for the creation and dissemination of the report. Stone Street has not received investment banking income from the Company in the past 12 months, and does not expect to receive investment banking income from the Company in the next 12 months.\n\nANALYST CERTIFICATION: The research analyst certifies that this report accurately reflects his\/her personal views about the Company's securities that none of the research analyst's compensation was, is or will be, directly or indirectly, related to the analyst's specific recommendations or views contained in this research report. Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/cbat---2021-marked-a-year-of-turnaround-backed-by-strong-market-demands-increasing-production-capacity--integrated-supply-of-lithium-battery-materials-301530319.html\n\nSOURCE CBAK Energy","link":"https:\/\/finance.yahoo.com\/news\/cbat-2021-marked-turnaround-backed-152000619.html","symbols":["CBAT.US"],"tags":["CBAT","COMPANY","LITHIUM BATTERIES","THE COMPANY"],"sentiment":{"polarity":0.991,"neg":0.039,"neu":0.882,"pos":0.079}},{"date":"2022-04-14T12:01:35+00:00","title":"Why A Lithium Battery Shortage May Wreck The Great EV Race","content":"Automakers are scrambling as lithium battery and rare earth shortages may wreck the great EV race. There's no quick fix.","link":"https:\/\/finance.yahoo.com\/m\/244bbe9a-7f59-37f7-9838-fefb0428c10f\/why-a-lithium-battery.html","symbols":["LAC.TO","LAC.US","MP.US","TL0.F","TL0.XETRA","TSLA.MX","TSLA.US","TSLA34.SA","WUC1.F"],"tags":["LITHIUM","LITHIUM AMERICAS CORP","LITHIUM BATTERIES","LITHIUM BATTERY","LITHIUM CARBONATE"],"sentiment":{"polarity":-0.153,"neg":0.25,"neu":0.597,"pos":0.153}},{"date":"2022-04-14T09:30:00+00:00","title":"CBAK Energy Reports Fourth Quarter and Full Year 2021 Unaudited Financial Results","content":"--Net Revenues up 80% year over year in the fourth quarter –\n\n--Full-Year Net Revenues up 40% year over year in 2021–\n\n--CBAK Energy turns to profitability in 2021\n\nDALIAN, China, April 14, 2022 \/PRNewswire\/ -- CBAK Energy Technology, Inc. (NASDAQ: CBAT) (\"CBAK Energy,\" or the \"Company\") a leading lithium-ion battery manufacturer and electric energy solution provider in China, today reported its unaudited financial results for the fourth quarter and full year ended December 31, 2021.\n\nFourth Quarter 2021 Financial Highlights\n\nNet revenues were $27.8 million, an increase of 80% from $15.4 million in the same period of 2020. Gross profit was $1.0 million, similar to that in the same period of 2020. Gross margin was 3.7%, compared to 6.8% from the same period of 2020. Net income attributable to shareholders of CBAK Energy was $9.2 million, compared to a net lossattributable to shareholders of CBAK Energy of $4.3 million in the same period of 2020.\n\nFull Year 2021 Financial Highlights\n\nNet revenues were $52.7 million, an increase of 40% from $37.6 million in 2020. Gross profit was $5.1 million, an increase of 88% from $2.7 million in 2020.  Gross margin was 9.7%, an increase of 250 basis points from 2020. Net income attributable to shareholders of CBAK Energy was $61.5 million, compared to a net loss attributable to shareholders of CBAK Energy of $7.8 million in 2020.\n\nYunfei Li, Chairman and Chief Executive Officer of the Company, commented: \"2021 was a major year for CBAK Energy as we've gained significant traction across multiple fronts. We continued to strengthen our competitive advantages through innovative technology and product developments. We also expanded our production capacity as scheduled to address increasing battery demands for light electric vehicles (\"LEV\") and electric vehicles (\"EV\"). Moreover, we brought in materials for lithium-ion batteries with an acquisition of a majority stake in Zhejiang Hitrans Lithium Battery Technology Co. to build out and enhance our battery product ecosystem as we seek stable raw material supply and drive greater revenue for our business.\"\n\nStory continues\n\nMr. Li continued: \"As 2022 evolves, LEVs and EVs will maintain their strong growth momentum and we will continue to focus on scaling up capacity and expanding our battery material business. Looking forward, we believe these growth drivers and strategies will cement our competitive strengths and empower us to become a frontrunner and leader in lithium-ion battery production and electric energy solutions.\"\n\nXiangyu Pei, Interim Chief Financial Officer of the Company, noted: \"We continued to expand revenue and gross margin levels that are driven by stronger sales of high power lithium batteries as well as the addition of the material business brought by the acquisition of Hitrans. Notably, our revenues grew 40% year-over-year to $52.7 million in 2021 while gross margin increased by 250 basis points to 9.7%. We also turned to profitability in 2021 with net income of $61.5 million attributable to shareholders of CBAK Energy, from a loss of $7.8 million in the previous year. Importantly, we continued to invest in new headcounts, new business as well as research and development to drive further growth. We believe these investments, combined with our sound financial position and powerful battery product ecosystem, will enable us to sustain long-term, profitable growth.\"\n\nFourth Quarter 2021 Business Highlights & Recent Developments\n\nIn March 2022, the Company announced that revenues of Zhejiang Hitrans Lithium Battery Technology Co. (\"Hitrans\"), a leading lithium-ion battery material supplier in China, reached almost $100 million in the first nine months of 2021 before the acquisition of its majority stake closed, four times CBAK Energy's revenues in the same period. In December 2021, CBAK Energy announced an agreement with AZAPA R&D China (\"AZAPA\") to develop a customized battery pack for the Sino-Japan joint venture that designs and produces electronic and battery control systems for electric vehicles. In November 2021, Dalian CBAK Power Battery Co., a wholly-owned subsidiary of CBAK Energy, completed its previously announced acquisition of 81.56% equity interests in Hitrans. In November 2021, CBAK Energy announced it has begun operations at its lithium battery manufacturing plant in the city of Nanjing in China'sJiangsu province with an initial capacity of 0.7 GWh. The Company has also started operating a new production line at its Dalian facility with a capacity of 0.4 GWh.\n\nFourth Quarter 2021 Financial Results\n\nNet revenues were $27.8 million, an increase of 80% from $15.4 million in the same period of 2020. This was driven mostly by strong sales of high power lithium batteries, and additional revenues from lithium battery materials brought by the acquisition of Hitrans from Nov. 26, 2021 to Dec. 31, 2021.\n\nNet Revenues by End-product Applications\r\n($ thousands) 2021\n\nFourth\n\nQuarter 2020\r\nFourth\n\nQuarter % \r\nChange\r\nYoY Segment 1\n\nHigh power lithium batteries used in: Uninterruptable supplies $9,308 $5,641 65 Light electric vehicles 485 13 3631 Electric vehicles 142 -483 -129 Segment 2 (Hitrans)\n\nMaterials for use in manufacturing of lithium battery \r\ncell\n\nPrecursor\n\nNiCoMn 9,139\n\n8,726 -\n\n- -\n\n- Trading of raw materials used in lithium batteries 2 10,249 -100 Total  $27,802 $15,420 80\n\nCost of revenues was $26.8 million, an increase of 86% from $14.4 million in the same period of 2020. This was primarily due to increased net revenues.\n\nGross profit was $1.0 million, similar to that in the same period of 2020. Gross margin was 3.7%, compared to 6.8% in the same period of 2020. The change in gross margin was primarily due to the increase in raw material costs\n\nTotal operating expenses were $6.8 million, a decrease of 3% from $7.0 million in the same period of 2020, as we recovered certain doubtful accounts and there's no impairment charge on property, plant, and equipment, which offsets the impact from increased expenses related to research and development, sales and marketing, and general administration.\n\nResearch and development expenses were $1.9 million, an increase of 252% from $0.5 million in the same period of 2020. Sales and marketing expenses were $1.0 million, an increase of 197% from $0.3 million in the same period of 2020. General and administrative expenses were $4.2 million, an increase of 272% from $1.1 million in the same period of 2020. Recovery of doubtful accounts was $0.3 million, compared to provision for doubtful accounts of $0.7 million in the same period of 2020.\n\nOperating loss was $5.8 million, compared to $6.0 million in the same period of 2020.\n\nFinance income, net was $0.6 million, compared to finance expenses of $0.2 million in the same period of 2020.\n\nChange in fair value of warrants was $4.6 million, compared to $2.1 million in the same period of 2020. The change in fair value of the warrants liability is mainly due to share price decline.\n\nNet income attributable to shareholders of CBAK Energy was $9.2 million, compared to a net loss attributable to shareholders of CBAK Energy of $4.3 million in the same period of 2020.\n\nBasic and diluted income per share were both $0.1. In comparison, basic and diluted loss per share in the same period of 2020 were both $0.07.\n\nCash and cash equivalents were $7.4 million as of December 31, 2021, compared to $2.0 million as of September 30, 2021.\n\nFull Year 2021 Financial Results\n\nNet revenues were $52.7 million, an increase of 40% from $37.6 million in 2020. This was primarily due to stronger sales of batteries for uninterruptable supplies and LEVs as well as the addition of the material business brought by the acquisition of Hitrans from Nov. 26, 2021 to Dec. 31, 2021.\n\nNet Revenues by End-product Applications 2021 2020 % \r\nChange ($ thousands) Full  Full YoY Year Year Segment 1 High power lithium batteries used in: Uninterruptable supplies $33,308 $22,749 46 Light electric vehicles 733 39 1,779 Electric vehicles 244 260 -6 Segment 2 (Hitrans) Materials for use in manufacturing of lithium battery\r\ncell Precursor NiCoMn  9,139 - - 8,726 - - Trading of raw materials used in lithium batteries 520 14,518 -96 Total  $52,670 $37,566 40\n\nCost of revenues was $47.6 million, an increase of 36% from $34.9 million in 2020. This was primarily attributed to increased net revenues.\n\nGross profit was $5.1 million, an increase of 88% from $2.7 million in 2020. Gross margin was 9.7%, an increase of 2.5 percentage points from 2020. The improvement in gross margin was primarily attributed to the increase in the quality passing rate of products, which was a result of CBAK Energy's quality control and upgrades on production lines.\n\nTotal operating expenses were $16.8 million, an increase of 50% from $11.2 million in 2020. Most of the increase in all expense categories was due to growing headcount and the acquisition of Hitrans.\n\nResearch and development expenses were $5.3 million, an increase of 214% from $1.7 million in 2020. The increase was mainly due to the increase in salaries, and the acquisition of Hitrans. Sales and marketing expenses were $2.3 million, an increase of 228% from $0.7 million in 2020. The increase was mainly due to the increase in salaries, the acquisition of Hitrans, and expanded sales and marketing efforts. General and administrative expenses were $10.0 million, an increase of 168% from $3.7 million in 2020. The increase was mainly due to Nasdaq listing expenses, the increase in salaries resulting from the Hitrans' acquisition and the new facility in Nanjing as well as the increase in consultancy fees. Recovery of doubtful accounts was $0.8 million, compared to provision for doubtful accounts of $0.7 million in 2020.\n\nOperating loss was $11.7 million, compared to $8.5 million in 2020.\n\nFinance income, net was $0.8 million, compared to finance expenses of $1.4 million in 2020, representing an improvement of $2.2 million as a result of lower loan balances in 2021 and interest income generated from security deposit to finance for the issuance of bills payable.\n\nChange in fair value of warrants was $61.8 million, compared to $2.1 million in 2020. The change in fair value of the warrants liability is mainly due to share price decline.\n\nNet incomeattributable to shareholders of CBAK Energy was $61.5 million, compared to a net loss attributable to shareholders of CBAK Energy of $7.8 million in 2020.\n\nBasic and diluted income per share were both $0.7 In comparison, basic and diluted loss per share in 2020 were both $0.13.\n\nConference Call\n\nCBAK's management will host an earnings conference call at 8:00 AM U.S. Eastern Time on Thursday, April 14, 2022 (8:00 PM Beijing\/Hong Kong Time on April 14, 2022).\n\nFor participants who wish to join the call, please register in advance for the conference using the link provided below at least 15 minutes prior to the scheduled call start time. Upon registration, participants will receive the conference call access information, including dial-in numbers, Direct Event passcode, a unique registrant ID and an email with detailed instructions to join the conference call.\n\nParticipant Online Registration:\n\nhttp:\/\/apac.directeventreg.com\/registration\/event\/1846656\n\nOnce completing the registration, please dial-in at least 10 minutes before the scheduled start time of the earnings call and enter the Direct Event passcode and registrant ID as instructed to connect to the call.\n\nAdditionally, a live and archived webcast of the conference call will be available at https:\/\/edge.media-server.com\/mmc\/p\/4hmkrmif\n\nA replay of the conference call may be accessed by phone approximately two hours after the conclusion of the live call at the following numbers until April 22, 2022. To access the replay, please reference the conference ID 1846656.\n\nInternational +61-2-8199-0299 United States +1-855-452-5696 Hong Kong, China +852-800-963-117 Mainland, China +86-800-988-0552 +86-400-820-9703\n\nAbout CBAK Energy\n\nCBAK Energy Technology, Inc. (NASDAQ:CBAT）is a leading high-tech enterprise in China engaged in the development, manufacturing, and sales of new energy high power lithium batteries. The applications of the Company's products and solutions include electric vehicles, light electric vehicles, electric tools, energy storage, uninterruptible power supply (UPS), and other high-power applications. In January 2006, CBAK Energy became the first lithium battery manufacturer in China listed on the Nasdaq Stock Market. CBAK Energy has multiple operating subsidiaries in Dalian and Nanjing, as well as a large-scale R&D and production base in Dalian.\n\nFor more information, please visit www.cbak.com.cn.\n\nSafe Harbor Statement\n\nThis press release contains \"forward-looking statements\" that involve substantial risks and uncertainties. All statements other than statements of historical facts contained in this press release, including statements regarding our future results of operations and financial position, strategy and plans, and our expectations for future operations, are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. We have attempted to identify forward-looking statements by terminology including \"anticipates,\" \"believes,\" \"can,\" \"continue,\" \"could,\" \"estimates,\" \"expects,\" \"intends,\" \"may,\" \"plans,\" \"potential,\" \"predicts,\" \"should,\" or \"will\" or the negative of these terms or other comparable terminology. Our actual results may differ materially or perhaps significantly from those discussed herein, or implied by, these forward-looking statements.\n\nAny forward-looking statements contained in this press release are only estimates or predictions of future events based on information currently available to our management and management's current beliefs about the potential outcome of future events. Whether these future events will occur as management anticipates, whether we will achieve our business objectives, and whether our revenues, operating results, or financial condition will improve in future periods are subject to numerous risks. There are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including: significant legal and operational risks associated with having substantially all of our business operations in China, the Chinese government may exercise significant oversight and discretion over the conduct of our business and may intervene in or influence our operations at any time, which could result in a material change in our operations and\/or the value of our securities or could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and could cause the value of such securities to significantly decline or be worthless, trading in our securities may be prohibited under the Holding Foreign Companies Accountable Act if the PCAOB subsequently determines our audit work is performed by auditors that the PCAOB is unable to inspect or investigate completely, the effects of the global Covid-19 pandemic, changes in domestic and foreign laws, regulations and taxes, uncertainties related to China's legal system and economic, political and social events in China, the volatility of the securities markets; and other risks including, but not limited to, the ability of the Company to meet its contractual obligations, the uncertain market for the Company's lithium battery cells and business, macroeconomic, technological, regulatory, or other factors affecting the profitability of battery cells designed for energy storage that we discussed or referred to in the Company's disclosure documents filed with the U.S. Securities and Exchange Commission (the \"SEC\") available on the SEC's website at www.sec.gov, including the Company's most recent Annual Report on Form 10-K as well as in our other reports filed or furnished from time to time with the SEC. You should read these factors and the other cautionary statements made in this press release. If one or more of these factors materialize, or if any underlying assumptions prove incorrect, our actual results, performance or achievements may vary materially from any future results, performance or achievements expressed or implied by these forward-looking statements. The forward-looking statements included in this press release are made as of the date of this press release and the Company undertakes no obligation to publicly update or revise any forward-looking statements, other than as required by applicable law.\n\nFor investor and media inquiries, please contact:\n\nIn China:\n\nCBAK Energy Technology, Inc.\r\nInvestor Relations Department\r\nPhone: 86-411-39185985\r\nEmail: ir@cbak.com.cn\n\nThe Blueshirt Group\r\nMs. Feifei Shen\r\nPhone: +86 13466566136\r\nEmail: feifei@blueshirtgroup.com\n\nThe Blueshirt Group\r\nMs. Suwen Feng\r\nPhone: +86 13917110134\r\nEmail: suwen@blueshirtgroup.com\n\nIn the United States:\n\nThe Blueshirt Group\r\nMs. Julia Qian\r\nPhone: +1 973-619-3227\r\nEmail: Julia@blueshirtgroup.com\n\nCBAK Energy Technology, Inc. and Subsidiaries\n\nUnaudited Condensed Consolidated Balance Sheets\n\n(In $ except for number of shares) December 31,\r\n2020 December 31,\r\n2021 Assets Current assets Cash and cash equivalents $ 11,681,750 $ 7,357,875 Pledged deposits 8,989,748 18,996,749 Trade accounts and bills receivable, net 29,571,274 49,907,129 Inventories 5,252,845 30,133,340 Prepayments and other receivables 7,439,544 12,746,990 Receivables from former subsidiary - 2,263,955 Amount due from non-controlling interest, current - 125,883 Amount due from related party, current - 472,061 Income tax recoverable - 47,189 Investment in sales-type lease, net 235,245 790,516 Total current assets 63,170,406 122,841,687 Property, plant and equipment, net 41,040,370 90,042,773 Construction in progress 30,193,309 27,343,092 Non-marketable equity securities 712,930 Prepaid land use rights 7,500,780 13,797,230 Intangible assets, net 11,807 1,961,739 Operating lease right-of-use assets, net - 1,968,032 Investment in sales-type lease, net 850,407 838,528 Amount due from related party, non-current - 62,941 Deferred tax assets - 1,403,813 Goodwill - 1,645,232 Total assets $ 142,767,079 $ 262,617,997 Liabilities Current liabilities Trade accounts and bills payable $ 28,352,292 $ 65,376,212 Short-term bank borrowings - 8,811,820 Current maturities of long-term bank loans 13,739,546 - Other short-term loans 1,253,869 4,679,122 Accrued expenses and other payables 11,645,459 22,963,700 Payables to former subsidiaries, net 626,990 326,507 Deferred government grants, current 151,476 3,834,481 Product warranty provisions 155,888 127,837 Warrants liability 17,783,000 5,846,000 Operating lease liability, current - 801,797 Total current liabilities 73,708,520 112,767,476 Deferred government grants, non-current 7,304,832 6,189,196 Product warranty provisions 1,835,717 1,900,429 Long term tax payable 7,511,182 - Operating lease liability, non-current - 876,323 Total liabilities 90,360,251 121,733,424 Commitments and contingencies Shareholders' equity Common stock $0.001 par value; 500,000,000 authorized; 79,310,249 \r\n issued and 79,166,043 outstanding as of December 31, 2020; and \r\n 88,849,222 issued and 88,705,016 outstanding as of December 31, \r\n 2021 79,310 88,849 Donated shares 14,101,689 14,101,689 Additional paid-in capital 225,278,113 241,946,362 Statutory reserves 1,230,511 1,230,511 Accumulated deficit (183,984,311) (122,498,259) Accumulated other comprehensive loss (239,609) 2,489,017 56,465,703 137,358,169 Less: Treasury shares (4,066,610) (4,066,610) Total shareholders' equity 52,399,093 133,291,559 Non-controlling interests 7,735 7,593,014 Total equity 52,406,828 140,884,573 Total liabilities and shareholder's equity $ 142,767,079 $ 262,617,997\n\nCBAK Energy Technology, Inc. and Subsidiaries\n\nUnaudited Condensed Consolidated Statements of Operations and Comprehensive \r\nIncome (Loss)\n\n(In $ except for number of shares) Year ended Year ended December 31,\r\n2020 December 31,\r\n2021 Net revenues $ 37,566,152 $ 52,669,733 Cost of revenues (34,852,132) (47,559,243) Gross profit 2,714,020 5,110,490 Operating expenses: Research and development expenses (1,678,895) (5,274,316) Sales and marketing expenses (701,404) (2,301,720) General and administrative expenses (3,745,676) (10,027,349) Impairment charge on property, plant and equipment (4,345,811) - (Provision for) recovery of doubtful accounts (721,737) 780,389 Total operating expenses (11,193,523) (16,822,996) Operating loss (8,479,503) (11,712,506) Finance expenses, net (1,399,095) 784,880 Other income (expenses), net (40,170) 3,644,363 Impairment of non-marketable equity securities - (692,639) Changes in fair value of warrants liability 2,072,000 61,802,000 (Loss) income before income tax (7,846,768) 53,826,098 Income tax credit, net - 7,733,046 Net (loss) income (7,846,768) 61,559,144 Less: Net loss (income) attributable to non-controlling interests 39,870 (73,092) Net (loss) income attributable to shareholders of CBAK Energy \r\n Technology, Inc. $ (7,806,898) $ 61,486,052 Net (loss) income (7,846,768) 61,559,144 Other comprehensive income (loss) – Foreign currency translation adjustment 1,499,949 2,725,768 Comprehensive (loss) income (6,346,819) 64,284,912 Less: Comprehensive loss (income) attributable to non-controlling\r\n interests 45,042 (70,234) Comprehensive (loss) income attributable to CBAK Energy \r\n Technology, Inc. $ (6,301,777) $ 64,214,678 (Loss) Income per share – Basic $ (0.13) $ 0.70 – Diluted $ (0.13) $ 0.70 Weighted average number of shares of common stock: – Basic 61,992,386 87,605,493 – Diluted 61,992,386 87,881,851 Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/cbak-energy-reports-fourth-quarter-and-full-year-2021-unaudited-financial-results-301525641.html\n\nSOURCE CBAK Energy Technology, Inc.","link":"https:\/\/finance.yahoo.com\/news\/cbak-energy-reports-fourth-quarter-093000099.html","symbols":["CBAT.US"],"tags":["CBAK ENERGY","CHINA","ELECTRIC VEHICLES","GROSS MARGIN","HITRANS","LITHIUM BATTERIES","LITHIUM BATTERY","SHAREHOLDERS"],"sentiment":{"polarity":1,"neg":0.033,"neu":0.856,"pos":0.111}},{"date":"2022-04-14T03:00:00+00:00","title":"BLUETTI to Roll Out Loyalty Program","content":"LAS VEGAS, April  13, 2022  (GLOBE NEWSWIRE) -- In order to drive customer brand loyalty and engagement with existing clients and attract new ones to its family, BLUETTI recently launched an incentive loyalty program called BLUETTI Plus beginning on April 5. This program will be continuously updated to bring more benefits and fun to members.\n\nAfter joining the program, all members will be able to earn and redeem bucks for rewards immediately. They will also occasionally receive seasonal promotions and newly-released products with priority.\n\nFollowing the idea to align the program with each member's identity, BLUETTI Plus's tiered structure is made of 4 levels: INSIDER, CONNOISSEUR, SOLAR EXPERT, SOGEN MASTER.\n\nBLUETTI encourages members to make a referral and offers 2 bucks per $ if the referred friend places an order. To motivate members to repeat purchases and interactions, BLUETTI has figured out many ways to earn bucks:\n\nPlace an order1 buck per $ Create an account200 bucksComplete profile200 bucksSign in50 bucks each timeFacebook share100 bucksFollow on Instagram100 bucksLike us on Facebook100 bucksLeave a review 300 bucksRefer a friend2 bucks per $ Enter birthday100 bucksSubscribe to newsletter200 bucks\n\nExclusive Benefits\r\nBLUETTI Plus allows members to place their orders at a special sale. A wide array of gifts and vouchers will be available only for loyal members. BLUETTI also offer free gifts on their birthdays. Customers could redeem the bucks by different methods within 12 months of the validity.\n\n\"Our loyalty program is a brand extension of this appreciation for our community, a solution to increase the retention rate, and a way for us to show our current and future customers how much we value them,\" said James Ray, marketing director of BLUETTI.\n\nLearn More About The Program\r\nhttps:\/\/www.bluettipower.com\/pages\/bluetti-bucks\n\nAbout BLUETTI\r\nWith over 10 years of experience in the energy storage industry, BLUETTI is committed to building the world's best power stations for van dwellers, explorers, and off-grid life. For more information, please visit https:\/\/www.bluettipower.com\n\nPress Contact\r\namanda@bluetti.com\n\nRelated Images\n\nImage 1\n\nThis content was issued through the press release distribution service at Newswire.com.\n\nAttachment\n\nFeatured Image for BLUETTI POWER INC","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/04\/14\/2422378\/0\/en\/BLUETTI-to-Roll-Out-Loyalty-Program.html","symbols":[],"tags":["BACKUP BATTERY","BLUETTI","BLUETTI POWER INC","COMPANY ANNOUNCEMENT","GENERATOR","LITHIUM BATTERY","MEMBERSHIP","OFF GRID","OUTDOOR GENERATORS","PORTABLE POWER STATION","POWER STATION","REWARDS","SOLAR ENERGY","SOLAR GENERATOR","SOLAR POWER"],"sentiment":{"polarity":0.997,"neg":0.003,"neu":0.803,"pos":0.194}},{"date":"2022-04-08T12:47:19+00:00","title":"Duke Energy Florida's Innovative Battery Storage Projects Provide Customer, Grid Benefits","content":"Sites in Gilchrist, Gulf, Highlands counties to store nearly 34 megawatts of electricity. Energy storage supports reliability, grid operations, critical services.\n\nST. PETERSBURG, Fla. --News Direct-- Duke Energy\n\nST. PETERSBURG, Fla., April 8, 2022 \/3BL Media\/ – Delivering on the company’s commitment to expand battery energy storage technology in Florida, Duke Energy announced the completion of three battery projects in Gilchrist, Gulf and Highlands counties.\n\nTotaling nearly 34 megawatts, the recently completed facilities will enhance the customer experience by continuing to modernize grid operations, improve overall reliability and support critical services during power outages.\n\n“Duke Energy Florida is committed to a clean energy future for our customers and communities,” said Melissa Seixas, Duke Energy Florida state president. “With each new battery site, Duke Energy takes another important step in expanding new storage technologies in Florida while maximizing benefits to our customers and the grid.”\n\nAs the grid manager and operator, Duke Energy Florida can optimize the versatility of battery technology to provide multiple customer and electric system benefits, to include balancing energy demand, managing intermittent resources such as solar energy, increasing energy security and deferring traditional power grid upgrades.\n\nThe nearly 18-megawatt lithium battery site is located at the company’s 45-megawatt Lake Placid Solar Power Plant in Highlands County. The addition of battery storage to the utility-scale solar plant is the first of its kind for Duke Energy Florida, allowing solar energy to be dispatchable by the company’s grid operators, which improves overall plant efficiency. The 11-megawatt Trenton lithium battery facility is located 30 miles west of Gainesville in Gilchrist County. This newer technology will improve power reliability. The 5.5-megawatt Cape San Blas lithium battery facility is located approximately 40 miles southeast of Panama City in Gulf County. The project provides additional power capacity to meet customers’ increasing demand for energy. This project is an economical alternative to replacing distribution equipment necessary to accommodate local growth.\n\nStory continues\n\nDuke Energy Florida's continued investment in battery technology reflects the company's belief that energy storage plays a significant and evolving role in how energy is delivered to customers now and in the future.\n\nIn 2022, Duke Energy will have six battery sites in operation in Florida totaling 50 megawatts of energy storage.\n\nTime lapse video of the Trenton Battery Energy Storage site\n\nTime lapse video of the Cape San Blas Battery Energy Storage site\n\nDuke Energy Florida’s commitment to renewable energy\n\nWith a combined investment of more than $2 billion, Duke Energy Florida’s solar generation portfolio will include 25 grid-tied solar power plants which will benefit all Florida customers and will provide 1,500 megawatts of emission-free generation and approximately 5 million solar panels in the ground by 2024.\n\nDuke Energy remains committed to the deployment of battery technology in Florida. A 3.5-megawatt solar plus storage microgrid site will be added at Pinellas County's John Hopkins Middle School. The microgrid will support grid operations and provide backup electric power to the school when it must operate as a special needs hurricane evacuation shelter. The microgrid consists of a 1-megawatt solar parking canopy array and a 2.5-megawatt battery and controls, which will store and deploy clean, renewable energy to the school and grid. The project enhances electric service and grid operations for customers.\n\nIn addition to expanding its battery storage technology and solar investments, Duke Energy Florida is investing in transportation electrification to support the growing U.S. adoption of electric vehicles (EV) through the addition of 627 EV charging stations, including 52 DC Fast Chargers, and a modernized power grid to deliver diverse and reliable energy solutions to best serve our customers.\n\nDuke Energy Florida\n\nDuke Energy Florida, a subsidiary of Duke Energy (NYSE: DUK), owns a diverse generation mix of natural gas, coal and renewables, providing about 10,200 megawatts of owned electric capacity to approximately 1.9 million customers in a 13,000-square-mile service area.\n\nMedia contact: Audrey StaskoCell: 315.877.3031Media line: 800.559.3853\n\nView original content here.\n\nView additional multimedia and more ESG storytelling from Duke Energy on 3blmedia.com\n\nView source version on newsdirect.com: https:\/\/newsdirect.com\/news\/duke-energy-floridas-innovative-battery-storage-projects-provide-customer-grid-benefits-924122084","link":"https:\/\/finance.yahoo.com\/news\/duke-energy-floridas-innovative-battery-124719533.html","symbols":["D2MN.F","DUK-PA.US","DUK.US","DUKB34.SA"],"tags":["BATTERY STORAGE","BATTERY TECHNOLOGY","DUKE ENERGY","DUKE ENERGY FLORIDA","ENERGY STORAGE","FLORIDA","GRID OPERATIONS","LITHIUM BATTERY","SOLAR ENERGY","STORAGE TECHNOLOGY"],"sentiment":{"polarity":0.999,"neg":0.013,"neu":0.792,"pos":0.195}},{"date":"2022-03-31T15:10:00+00:00","title":"Here's How to Ride the Wave With Lithium Manufacturer Livent","content":"LTHM is ahead of other lithium names to the point where it could hit a serious, sustained stride of growth.","link":"https:\/\/finance.yahoo.com\/m\/72eac30a-84bc-3df6-a2fa-c8bd3165e182\/here%27s-how-to-ride-the-wave.html","symbols":["8LV.F","LAC.TO","LAC.US","LTHM.US","WUC1.F"],"tags":["LITHIUM","LITHIUM BATTERIES","LITHIUM CARBONATE","LITHIUM HYDROXIDE","LIVENT","LIVENT CORP","PRESIDENT BIDEN"],"sentiment":{"polarity":0.318,"neg":0.062,"neu":0.813,"pos":0.124}},{"date":"2022-03-25T16:00:00+00:00","title":"Alpine 4 Holdings (ALPP) Subsidiary ElecJet Releases the Results from The Battery Innovation Center (BIC) On Its AX Class Solid-State Batteries","content":"PHOENIX, March 25, 2022 \/PRNewswire\/ -- Alpine 4 Holdings, Inc. (Nasdaq: ALPP), a leading operator and owner of small market businesses announced today that its subsidiary, ElecJet, has released specifications on third-party testing of its AX Class of Solid-State Batteries. Newest Alpine4 logo (PRNewsfoto\/Alpine 4 Holdings, Inc.)\n\nElecJet, earlier this month, engaged the Battery Innovation Center (BIC) in Newberry, Indiana to have a third-party verification of the specifications of its AX Class of Solid-State Batteries that ElecJet has already confirmed in its laboratory. ElecJet has engaged the BIC to verify the results of the G-AX Class as well, later in 2022. The AX Battery Class is a Ceramic Oxide solid-state battery and comes in the form of a 31Ah Solid-State Battery and a 10Ah Solid-State Battery. All of the AX and G-AX Classes are true solid-state batteries and are not semi solid-state batteries.\n\nElecJet engaged the BIC to perform several types of testing from verification of its charge capabilities to energy density \/ power density, to induced failure point testing.\n\nThe BIC tested two versions of the AX 31Ah. These two subclasses are designed for different market segments.\n\nThe AX-01 is an ultra-safe version that can withstand a variety of survivability use cases. The AX-01 has a slightly different material composition that enables its amazing survivability characteristics. The BIC confirmed that the AX-01 withstood being punctured, then folded, and finally crumpled while still holding a charge. The cell was then put through a temperature destruction test where the cell survived to a temperature of 410 degrees Fahrenheit (210 degrees Celsius). Details of the tests are described below:\n\nThe BIC confirmed that the AX-01 measured a discharge energy of 111.41Wh at a C\/2 rate (measured 31.70 Ah)). At a nominal volume of 0.17571 Liters for each cell and a nominal mass of 0.395 kg, this translates to 634Wh\/L and 282Wh\/kg of energy densities which are both dramatic improvements over current battery technology.\n\nStory continues\n\n* The AX-01 also has a designed commercial cycle life of over 1,200 charge cycles.\n\nThe AX-02 is an energy dense cell that also has a high degree of survivability but trades some of the safety material features of the AX-01 for much higher power densities and higher life cycles. \r\nThe BIC confirmed that the AX-02 has the capability to charge at 4C. This means that the battery can fully charge in just 15 minutes. The AX-02 is also capable of 7C discharging and over 2,400 life cycles, both of which are currently in the process of being confirmed by the BIC.\n\nThe BIC also confirmed that the AX-02 measured a discharge energy of 113.213Wh at a C\/2 rate (measured 31.4 Ah). At a nominal volume of 0.17571 Liters for each cell and a nominal mass of 0.395 kg, this translates to 644Wh\/L and 287Wh\/kg of energy densities which are both dramatic improvements over current battery technology.\n\n*The AX-02 also has a designed commercial cycle life of over 2,400 charge cycles.\n\nKent Wilson, CEO of Alpine 4 had this to say, \"I want to thank the BIC and their talented staff of engineers for their testing work on our AX Class of Solid-State Batteries. While traditional lithium battery cells such as the Tesla 4680 or the Panasonic 21700 have taken lithium-powered cells to new heights, they have reached their technological limits. Further, while other solid-state battery companies have accomplished fast charging like ours, they typically trade-off longevity or how much energy a battery can store. What shareholders and potential customers can take away from the BIC results is that the AX Class of Solid-State Batteries are the perfect balance between energy density (how much energy the battery can store), its C rate (how quickly it can charge) and its cycle count (how many times a battery can be charged). The AX31Ah-02 is the best all-around battery cell in production and ready to transform various industries including the EV and power storage markets. Vehicles from companies like Tesla, Lucid, GM, Ford, and RIVIAN all use traditional lithium cells. If their vehicles were powered by our AX31Ah-02, they could charge in 15 minutes, store more energy for longer duration trips and have battery cells that can power their vehicles for over 300,000 miles before the battery would require replacement. There is no better way to say this than these batteries don't just change the game, they redefine it, and we are hitting the ground running.\"\n\nDanny Marshall, the Battery Innovation Center's Lead Testing and Evaluation Team Engineer, commented: \"I am extremely impressed with the performance of this battery cell relative to other cells that we have tested at BIC. Somehow, its energy density exceeds some of the best NMC technologies that BIC has tested while being solid state and maintaining comparable C-Rate performance. From an EHS testing perspective, it has been shown to maintain stability under some amazing abusive conditions in contrast to the fielded lithium-ion chemistries that we see today. I am excited to continue testing and characterizing the abusive\/performance specifications and see if we can find where the engineering tradeoff will be, assuming it exists.\"\n\n*Tested only in our laboratory still waiting results from the BIC. This process takes several months to complete.\n\nAbout Elecjet: Elecjet specializes in developing super-fast charging, graphene battery solutions that offer convenience in the palm of your hands. For the past 11 years, our research and development team have been committed to advancing our products' charging performance and battery life.\n\nhttps:\/\/elecjet.com\/\n\nAbout the BIC: The Battery Innovation Center (BIC) is a collaborative initiative designed to incorporate leadership from renowned universities, government agencies, and commercial enterprises. The BIC focuses on the rapid development, testing and commercialization of safe, reliable and lightweight energy storage systems for defense and commercial customers. The BIC has worked with such customers as Solid Power, Bright Volt, Fisker, Rolls Royce, Du Pont, Valvoline, LG Chem, UL, GE Global Research and Cummins to name a few.\n\nhttps:\/\/bicindiana.com\/\n\nAbout Alpine 4 Holdings: Alpine 4 Holdings, Inc. (ALPP) is a NASDAQ traded conglomerate that acquires businesses that fit into its disruptive DSF business model of Drivers, Stabilizers, and Facilitators. At Alpine 4, we understand the nature of how technology and innovation can accentuate a business. Our focus is on how the adaptation of new technologies, even in brick-and-mortar businesses, can drive innovation. We also believe that our holdings should benefit synergistically from each other, have the ability to collaborate across varying industries, spawn new ideas, and create fertile ground for competitive advantages.\n\nFour principles at the core of our business are Synergy. Innovation. Drive. Excellence. At Alpine 4, we believe synergistic innovation drives excellence. By anchoring these words to our combined experience and capabilities, we can aggressively pursue opportunities within and across vertical markets. We deliver solutions that not only drive industry standards, but also increase value for our shareholders.\n\nContact: Investor Relations\n\ninvestorrelations@alpine4.com\n\nwww.alpine4.com\n\nForward-Looking Statements: Certain statements and information in this press release may constitute \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended (the \"Securities Act\"), Section 21E of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), and the Private Securities Litigation Reform Act of 1995. The information disclosed in this press release is made as of the date hereof and reflects Alpine 4 most current assessment of its historical financial performance. Actual financial results filed with the SEC may differ from those contained herein due to timing delays between the date of this release and confirmation of final audit results. These forward-looking statements are not guarantees of future performance and are subject to uncertainties and other factors that could cause actual results to differ materially from those expressed in the forward-looking statements including, without limitation, the risks, uncertainties, including the uncertainties surrounding the current market volatility, and other factors the Company identifies from time to time in its filings with the SEC. Although Alpine 4 believes that the assumptions on which these forward-looking statements are based are reasonable, any of those assumptions could prove to be inaccurate and, as a result, the forward-looking statements based on those assumptions also could be incorrect. You should not place undue reliance on these forward-looking statements. The forward-looking statements contained in this release are made as of the date hereof, and Alpine 4 disclaims any intention or obligation to update the forward-looking statements for subsequent events. Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/alpine-4-holdings-alpp-subsidiary-elecjet-releases-the-results-from-the-battery-innovation-center-bic-on-its-ax-class-solid-state-batteries-301510612.html\n\nSOURCE Alpine 4 Holdings, Inc.","link":"https:\/\/finance.yahoo.com\/news\/alpine-4-holdings-alpp-subsidiary-160000201.html","symbols":["ALPP.US"],"tags":["ALPINE 4 HOLDINGS","BATTERY INNOVATION CENTER","BIC","ELECJET","ENERGY DENSITY","INC","INNOVATION CENTER","LITHIUM BATTERIES","SOLID-STATE BATTERIES","TEMPERATURE","THERMAL RUNAWAY"],"sentiment":{"polarity":1,"neg":0.02,"neu":0.842,"pos":0.138}},{"date":"2022-03-23T22:17:47+00:00","title":"3 Lesser-Known Electric Vehicle Stocks That May Surprise Everyone in the EV Race","content":"A company’s popularity among investors is a key attribute required for its stock to attain relatively high valuations and outperform peers. This phenomenon is more important in new industries, and the electric vehicle (EV) manufacturing industry is one such area where little-known EV stocks could outperform popular peers once they achieve a surprise target that catapults them into the general public’s eye.\n\nThe most popular EV giant Tesla (NASDAQ:TSLA) stock has for a long time attained valuation multiples that boggled fundamentals-driven analysts. The company’s founder Elon Musk commands an international social media following that could make cult leaders envious. Tesla stock attracts over 5,000,000 average monthly searches on the web, and the company had 32 Wall Street analysts issue earnings projections for 2022.\n\nA similar popularity profile applies to Chinese EV play NIO (NYSE:NIO). Nio stock attracts about 3.4 million unique Google searches a month. A total of 25 investment banking analysts provided revenue and earnings projects for NIO’s 2022 financials.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhat’s key is that popularity among investors and analysts unlocks stretched valuation multiples when the company’s story is appealing. RivianAutomotive (NASDAQ:RIVN) and the Lucid Group (NASDAQ:LCID) are the other popular EV stocks that have attracted stretched valuations.\n\nIn one investing strategy, investors look for lesser-known stocks with the potential to positively surprise the market. Such stocks could violently surge as new investors pile into them. They do need to have a catalyst that could ignite increased interest. A rapid increase in analyst coverage or search engine traffic are among several such catalysts.\n\n7 Cheap Stocks to Buy Now if You Have $100 to Spend\n\nBelow is my list of three lesser-known electric vehicle stocks that may surprise everyone in the EV race.\n\nSolid Power (NASDAQ:SLDP) Arrival (NASDAQ:ARVL) Tritium DCFC (NASDAQ:DCFC)\n\nStory continues\n\nLet’s take a closer look.\n\nLesser-Known EV Stock: Solid Power (SLDP) Smartphone with logo of American battery company Solid Power Inc. on screen in front of business website. Focus on center-left of phone display.\n\nSource: T. Schneider \/ Shutterstock.com\n\nAn electric vehicle’s battery pack can comprise up to 30% of an EV’s total cost to a customer. There is an ongoing race to engineer the next generation lithium battery pack that solves all the EV industry’s current lithium battery issues, and investors are most familiar with a $7.2 billion valued QuantumScape Corporation (NYSE:QS) stock, a pre-revenue stage developer of high power density solid-state batteries.\n\nAmong the lesser-known solid-state electric-vehicle battery stocks that could take the industry by surprise in the race to build a better battery is Solid Power.\n\nWhile QuantumScape stock attracts 450,000 monthly searches on the web, and the attention of seven investment banking analysts, Solid Power had only two Wall Street analysts provide forecasts for 2022, and SLDP stock is searched just 9,900 times a month on the internet.\n\nSolid Power has spent 10 years researching on and developing a solid-state lithium battery that uses solid sulfide electrolytes to replace the fire-prone gel used in current technology. It targets to offer a 15% – 35% cost advantage over traditional lithium-ion battery pack, 80% more driving range and nearly twice the lifespan of a battery, and faster charging rates, all the while doing away with the flammable liquid gel.\n\nInterestingly, Solid Power has the backing of Ford Mortar Company (NYSE:F), the BMW Group (OTCMKTS:BMWYY) and a partnership with Korean battery manufacturing giant SK Innovation. It has hit some critical development milestones already and could be internally producing 100 Ah Silicon EV battery cells by the end of this year for pilot testing in cars.\n\nSolid Power plans to sell its sulfides at very good margins to the whole battery manufacturing industry once large-scale production starts around 2026. The company’s capital-light strategy will rely on outsourced battery manufacturing.\n\nCould the small company with a $1.5 billion market capitalization change the global electric vehicle market? A pilot project under construction this year will provide better answers, and potentially surprise everyone as the race to develop the best electric vehicle battery unfolds.\n\nArrival (ARVL) An electric vehicle charger is seen next to a row of blue electric buses.\n\nSource: BigPixel Photo \/ Shutterstock.com\n\nLuxemburg-based Arrival is a commercial vehicle manufacturer that plans to start manufacturing electric delivery vans and EV buses this year. The company has a unique strategy for its EV production – it will build its electric vehicles in capital-light micro-factories constructed closer to its target markets.\n\nArrival is one of the lesser-known electric vehicle stocks with only four Wall Street analysts covering ARVL stock today. Moreover, Arrival stock attracts a mere 590 average web searches a month. Yet short interest has increased to over 25% of available float.\n\nThe investing public has yet to get interested in ARVL stock’s potential to generate life-changing investment returns. But that could change.\n\nArrival’s electric bus is undergoing public road trials with First Bus in the United Kingdom. If successful, the company could break into the Local Authorities market of England and have up to 193 of its new electric buses incorporated into their fleet. This could be the beginning of a long-term customer relationship.\n\nThe company expects to sell and deliver about 400 – 600 commercial vans this year. The United Parcel Service (NYSE:UPS) is among the first customers to receive van deliveries. Arrival expects to quickly ramp up production to thousands of vans per year from just two small micro-factories.\n\nWhat’s more, Arrival’s micro-factories design reduces capital requirements, allows for high flexibility, and boosts margins. All while positioning the company as a competitive OEM that lowers the total cost of ownership of commercial EVs for customers.\n\nThe company also produces components in-house too. Management claimed that non-binding orders doubled during the last quarter of 2021 to around 134,000 vehicles.\n\nArrival might just change the way EV makers must design their business models to generate quick and high returns while deploying the least capital.\n\n7 Recession-Proof Stocks for Nervous Investors to Buy in 2022\n\nArrival’s founder Denis Sverdlov is a Russian national and his firm, Kinetik SARL, owns about 72.8% of ARVL’s stock. “I’m strongly against war or discrimination of any kind,” Denis said during the company’s earnings call on March 2, 2022. The company has not been affected by any international sanctions.\n\nLesser-Known Electric Vehicle Stocks: Tritium (DCFC) Tritium (DCFC) charging, charging station for electric cars, in the parking lot at McDonald's.\n\nSource: Jeppe Gustafsson \/ Shutterstock.com\n\nInvestors considering buying into electric vehicle charging infrastructure probably think about ChargePoint Holdings (NYSE:CHPT) or a more popular EVgo (NASDAQ:EVGO) stock. The two electric vehicle charging plays command significant analyst attention and the investing public frequently looks up their stock tickers.\n\nHowever, there’s another EV infrastructure player that currently barely registers on most investor’s radars: Tritium. The company is a global developer and manufacturer of direct current (DC) fast chargers for electric vehicles. It recently went public in January this year and has four financial analysts covering its business. DCFC stock attracts about 480 Google search queries a month and this makes it a lesser-known electric vehicle play.\n\nTritium boasts of over nine years of DC fast-charging experience and has become a preferred supplier of charging equipment to EV charging networks globally. The company has a proven track record of manufacturing reliable charging equipment. So there’s a low business risk here.\n\nDCFC has sold over 6,700 DC fast chargers with a capacity above 50 kilowatts so far and has already closed sales in 41 countries.\n\nTritium has the potential to significantly increase its annual production and sales rate as the EV race accelerates globally. The company is one of the best-placed beneficiaries of the $7.5 billion investment in EV charging allocation from the 2022 Infrastructure Investments and Jobs Act.\n\nThe future looks brighter for DCFC stock, yet shares trade well below the pre-SPAC merger price of $10 a share and far below February highs near $20 a share printed when the company won a contract to supply chargers to Wise Power’s subsidiary Wise EV in February 2022.\n\nWise EV is launching a new nationwide charging network. Many more players could come into the EV charging market. Thus, Tritium stands to benefit as its addressable market expands.\n\nThe company will be a charger supplier to anyone joining the global EV charging network race — and will earn recurring service and maintenance fees, sell spares, and ultimately earn decommissioning fees every 10 years as the charger reaches its end of life.\n\nOn the date of publication, Brian Paradza did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.comPublishing Guidelines.\n\nMore From InvestorPlace\n\nGet in Now on Tiny $3 ‘Forever Battery’ Stock It doesn’t matter if you have $500 in savings or $5 million. Do this now.  Stock Prodigy Who Found NIO at $2… Says Buy THIS Early Bitcoin Millionaire Reveals His Next Big Crypto Trade “On Air”\n\nThe post 3 Lesser-Known Electric Vehicle Stocks That May Surprise Everyone in the EV Race appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/3-lesser-known-electric-vehicle-221747575.html","symbols":["ARVL.US","BAMXF.US","BMW.F","BMW.MI","BMW.XETRA","BMW3.F","BMW3.XETRA","BMWB.F","BMWM5N.MX","BMWYY.US","BYMOF.US","CHPT.US","DCFC.US","EVGO.US","F.MX","F.US","FDMO34.SA"],"tags":["ARRIVAL","ELECTRIC VEHICLE","ELECTRIC VEHICLES","EV INDUSTRY","LITHIUM BATTERY","MANUFACTURING INDUSTRY","TESLA STOCK","WALL STREET ANALYSTS"],"sentiment":{"polarity":0.999,"neg":0.013,"neu":0.875,"pos":0.112}},{"date":"2022-03-22T12:00:00+00:00","title":"Aqua Metals Recovers High-Purity Copper from Lithium-ion Battery Black Mass Using Sustainable and Economical Metals Recycling Process","content":"RENO, Nev., March  22, 2022  (GLOBE NEWSWIRE) -- Aqua Metals, Inc. (NASDAQ: AQMS) (\"Aqua Metals\" or the \"Company\"), a leading innovator in metals recycling with its AquaRefining™ technology, has achieved another key accomplishment in metals recycling by recovering its first copper from lithium-ion battery black mass at the Company’s Innovation Center in the Tahoe-Reno Industrial Center. The plating of the high quality copper, which is selectively plated atom-by-atom, is another significant step in building out Aqua Metals’ capabilities for recovering all the high-value materials in lithium-ion batteries. To date, the Company has also produced high-purity lithium hydroxide from lithium-ion battery black mass and successfully lab-tested cobalt plating.\n\nCopper, which currently trades at more than $10,000 a tonne, is an important raw material for manufacturing the copper foil for lithium-ion batteries, and copper also has many other applications relevant to the new energy era. Electric vehicles can contain more than a mile of copper wires, using 4-16 times more copper than gasoline-powered vehicles. Other components of the green energy revolution, such as electric charging points, solar panels, wind turbines, and smart power grids, have heavy copper wire and cabling needs. As of 2021, the world consumed 30 million tonnes of copper per year, and by 2050 it is predicted to double to 60 million tonnes. Efficient and clean recycling methods for recovering copper from spent lithium-ion batteries are critical to meet this global demand.\n\n“To prove that our AquaRefining technology is the most sustainable and economical method, we are being very thorough in implementing a methodical step-by-step scaling approach as we verify each phase of the process,” said Ben Taecker, Chief Operations and Engineering Officer of Aqua Metals. “We are very proud of the R&D teams’ progress and are confident that we will remain on schedule for running a fully integrated pilot in the coming months.”\n\nLi AquaRefining recycles spent lithium-ion batteries in a clean, economical way that is fundamentally non-polluting by utilizing the renewable electron as the reagent instead of chemicals or high heat. The room-temperature process uses about 1\/200th of the chemicals of a standard hydro process and does not generate the carbon footprint of a high heat approach. Li AquaRefining is a closed-loop process that recycles the chemicals it uses. Consequently, it has a fraction of the waste streams, estimated at approximately 99.5 percent less than the standard hydro process. Aqua Metals, which to date has been awarded 72 patents with 49 patents pending, is developing its Li AquaRefining process to license to lithium-ion battery recyclers worldwide.\n\n“What differentiates us from other metals recycling processes is that our technology produces high purity metals. Cathode materials can be produced from pure metals, and starting with high purity metals is the best approach to making cathode materials,” said David Regan, Vice President of Commercial for Aqua Metals. “We believe our technology will provide our partners with the ability to recycle more economically and cleanly, and provide a superior business opportunity with the option of selling product back into the battery supply chain or selling high purity metals to the metals industry. We think our partners will find this flexibility a great asset for their business.”\n\nThrough the development of AquaRefining for lead batteries, Aqua Metals is the only company that has experience building a commercial clean metals recycling technology. In addition to lithium and copper, the Company’s R&D program at the Innovation Center is working to recycle the other critical elements of lithium-ion batteries such as cobalt, nickel, and manganese. Aqua Metals will continue to update the market as meaningful progress is made in the R&D process.\n\nAbout Aqua Metals\r\nAqua Metals, Inc. (NASDAQ: AQMS) is reinventing metals recycling with its patented hydrometallurgical AquaRefining™ technology. The modular Aqualyzers™ cleanly generate ultra-pure metal one atom at a time, closing the sustainability loop for the rapidly growing energy storage economy. The Company’s offerings include equipment supply, services, and licensing of the AquaRefining technology to recyclers across the globe. Aqua Metals is based in Reno, Nevada.\n\nSafe Harbor\n\nThis press release contains forward-looking statements concerning Aqua Metals, Inc. Forward-looking statements include, but are not limited to, our plans, objectives, expectations and intentions and other statements that contain words such as \"expects,\" \"contemplates,\" \"anticipates,\" \"plans,\" \"intends,\" \"believes\", \"estimates\", \"potential\" and variations of such words or similar expressions that convey the uncertainty of future events or outcomes, or that do not relate to historical matters. The forward-looking statements in this press release include our expectations for our ability to develop our AquaRefining technologies for the recycling of lithium-ion batteries and the expected benefits of our Innovation Center and the recycling of lithium-ion batteries and our deployment of AquaRefining technology and equipment to our Taiwan partner’s facility. Those forward-looking statements involve known and unknown risks, uncertainties, and other factors that could cause actual results to differ materially. Among those factors are: (1) the risk we may not be able to recycle lithium-ion batteries using our AquaRefining process or, if we do, derive the expected benefits from such recycling, (2) the risk that we may not derive the expected benefits from our Aqua Metals Innovation Center; (3) the risk that licensees may refuse or be slow to adopt our AquaRefining process as an alternative to smelting in spite of the perceived benefits of AquaRefining; (4) the risk that we may not realize the expected economic benefits from any licenses we may enter into; (5) the risk that we may not be able to access additional capital, through the sale of our TRIC facilities and equipment or otherwise, as and when needed and (6) those other risks disclosed in the section \"Risk Factors\" included in our Annual Report on Form 10-K filed on February 24, 2022. Aqua Metals cautions readers not to place undue reliance on any forward-looking statements. The Company does not undertake and specifically disclaims any obligation to update or revise such statements to reflect new circumstances or unanticipated events as they occur, except as required by law.\n\nPhotos accompanying this announcement are available at:\n\nhttps:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/b54121a5-a10d-4f94-85c2-e5418cbde08f\n\nhttps:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/2f674a73-8bbb-41ba-b45e-b870a3acc8bb","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/03\/22\/2407555\/36806\/en\/Aqua-Metals-Recovers-High-Purity-Copper-from-Lithium-ion-Battery-Black-Mass-Using-Sustainable-and-Economical-Metals-Recycling-Process.html","symbols":["AQMS.US"],"tags":["AQUA METALS","BATTERY RECYCLING","COPPER RECYCLING","LITHIUM BATTERY","LITHIUM RECYCLING","METAL RECYCLING","NASDAQ:AQMS","PRODUCT \/ SERVICES ANNOUNCEMENT"],"sentiment":{"polarity":0.975,"neg":0.038,"neu":0.887,"pos":0.076}},{"date":"2022-03-18T17:23:16+00:00","title":"U.S. Unveils Battery Strategy in West Virginia to Ease Coal Loss","content":"(Bloomberg) -- Energy Secretary Jennifer Granholm and Senator Joe Manchin on Friday announced a program to develop lithium batteries in the U.S. as part of a broader strategy to help Appalachia amid a transition away from coal.\n\nMost Read from Bloomberg\n\nBiden Warned Xi of ‘Consequences’ for Backing Russia in War Biden Team Hardens View of China Tilting to Putin on Ukraine Putin Likely to Make Nuclear Threats If War Drags, U.S. Says Ukraine Update: Biden, Xi Stake Out Positions on Russia Invasion Russia Default Fears Ease as Key Debt Payments Reach Investors\n\nLithium-based batteries are critical components of electric vehicles, grid storage and weapons, but the U.S. relies on international markets for the processing of most raw materials, according to the Energy Department.\n\nThe department is promoting a plan to support a domestic battery supply chain -- from critical minerals mining to manufacturing and recycling. The DOE also announced $5 million in funding for pilot projects for workers in communities where energy and automotive industries once held sway.\n\n“American leadership in the global battery supply chain will be based not only on our innovative edge, but also on our skilled workforce of engineers, designers, scientists, and production workers,” Granholm said in a statement. President Joe Biden “has a vision for achieving net zero emissions while creating millions of good paying, union jobs — and DOE’s battery partnerships with labor and industry are key to making that vision a reality.”\n\nAs part of the initiative, Energy Department officials, representatives of the AFL-CIO and the United Mine Workers of America and executives of Sparkz Inc., a battery manufacturer that is developing a cobalt-free battery technology in Knoxville, Tenn., met Friday at the West Virginia Regional Technology Park in South Charleston, West Virginia.\n\nThe company said in a statement after the meeting it plans to begin construction in 2022 of a “Gigafactory” in West Virginia to commercialize their zero-cobalt battery that will initially employ 350 workers.\n\nStory continues\n\nManchin, a West Virginia Democrat and longtime champion of the state’s coal industry, has been a crucial factor in the advancement, or lack of it, of Biden’s economic and climate agenda.\n\nThe lithium battery announcement and the meeting were among the events during a listening session held by the Biden administration’s Interagency Working Group on Coal and Power Plant Communities and Economic Revitalization to identify projects to help the 13-state Appalachia region.\n\n“While I remain concerned about our dependence on China and other foreign countries for key parts of the lithium-ion battery supply chain, engaging our strong and capable workforce to manufacture batteries domestically is a critical step toward reducing our reliance on other countries and ensuring we are able to maintain our energy security,” Manchin said in a statement. “I look forward to seeing this initiative grow, and we will continue to work closely together to ensure we can onshore the rest of the battery supply chain.”\n\nOn Friday, the administration also announced nearly $215 million in Interior Department funding to clean up abandoned mines in West Virginia, Agriculture Department grants for grid improvements and other projects in coal communities in West Virginia, Pennsylvania, Ohio and Kentucky, and Environmental Protection Agency grants to a West Virginia non-profit for job training and environmental cleanup.\n\n(Adds information about battery plant in fifth graph)\n\nMost Read from Bloomberg Businessweek\n\nBroke Oligarch Says Sanctioned Billionaires Have No Sway Over Putin A Once Radical Idea to Close the Wealth Gap Is Actually Happening Russia’s Brain Drain Becomes a Stampede for the Exits U.S. Work-Permit Backlog Is Costing Immigrants Their Jobs For Sale: Trudeau’s Oil Pipeline. Wanted: Indigenous Buyers\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/granholm-manchin-unveil-u-lithium-100000000.html","symbols":[],"tags":["BLOOMBERG","JENNIFER GRANHOLM","JOE BIDEN","JOE MANCHIN","LITHIUM BATTERIES","SUPPLY CHAIN","WEST VIRGINIA"],"sentiment":{"polarity":0.993,"neg":0.06,"neu":0.811,"pos":0.129}},{"date":"2022-03-17T13:00:00+00:00","title":"CBAK Energy Announces Hitrans's Revenues Reach Almost $100 Million in First Nine Months of 2021 Before Acquisition Closes, Four Times Their Own Revenues in Same Period","content":"DALIAN, China, March 17, 2022 \/PRNewswire\/ -- CBAK Energy Technology, Inc. (NASDAQ: CBAT) (\"CBAK Energy,\" or the \"Company\"), a leading lithium-ion battery manufacturer and electric energy solution provider in China, today announced financial highlights of Zhejiang Hitrans Lithium Battery Technology Co. (\"Hitrans\"), a leading lithium-ion battery material supplier in China that CBAK Energy has completed an acquisition of 81.56% of its equity stake, for the first nine months of 2021.\n\nHitrans's revenues were $97.9 million in the first three quarters of 2021, roughly four times CBAK Energy's revenues in the same period. Hitrans generated a gross profit of $11.0 million, about 2.7 times the gross profit of CBAK Energy in the same period. Its operating profit was $4.2 million. More detailed financial data of Hitrans can be accessed on the 8K filing filed by the Company to the Securities and Exchange Commission on March 17, 2022.\n\nFirst Nine Months of 2021 ($) Hitrans Revenues 97,875,308 Gross Profit 10,963,386 Operating Profit (Loss） 4,229,511\n\nConsidering the transaction was closed on November 29, 2021, Hitrans's financial performance before the closing date will not be incorporated into CBAK Energy's financial results for the 2021 fiscal year. Hitrans's results for the first nine months of 2021 are provided for a better understanding of its financial performance, and its excellent results are expected to significantly increase CBAK Energy's financial results in 2022 and beyond.\n\nAfter the acquisition, CBAK Energy just replaced some financial and administration personnel of Hitrans while other team members, including technical and sales personnel, remained the same to continue their support for the business growth of the unit. Hitrans mainly focuses on the production and sales of NCM precursors and cathode materials for lithium batteries. Building upon its superior performance and cutting-edge technologies, Hitrans has become one of small and medium-sized enterprises that dominate major markets in niche sectors with increased financial and tax support and enhanced credit policies from the government, which allows such companies to further innovate and grow into \"little giants.\" Such a small and medium-sized enterprise with a considerable amount of government support is therefore a factor that numerous Chinese investors will evaluate when selecting investment targets of great potential growth. At present, Hitrans's main customers include:\n\nStory continues\n\n- A subsidiary of the world's largest producer of batteries for electric vehicles;\r\n- China's largest cylindrical lithium-ion battery manufacturer;\r\n- The world's leading manufacturer of soft-pack power and energy storage batteries;\r\n- China's leading supplier of cathode materials for lithium-ion batteries;\n\nMr. Yunfei Li, Chief Executive Officer of CBAK Energy commented, \"Apart from bringing a new main business line to the Company, the Hitrans acquisition was a result of our strategies for long-term growth in the battery industry. As the demand for electrification continues to rise, the adoption of electric vehicles will also expedite, which will then promote the market for batteries and their raw materials. The acquisition of Hitrans will enable us to build a powerful battery ecosystem where a stable supply of raw materials is secured for ongoing battery innovations and development. Moreover, its stellar financial performance demonstrates that we made the right decision. Going forward, we are more confident in our capabilities for capturing opportunities in an ever-growing market while delivering lasting value to all our shareholders.\"\n\nAbout CBAK Energy\n\nCBAK Energy Technology, Inc. is a leading high-tech enterprise in China engaged in the development, manufacturing, and sales of new energy high power lithium batteries. The applications of the Company's products and solutions include electric vehicles, light electric vehicles, electric tools, energy storage, uninterruptible power supply (UPS), and other high-power applications. In January 2006, CBAK Energy became the first lithium battery manufacturer in China listed on the Nasdaq Stock Market. CBAK Energy has multiple operating subsidiaries in Dalian and Nanjing, as well as a large-scale R&D and production base in Dalian.\n\nFor more information, please visit www.cbak.com.cn.\n\nAbout Hitrans\n\nZhejiang Hitrans Lithium Battery Technology Co. is a leading developer and manufacturer of ternary precursor and cathode materials in China, with a mission to become the world's first-class producer of cathode materials for new energy lithium batteries. The Company's products have a wide range of applications, including electric vehicles, electric tools, high-end digital products, storage, etc. Hitrans has more than 50 authorized patents or accepted patent applications, and is dedicated to the advancement of cutting-edge technologies for sustainable development and growth.\n\nFor more information, please visit http:\/\/www.chinahitrans.com\/en.\n\nSafe Harbor Statement\n\nThis press release contains \"forward-looking statements\" that involve substantial risks and uncertainties. All statements other than statements of historical facts contained in this press release, including statements regarding our future results of operations and financial position, strategy and plans, and our expectations for future operations, are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. We have attempted to identify forward-looking statements by terminology including \"anticipates,\" \"believes,\" \"can,\" \"continue,\" \"could,\" \"estimates,\" \"expects,\" \"intends,\" \"may,\" \"plans,\" \"potential,\" \"predicts,\" \"should,\" or \"will\" or the negative of these terms or other comparable terminology. Our actual results may differ materially or perhaps significantly from those discussed herein, or implied by, these forward-looking statements.\n\nAny forward-looking statements contained in this press release are only estimates or predictions of future events based on information currently available to our management and management's current beliefs about the potential outcome of future events. Whether these future events will occur as management anticipates, whether we will achieve our business objectives, and whether our revenues, operating results, or financial condition will improve in future periods are subject to numerous risks. There are a significant number of factors that could cause actual results to differ materially from statements made in this press release, including: significant legal and operational risks associated with having substantially all of our business operations in China, the Chinese government may exercise significant oversight and discretion over the conduct of our business and may intervene in or influence our operations at any time, which could result in a material change in our operations and\/or the value of our securities or could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and could cause the value of such securities to significantly decline or be worthless, trading in our securities may be prohibited under the Holding Foreign Companies Accountable Act if the PCAOB subsequently determines our audit work is performed by auditors that the PCAOB is unable to inspect or investigate completely, the effects of the global Covid-19 pandemic, changes in domestic and foreign laws, regulations and taxes, uncertainties related to China's legal system and economic, political and social events in China, the volatility of the securities markets; and other risks including, but not limited to, the ability of the Company to meet its contractual obligations, the uncertain market for the Company's lithium battery cells and business, macroeconomic, technological, regulatory, or other factors affecting the profitability of battery cells designed for energy storage that we discussed or referred to in the Company's disclosure documents filed with the U.S. Securities and Exchange Commission (the \"SEC\") available on the SEC's website at www.sec.gov, including the Company's most recent Annual Report on Form 10-K as well as in our other reports filed or furnished from time to time with the SEC. You should read these factors and the other cautionary statements made in this press release. If one or more of these factors materialize, or if any underlying assumptions prove incorrect, our actual results, performance or achievements may vary materially from any future results, performance or achievements expressed or implied by these forward-looking statements. The forward-looking statements included in this press release are made as of the date of this press release and the Company undertakes no obligation to publicly update or revise any forward-looking statements, other than as required by applicable law.\n\nFor investor and media inquiries, please contact:\n\nIn China:\n\nCBAK Energy Technology, Inc.\r\nInvestor Relations Department\r\nMr. Thierry Jiewei Li\r\nPhone: 86-18675423231\r\nEmail: ir@cbak.com.cn\n\nThe Blueshirt Group\r\nMs. Feifei Shen\r\nPhone: +86 13466566136\r\nEmail: feifei@blueshirtgroup.com\n\nThe Blueshirt Group\r\nMs. Suwen Feng\r\nPhone: +86 13917110134\r\nEmail: suwen@blueshirtgroup.com\n\nIn the United States:\n\nThe Blueshirt Group\r\nMs. Julia Qian\r\nPhone: +1 973-619-3227\r\nEmail: Julia@blueshirtgroup.com\n\nRelated Links\n\nhttps:\/\/ir.cbak.com.cn\/ Cision\n\nView original content:https:\/\/www.prnewswire.com\/news-releases\/cbak-energy-announces-hitranss-revenues-reach-almost-100-million-in-first-nine-months-of-2021-before-acquisition-closes-four-times-their-own-revenues-in-same-period-301504964.html\n\nSOURCE CBAK Energy Technology, Inc.","link":"https:\/\/finance.yahoo.com\/news\/cbak-energy-announces-hitranss-revenues-130000931.html","symbols":["CBAT.US"],"tags":["CBAK ENERGY","CBAK ENERGY TECHNOLOGY","CHINA","DALIAN","ELECTRIC VEHICLES","GROSS PROFIT","HITRANS","INC","LITHIUM BATTERY"],"sentiment":{"polarity":0.998,"neg":0.02,"neu":0.878,"pos":0.103}},{"date":"2022-03-10T17:51:00+00:00","title":"Duke Energy Florida's innovative battery storage projects provide customer, grid benefits","content":"- Sites in Gilchrist, Gulf, Highlands counties to store nearly 34 megawatts of electricity.\n\n- Energy storage supports reliability, grid operations, critical services.\n\nST. PETERSBURG, Fla., March 10, 2022 \/PRNewswire\/ -- Delivering on the company's commitment to expand battery energy storage technology in Florida, Duke Energy today announced the completion of three battery projects in Gilchrist, Gulf and Highlands counties. (PRNewsfoto\/Duke Energy)\n\nTotaling nearly 34 megawatts, the recently completed facilities will enhance the customer experience by continuing to modernize grid operations, improve overall reliability and support critical services during power outages.\n\n\"Duke Energy Florida is committed to a clean energy future for our customers and communities,\" said Melissa Seixas, Duke Energy Florida state president. \"With each new battery site, Duke Energy takes another important step in expanding new storage technologies in Florida while maximizing benefits to our customers and the grid.\"\n\nAs the grid manager and operator, Duke Energy Florida can optimize the versatility of battery technology to provide multiple customer and electric system benefits, to include balancing energy demand, managing intermittent resources such as solar energy, increasing energy security and deferring traditional power grid upgrades.\n\nThe nearly 18-megawatt lithium battery site is located at the company's 45-megawatt Lake Placid Solar Power Plant in Highlands County. The addition of battery storage to the utility-scale solar plant is the first of its kind for Duke Energy Florida, allowing solar energy to be dispatchable by the company's grid operators, which improves overall plant efficiency. The 11-megawatt Trenton lithium battery facility is located 30 miles west of Gainesville in Gilchrist County. This newer technology will improve power reliability. The 5.5-megawatt Cape San Blas lithium battery facility is located approximately 40 miles southeast of Panama City in Gulf County. The project provides additional power capacity to meet customers' increasing demand for energy. This project is an economical alternative to replacing distribution equipment necessary to accommodate local growth.\n\nStory continues\n\nDuke Energy Florida's continued investment in battery technology reflects the company's belief that energy storage plays a significant and evolving role in how energy is delivered to customers now and in the future.\n\nIn 2022, Duke Energy will have six battery sites in operation in Florida totaling 50 megawatts of energy storage.\n\nTime lapse video of the Trenton Battery Energy Storage site\n\nTime lapse video of the Cape San Blas Battery Energy Storage site\n\nDuke Energy Florida's commitment to renewable energy\n\nWith a combined investment of more than $2 billion, Duke Energy Florida's solar generation portfolio will include 25 grid-tied solar power plants which will benefit all Florida customers and will provide 1,500 megawatts of emission-free generation and approximately 5 million solar panels in the ground by 2024.\n\nDuke Energy remains committed to the deployment of battery technology in Florida. A 3.5-megawatt solar plus storage microgrid site will be added at Pinellas County'sJohn Hopkins Middle School. The microgrid will support grid operations and provide backup electric power to the school when it must operate as a special needs hurricane evacuation shelter. The microgrid consists of a 1-megawatt solar parking canopy array and a 2.5-megawatt battery and controls, which will store and deploy clean, renewable energy to the school and grid. The project enhances electric service and grid operations for customers.\n\nIn addition to expanding its battery storage technology and solar investments, Duke Energy Florida is investing in transportation electrification to support the growing U.S. adoption of electric vehicles (EV) through the addition of 627 EV charging stations, including 52 DC Fast Chargers, and a modernized power grid to deliver diverse and reliable energy solutions to best serve our customers.\n\nDuke Energy Florida\n\nDuke Energy Florida, a subsidiary of Duke Energy (NYSE: DUK), owns a diverse generation mix of natural gas, coal and renewables, providing about 10,200 megawatts of owned electric capacity to approximately 1.9 million customers in a 13,000-square-mile service area.\n\nMedia contact: Audrey Stasko \r\nCell: 315.877.3031 Media line: 800.559.3853 Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/duke-energy-floridas-innovative-battery-storage-projects-provide-customer-grid-benefits-301500390.html\n\nSOURCE Duke Energy","link":"https:\/\/finance.yahoo.com\/news\/duke-energy-floridas-innovative-battery-175100940.html","symbols":["D2MN.F","DUK-PA.US","DUK.US","DUKB34.SA"],"tags":["BATTERY STORAGE","BATTERY TECHNOLOGY","DUKE ENERGY","DUKE ENERGY FLORIDA","ENERGY STORAGE","FLORIDA","GRID OPERATIONS","LITHIUM BATTERY","POWER GRID","SOLAR ENERGY","STORAGE TECHNOLOGY"],"sentiment":{"polarity":0.999,"neg":0.013,"neu":0.79,"pos":0.197}},{"date":"2022-03-09T07:41:34+00:00","title":"China Lithium Tech to File for $1.5 Billion Hong Kong IPO, Sources Say","content":"(Bloomberg) -- China Aviation Lithium Battery Technology Co. plans to file for a Hong Kong initial public offering as early as this week, according to people familiar with the matter.\n\nMost Read from Bloomberg\n\nChina Warns U.S. Over Forming Pacific NATO, Backing Taiwan Owners Fear Planes ‘Are Gone Forever’ After Russia Shields Them From Seizure Ukraine Update: Firms Exit Russia, Fitch Sees ‘Imminent’ Default Biden to Sign Crypto Order as Firms Face Sanctions Pressure China Pushes Conspiracy Theory About U.S. Labs in Ukraine\n\nThe Jiangsu-based electric vehicle battery maker is working with Huatai Securities Co. on the listing, which could raise as much as $1.5 billion, the people said, asking not to be identified as the information is confidential. The share sale could happen in the coming months, they said.\n\nAt $1.5 billion, China Lithium Tech’s IPO could be Hong Kong’s biggest in 2022, according to data compiled by Bloomberg. Companies so far have only raised about $1.4 billion through first-time share sales in the city this year as the effects of China’s clampdown on overseas listings and the Ukraine war led to a slowdown in activity.\n\nDeliberations are ongoing and details of the offering such as size and timing could change, the people said. Representatives for China Lithium Tech and Huatai Securities declined to comment.\n\nEstablished in 2007, China Lithium Tech makes lithium batteries for electric vehicles and other products. It operates eight major production bases in China, including Changzhou, Luoyang and Wuhan, according to its website.\n\nMost Read from Bloomberg Businessweek\n\nPutin’s Endgame Starts to Look Like Reducing Ukraine to Rubble Putin Clings to Russia’s Market Economy as Sanctions Wind Back the Clock Remote-Work Experts Are in Demand as Return to Office Begins Anew The GOP’s Toomey Rails Against the Fed Becoming ‘Politburo’ for Credit Ukraine Struggles to Get ‘War Bonds’ to Retail Investors Abroad\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/china-lithium-tech-file-1-074134721.html","symbols":["206H.F","601688.SHG","6886.HK","HUATF.US"],"tags":["BLOOMBERG","CHINA","HONG KONG","INITIAL PUBLIC OFFERING","LITHIUM BATTERY"],"sentiment":{"polarity":-0.612,"neg":0.055,"neu":0.895,"pos":0.049}},{"date":"2022-03-01T13:00:00+00:00","title":"Aqua Metals Produces First Lithium from Spent Batteries, Achieving Key Step in its Novel Lithium-ion Battery Recycling Technology","content":"RENO, Nev., March  01, 2022  (GLOBE NEWSWIRE) -- Aqua Metals, Inc. (NASDAQ: AQMS) (\"Aqua Metals\" or the \"Company\"), a leading innovator in metals recycling with its AquaRefining™ technology, has achieved a key milestone and potentially an important industry breakthrough by producing its first lithium hydroxide from lithium-ion battery black mass at the Company’s Innovation Center in the Tahoe-Reno Industrial Center. Currently, the only commercially proven recycling technology being utilized for lithium-ion batteries is smelting which does not recover the lithium. Lithium is a critical component of the lithium-ion batteries that battery manufacturers need to produce to meet the demand of the fast-growing electric vehicle (EV) and overall energy storage markets. In addition to producing lithium through a patent-pending proprietary process, the Company’s R&D program at the Innovation Center is working to recycle the other key elements of lithium-ion batteries such as cobalt (already plated), nickel, copper, and manganese.\n\n“This is an important step in demonstrating our proprietary Li AquaRefining process, which we think is environmentally and economically superior to other metals recycling methods,” said Ben Taecker, Chief Operations and Engineering Officer of Aqua Metals. “Our goal is to produce battery precursor grade lithium hydroxide, and these early results indicate we are on track for meeting this goal. This also confirms that we remain on schedule to start running our pilot-scale unit in the coming months.”\n\nAs governments and vehicle manufacturers take steps to phase out internal combustion engine vehicles to meet carbon emissions reduction targets, demand for lithium is soaring to the point where lithium shortages are already being forecasted for the near term. Benchmark Mineral Intelligence has predicted that there will be acute deficits of lithium as early as this year. The price of lithium has also been dramatically affected, increasing by more than 300 percent in 2021. It currently stands at approximately $58,000 a metric tonne. Increased mining activity alone cannot mitigate the shortages. Mining is environmentally costly and takes five to seven years to get operational; recycling is critical to meet future demand.\n\n“Morningstar, Inc. has predicted that lithium-ion demand will likely outstrip production within the next five years, and demand for lithium will only continue to skyrocket as the world transitions from fossil fuels to a renewable energy economy,” commented David Regan, Aqua Metal’s Vice President of Commercial. “As of today, the only commercially proven recycling technology for lithium-ion batteries is smelting, which has a negative environmental impact and does not recover the lithium or manganese. Applying the proven AquaRefining process to lithium-ion batteries has the potential to be an important industry breakthrough, as we believe it is the only truly sustainable recycling technology under development that recovers all the valuable metals and compounds without using high heat or consuming massive quantities of chemicals that create difficult to manage waste streams.”\n\nLi AquaRefining recycles spent lithium-ion batteries in a clean, economical way by utilizing the electron as the reagent instead of chemicals or high heat. The emissions-free, room-temperature process uses about one two-hundredth of the chemicals of a standard hydro process and does not generate the carbon footprint of a high heat approach. Li AquaRefining is a closed-loop process that recycles the chemicals it uses. Consequently, it has a fraction of the waste streams, estimated at approximately 99.5 percent less than the standard hydro process.\n\nPhotos accompanying this announcement are available at\n\nLithium Hydroxide produced at the Aqua Metals Innovation Center in Tahoe Reno Industrial Center, NV.\r\nhttps:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/aff75a67-bbf6-45c2-82f1-05ccbe061a79\n\nThe Lithium hydroxide was produced from black mass made up of a mix of lithium-ion batteries. Li AquaRefining will be able to process black mass made from any mix of lithium-ion batteries.\r\nhttps:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/361c9ec0-5263-4091-a7a5-b5d77da74f66\n\nAbout Aqua Metals\r\nAqua Metals, Inc. (NASDAQ: AQMS) is reinventing metals recycling with its patented hydrometallurgical AquaRefining™ technology. The modular Aqualyzers™ cleanly generate ultra-pure metal one atom at a time, closing the sustainability loop for the rapidly growing energy storage economy. The Company’s offerings include equipment supply, services, and licensing of the AquaRefining technology to recyclers across the globe. Aqua Metals is based in McCarran, Nevada.","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/03\/01\/2394221\/36806\/en\/Aqua-Metals-Produces-First-Lithium-from-Spent-Batteries-Achieving-Key-Step-in-its-Novel-Lithium-ion-Battery-Recycling-Technology.html","symbols":["AQMS.US"],"tags":["AQUA METALS","BATTERY RECYCLING","LITHIUM BATTERY","LITHIUM RECYCLING","METAL RECYCLING","NASDAQ:AQMS","PRODUCT \/ SERVICES ANNOUNCEMENT"],"sentiment":{"polarity":0.908,"neg":0.043,"neu":0.897,"pos":0.06}},{"date":"2022-02-15T13:00:00+00:00","title":"Aqua Metals on Track to Deploy AquaRefining in Future Lithium-Ion Battery Recycling Operation","content":"RENO, Nev., Feb.  15, 2022  (GLOBE NEWSWIRE) -- Aqua Metals, Inc. (NASDAQ: AQMS) (\"Aqua Metals\" or the \"Company\"), a leading innovator in metals recycling with its AquaRefining™ technology, has made significant progress in moving its economical and environmentally advantageous lithium-ion battery (LiB) recycling process from concept to execution to meet the growing global demand for lithium-ion battery recycling and supply chain needs.\n\nThe Aqua Metals LiNiCo strategic alliance provides the venue for Aqua Metals to apply its AquaRefining process to LiB recycling in a commercial production facility. Aqua Metals’ preliminary work has yielded promising results, meeting vital benchmarks and paving the way for end-to-end recycling as early as the end of the year.\n\nLiNiCo is focused on developing and implementing its novel LiB crushing, separation, and extraction processes for lithium and graphite. Aqua Metals plans to process the black mass produced by LiNiCo and others to produce pure nickel, cobalt copper, and other key high-value compounds. The Company has already successfully lab-tested cobalt plating at its Innovation Center, yielding high purity cobalt. The market value of high purity cobalt is currently valued at about $70,000 per ton. Aqua Metals is targeting a pilot circuit that will produce meaningful quantities of critical metals and compounds by late summer or early fall 2022.\n\nThe two companies plan to combine their technologies in a 140,000 square foot LiNiCo plant in the Tahoe-Reno Industrial Center, to create a fully integrated recycling and refining operation with commercial production beginning and scaling by late 2022 or early 2023.\n\nTo help Aqua Metals define and achieve its rapid growth roadmap, the Company has also appointed Dave McMurtry as the Chief Strategist. McMurtry is responsible for assisting with the development of Aqua Metals’ go-to-market strategy for Li AquaRefining. His global experience of working in more than 80 countries on five continents will help accelerate the Company’s borderless licensing model, partnering with LiB ecosystem players (recyclers, battery manufacturers, distribution and collection companies) that are looking for sustainable metals recycling that will deliver high-value metals back into the manufacturing supply chain while reducing emissions and toxic byproducts and creating safer work environments.\n\nStrengthening its go-to-market capabilities, Aqua Metals has also engaged Silver State Government Relations to help engage and shape state and federal government officials’ priorities and best practices for LIB recycling. McMurtry is supervising initiatives to help government officials understand the importance of supporting sustainable metals recycling methods given the forecasted five million metric tons of spent lithium-ion batteries by 2030, as well as highlight how the new, burgeoning industry will bring economic opportunities and jobs to local communities.\n\nAbout Aqua Metals\r\nAqua Metals, Inc. (NASDAQ: AQMS) is reinventing metals recycling with its patented hydrometallurgical AquaRefining™ technology. The modular Aqualyzers™ cleanly generate ultra-pure metal one atom at a time, closing the sustainability loop for the rapidly growing energy storage economy. The Company’s offerings include equipment supply, services, and licensing of the AquaRefining technology to recyclers across the globe. Aqua Metals is based in McCarran, Nevada.","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/02\/15\/2385187\/36806\/en\/Aqua-Metals-on-Track-to-Deploy-AquaRefining-in-Future-Lithium-Ion-Battery-Recycling-Operation.html","symbols":["AQMS.US"],"tags":["AQUA METALS","CALENDAR OF EVENTS","LITHIUM BATTERY","LITHIUM RECYCLING","METAL RECYCLING","NASDAQ:AQMS"],"sentiment":{"polarity":0.996,"neg":0.012,"neu":0.84,"pos":0.148}},{"date":"2022-02-09T11:00:00+00:00","title":"Joshua Gold Resources Inc. Exploring Lithium Property","content":"WOODSTOCK, Ontario, Feb.  09, 2022  (GLOBE NEWSWIRE) -- via InvestorWire – Joshua Gold Resources Inc. (“JSHG” or “Joshua”) (OTCMKTS: JSHG), an American gold and mineral exploration company headquartered in Canada, is pleased to announce that it will be conducting a Drone Magnetometer Survey on its 100% owned Seymour Lake Extension property in order to pinpoint potential lithium (Li) drill targets.\n\nJSHG’s Seymour Lake Extension lithium prospect property is situated in northwestern Ontario within the Caribou-Marshall Lake Greenstone Belt and consists of 27 unpatented claim units covering 1,371 acres.  The Seymour Lake Extension property is adjacent to Green Technology Metals’ Seymour Lake lithium deposit that is 300 meters west of JSHG’s ground. Green Tech Metal’s Seymour Lake project is estimated to contain 2 million to 3 million tons of 1.25% lithium.\n\n“With the global surge in electric vehicle production, lithium prices have exploded as it is a primary component of EV production,” said Ben Fuschino, JSHG CEO. “Since our property is adjacent to a lithium deposit, we are excited to review the results of our Drone Magnetometer Survey. Once we get the results, we will have our geological team figure out our next steps in the exploration program.”\n\nThe global lithium market is projected to grow from USD$3.83 billion in 2021 to USD$6.62 billion in 2028 at a CAGR of 8.1% during the forecast period. Prices continue to surge, along with increasing demand from lithium battery manufacturers who are racing to secure long-term supply contracts. Rapid advancements in rechargeable batteries, essential for portable electronics and electric vehicles, are driving growth in the lithium battery market.\n\nAbout Joshua Gold Resources Inc.\n\nJoshua Gold Resources Inc. (OTC Pink: JSHG) is a publicly traded American gold and mineral exploration company headquartered in Canada, home to the 3 billion-year-old Canadian Shield which contains a wealth of minerals from nickel, gold, copper, lithium, cobalt, niobium, lithium to chromium. Please visit http:\/\/www.joshuagoldresources.com\/ for more information.\n\nSafe Harbor Statement: This press release contains forward looking statements of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Exchange Act. Forward looking statements are not a guarantee of future performance and results, and will not be accurate indications of the times, or by, which such performance will be achieved.\n\nInvestor Relations Contact: \r\nPeter Nicosia\r\nPresident, Bull In Advantage, LLC\r\nPhone: (585) 703-6565\r\nEmail: bullinadvantage@aol.com\n\nWire Service Contact\r\n InvestorWire (IW) \r\n Los Angeles, California\r\nwww.InvestorWire.com\r\n 212.418.1217 Office\r\nEditor@InvestorWire.com\n\nAttachment\n\nJoshua Gold Resources Inc. (JSHG) to Survey Potential Lithium Drill Targets","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/02\/09\/2381632\/0\/en\/Joshua-Gold-Resources-Inc-Exploring-Lithium-Property.html","symbols":["JSHG.US"],"tags":["COMPANY ANNOUNCEMENT","ELECTRIC VEHICLES","EV PRODUCTION","GLOBAL LITHIUM MARKET","JOSHUA GOLD RESOURCES","JOSHUA GOLD RESOURCES INC","LITHIUM","LITHIUM BATTERIES","MANAGEMENT STATEMENTS","MINING AND METALS","OTC MARKETS:JSHG","OTHER NEWS","PRESS RELEASES"],"sentiment":{"polarity":0.979,"neg":0.007,"neu":0.915,"pos":0.078}},{"date":"2022-02-04T11:03:00+00:00","title":"Global and China Lithium-ion Battery Anode Material Market Report 2021-2026 Featuring Major Anode Material Companies and Lithium Titanate Material Companies","content":"Dublin, Feb.  04, 2022  (GLOBE NEWSWIRE) -- The \"Global and China Lithium-ion Battery Anode Material Industry Report,2021-2026\" report has been added to ResearchAndMarkets.com's offering.\n\nCurrently, global lithium battery anode materials industry is concentrated in China and Japan, which occupy more than 95% of anode materials sales worldwide. Japanese enterprises are in a leading position technologically while China boasts obvious cost advantages in anode materials production because of abundant graphite mineral resources.\n\nFrom 2016 to 2020, China's anode material shipments jumped year by year, hitting 365,000 tons in 2020 with the growth rate exceeding expectations, mainly thanks to the substantial growth in the demand for lithium batteries in various fields around the world. Driven by the demand from new energy vehicles and energy storage batteries, China's production of anode materials is expected to register a high CAGR of 30-35% in upcoming years, and then reach 295 kilotons in 2026.\n\nAt present, the most widely used anode materials are still natural graphite and artificial graphite. From the perspective of product structure, the market share of artificial graphite further increased to 84% in 2020. Affected by the replacement of main domestic cylindrical battery models for shipment and the suspended upgrade of the high nickel system for square power batteries, other anode materials represented by silicon-based anode materials failed to achieve the expected growth with a declining market share. The drop in the proportion of natural graphite was mainly because mainstream battery companies purchased mixed materials of natural and artificial graphite in 2020, which reduced the procurement of pure natural graphite to a certain extent.\n\nThe price of anode materials has kept falling since 2017Q4. On the whole, the price of artificial graphite has dipped slightly faster than that of natural graphite. This trend will be more obvious as the industry's graphite capacity is released substantially. However, by integrating resources and technological advantages, top companies will maintain their profitability and still see considerable growth. Currently, the coke price tends to go down, which will help anode material companies reduce the cost of raw materials to offset the pressure brought by the price drop.\n\nFrom the perspective of market competition, the combined market share of TOP 3 companies in China's anode material market decreased from 57% in 2019 to 53% in 2020, marking a lower concentration in the anode material market, because the demand for various anode materials in the second half of the year was huge, but the capacity of top enterprises was insufficient, which pushed up the capacity utilization rate of the second- and third- echelon companies to swell. In addition, companies engaged in low-power communication energy storage lithium batteries and the like with low performance requirements and high price sensitivity preferred to purchase from the second- and third- echelon anode material companies.\n\nThe industry presents a pattern of `three big companies and three small companies`. The first echelon includes three major companies: the natural graphite leader Shenzhen BTR New Energy Materials, the artificial graphite tycoon Shanghai Shanshan Technology and the high-end artificial anode material giant Jiangxi Zichen Technology, of which the latter two pose duopoly in the artificial graphite market, closely followed by Shenzhen BTR New Energy Materials with high-quality customers.\n\nEach of them shipped more than 40,000 tons of anode materials in 2019. The second echelon consists of three small companies --- Hunan Shinzoom Technology, Dongguan Kaijin, and Shenzhen XFH Technology, with the respective shipments of over 10,000 tons in 2019. Although Dongguan Kaijin ranks among the top three by shipments, it still falls into the second echelon due to its heavy reliance on a single major customer and low-end products.\n\nThe capacity of Shenzhen BTR New Energy Materials, Shanshan Technology, Jiangxi Zichen Technology, and Dongguan Kaijin totaled 490,000 tons in 2020 when the industry's output hit 365,000 tons. In 2021, the penetration rate of new energy vehicles soars, and major anode material companies plan to expand production by over 1 million tons.\n\nAmong them, Shenzhen BTR New Energy Materials will add 270,000 tons, Shanshan Technology 260,000 tons, Jiangxi Zichen Technology and Dongguan Kaijin 200,000 tons each. Sufficient capacity can meet the fast-growing demand.\n\nThe report highlights the following:\n\nMarket size and forecast, competitive landscape, new anode materials development, etc. of global lithium-ion battery anode materials industry;Policies, market size and forecast, competitive landscape, price trend, etc. of China's lithium-ion battery anode materials industry;Market size, competitive landscape, imports & exports, price trend, etc. of global and China's raw material industries (graphite, silicon carbide, lithium titanate, graphene, etc.) of anode materials;Market size, competitive landscape, analysis and forecast for the demand for anode materials, etc. of global and China's lithium battery industries;Profile, anode materials business, operation, etc. of 25 global and Chinese anode materials manufacturers;Profile, lithium titanate materials business, operation, etc. of 3 global and Chinese lithium titanate materials producers.\n\nKey Topics Covered:\r\n\r\n1. Overview of Lithium-ion Battery Anode Material\r\n1.1 Definition\r\n1.2 Industry Chain\r\n1.3 Silicon-based anode material\r\n\r\n2. Global Lithium-ion Battery Anode Materials Market\r\n2.1 Market Size\r\n2.2 Competitive Landscape\r\n2.3 New Anode Materials\r\n2.3.1 Lithium Titanate\r\n2.3.2 Hard Carbon\/Soft Carbon\r\n2.3.3 Silicon-based Composites\r\n2.3.4 Graphene\r\n\r\n3. Lithium-ion Battery Anode Materials Market\r\n3.1 Industrial Policy\r\n3.2 Market Size\r\n3.3 Competitive Landscape\r\n\r\n4. Upstream Raw Materials Market\r\n4.1 Graphite\r\n4.1.1 Global Market\r\n4.1.2 Chinese Market\r\n4.2 Silicon Carbide\r\n4.2.1 Global Market\r\n4.2.2 Chinese Market\r\n4.3 Lithium Titanate\r\n4.3.2 Chinese Market\r\n4.3.1 Global Market\r\n4.4 Graphene\r\n4.5 Hard Carbon\/Soft Carbon\r\n4.6 Mesocarbon Microbead (MCMB)\r\n\r\n5. Downstream Lithium-ion Battery Market\r\n5.1 Market Size\r\n5.1.1 Global\r\n5.1.2 China\r\n5.2 Market Structure\r\n5.3 Competitive Landscape\r\n5.3.1 Global\r\n5.3.2 China\r\n5.4 Demand Analysis\r\n5.4.1 Consumer Electronics (3C)\r\n5.4.2 Electric Vehicle\r\n5.4.3 Industrial Energy Storage\r\n\r\n6. Global Major Anode Material Companies\r\n6.1 Showa Denko\r\n6.2 Mitsubishi Chemical\r\n6.3 Nippon Carbon\r\n6.4 JFE Chemical\r\n6.5 Kureha\r\n6.6 Others\r\n6.6.1 3M\r\n6.6.2 Shin-Etsu Chemical\r\n6.6.3 XG Sciences\r\n6.6.4 Nexeon\r\n6.6.5 Amprius\r\n\r\n7. Major Chinese Anode Material Companies\r\n7.1 BTR New Materials Co., Ltd.\r\n7.2 Ningbo Shanshan Co., Ltd.\r\n7.3 Hunan Shinzoom Technology Co., Ltd.\r\n7.4 Jiangxi Zichen Technology Co., Ltd.\r\n7.5 Jiangxi Zhengtuo New Energy Technology Co., Ltd.\r\n7.6 Shijiazhuang Shangtai Tech\r\n7.7 Shenzhen Sinuo Industrial Development Co., Ltd.\r\n7.8 Guangdong Kaijin New Energy Technology Corp., Ltd.\r\n7.9 Shenzhen Xiangfenghua Technology Co., Ltd. (XFH)\r\n7.10 Others\r\n7.10.1 Morgan AM&T Hairong Co., Ltd.\r\n7.10.2 Dalian Hongguang Lithium Co., Ltd.\r\n7.10.3 Tianjin Kimwan Carbon Technology and Development Co., Ltd.\r\n\r\n8. Major Lithium Titanate Material Companies\r\n8.1 Ishihara Sangyo Kaisha, Ltd.\r\n8.2 Xing Neng New Materials Co., Ltd.\r\n8.3 Altairnano Inc\n\nFor more information about this report visit https:\/\/www.researchandmarkets.com\/r\/e7z6i3","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/02\/04\/2379154\/28124\/en\/Global-and-China-Lithium-ion-Battery-Anode-Material-Market-Report-2021-2026-Featuring-Major-Anode-Material-Companies-and-Lithium-Titanate-Material-Companies.html","symbols":[],"tags":["ANODE MATERIAL","CATHODE MATERIAL","LITHIUM BATTERIES","LITHIUM BATTERY","LITHIUM ION BATTERIES","LITHIUM ION BATTERY","RESEARCH ANALYSIS AND REPORTS","RESEARCH AND MARKETS","STORAGE BATTERY"],"sentiment":{"polarity":0.996,"neg":0.025,"neu":0.886,"pos":0.09}},{"date":"2022-02-03T19:20:00+00:00","title":"Standard Lithium shares slide 22% after short seller says its technology does not work","content":"Shares of Canadian company Standard Lithium Ltd. slid 22% Thursday, after short seller Hindenburg Research published a report alleging the company's technology does not work and that's it's seeking to profit from the hype around lithium batteries for electric vehicles.","link":"https:\/\/finance.yahoo.com\/m\/75f98c2c-ddf8-3b4a-9632-9dbbfa0d7175\/standard-lithium-shares-slide.html","symbols":["LNXSF.US","LXS.F","LXS.XETRA"],"tags":["DLE","HINDENBURG RESEARCH","LITHIUM BATTERIES","STANDARD","STANDARD LITHIUM"],"sentiment":{"polarity":0.625,"neg":0,"neu":0.879,"pos":0.121}},{"date":"2022-02-02T11:43:00+00:00","title":"World Module-less (Cell to Pack) Battery Structure Market Report 2021 Featuring Leading Manufacturers - BYD, CATL, and LG Chem","content":"Dublin, Feb.  02, 2022  (GLOBE NEWSWIRE) -- The \"Trends and Growth Opportunities in Module-less (Cell to Pack) Battery Structure\" report has been added to ResearchAndMarkets.com's offering.\n\nLeading battery manufacturers (e.g., BYD, CATL, and LG Chem) and original equipment manufacturers (OEMs) (e.g., BYD, Daimler, and VW) are now looking at next-generation battery technology that focuses on module-less battery pack technology, which integrates cells directly into the pack without having to package it into modules.\n\nIn the module-less battery design, mass energy density is increased, volume utilization efficiency is improved by 15 to 20%, and moving parts are reduced by 40%. With this, the cell level energy density can reach 240 watt-hours per kilogram (Wh\/kg) and will likely reach 350 Wh\/kg in the next 3 to 4 years. The module-less battery pack is estimated to accommodate two times the number of cells, compared to traditional battery packs with modules.\n\nVarious names by different manufacturers recognize module-less battery technology; however, the overall concept follows a reduction on modules in the battery pack, which directly results in a price reduction by 25 to 30% because of the reduced number of connections and circuits.\n\nKey Topics Covered:\r\n\r\n1. Strategic Imperatives\n\nWhy Is It Increasingly Difficult to Grow?The Strategic ImperativeThe Impact of the Top 3 Strategic Imperatives in the EV Battery IndustryGrowth Opportunities Fuel the Growth Pipeline Engine\n\n2. Growth Opportunity Analysis, EV Battery Technology\n\nEV Battery Technology Scope of AnalysisLithium-ion Battery Classification by Battery TypePreferred Lithium Battery ChemistriesKey Competitors for EV Battery Cell Suppliers\n\n3. EV Battery Market Outlook - Sales Trends and Forecast\n\nKey Growth Metrics for EV BatteriesEV Battery CapacityPercent EV Battery Capacity by ChemistryTop 10 EV Battery Cell Suppliers - 2020Top 10 Cell Consumers (EV Manufacturers)Average Battery Capacity Forecast by EV TypeWho Supplies to Whom - 2020Growth Drivers for CTP Technology in EV BatteriesGrowth Restraints for CTP Technology in EV Batteries\n\n4. Future of Module-less EV Battery Technology\n\nMajor TrendsCurrent and Future TrendsComparison of Traditional and Module-less Battery PacksTechnological Advancements in Module-less StructureModule-less Structure Adoption TimelineInnovators in CTP Technology - Leading CompaniesCurrent Benchmarking of OEM Sourcing Strategies\n\n5. Cell to Pack Integration and Thermal Management\n\nCTP Battery Setup and IntegrationBattery Thermal Management System - Technology RoadmapWireless BMS (WBMS)WBMS - System FunctionsCase Study - TESLACase Study - BYD\n\n6. Market Estimates - Module-less Structure Adoption\n\nBattery Manufacturer (Top 5 In Chart)Global Lithium-based Battery Production Forecast ScenarioExpected Market Share of CTP\n\n7. Growth Opportunity Universe, Module-less Battery Structure\n\nGrowth Opportunity 1 - Adoption of Module-less Structure, 2021Growth Opportunity 2 - Multiple Battery Chemistries, 2021Growth Opportunity 3 - Robust BMS, 2021\n\n8. Next Steps\n\nFor more information about this report visit https:\/\/www.researchandmarkets.com\/r\/apjy7y","link":"https:\/\/www.globenewswire.com\/news-release\/2022\/02\/02\/2377457\/28124\/en\/World-Module-less-Cell-to-Pack-Battery-Structure-Market-Report-2021-Featuring-Leading-Manufacturers-BYD-CATL-and-LG-Chem.html","symbols":[],"tags":["BATTERY MANUFACTURER","BATTERY TECHNOLOGY","LITHIUM BATTERIES","LITHIUM ION BATTERIES","LITHIUM ION BATTERY","NEXT GENERATION BATTERY","RESEARCH ANALYSIS AND REPORTS","RESEARCH AND MARKETS"],"sentiment":{"polarity":0.993,"neg":0.006,"neu":0.861,"pos":0.133}},{"date":"2022-01-26T14:30:00+00:00","title":"Alpine 4 Holdings (ALPP) Announces the Formation of RCA Batteries Corporation, a Joint Venture Between its Subsidiaries', RCA Commercial and Elecjet","content":"PHOENIX, Jan. 26, 2022 \/PRNewswire\/ -- Alpine 4 Holdings, Inc. (Nasdaq: ALPP), a leading operator and owner of small market businesses, has announced the formation of RCA Batteries Corporation (RCA Batteries), a joint venture between RCA Commercial and Elecjet. RCA Batteries will reside under Alpine 4's subsidiary RCA Commercial and will operate as the manufacturer and distributor of the ElecJet family of graphene batteries. Elecjet will continue as a manufacturer of electronic components, a research and development company, and the legal entity holding the company's intellectual property, including patents and software copyrights. Samuel Gong will be the President of RCA Batteries while remaining as President of Elecjet. Newest Alpine4 logo\n\nRCA Batteries now represents four types of battery cells\/products: The Apollo Ultra, a battery pack for everyday use, which Forbes has proclaimed as \"Eye-Poppingly Fast.\" Two types of cylindrical cells; a 18650 Graphene Lithium battery cell and a 21700 Graphene Lithium battery cell, both intended for commercial customers in several sectors. Finally, the company plans to begin small volume production of its graphene enhanced Solid-State Batteries in Q2 2022 with the goal to bring main scale production in 2023.\n\nAll the Company's cylindrical graphene enhanced batteries cells boast charging rates of least 2C and can go as high as 8C depending on the customer's application needs. These speeds are between double and twenty times faster than the traditional Lithium battery cell can charge at. The company's graphene solid-state battery can charge at rates up to 30C. These batteries also have industry-leading discharge rates for more efficient energy usage and power distribution.\n\nSam Gong, President of Elecjet (and now RCA Batteries) commented: \"Our Graphene solid-state technology will help us improve energy density by about 10% compared to some of the most energy-dense batteries on the market, and upwards of 80%+ compared to some applications. Elecjet prides itself on not just boasting about what we can do in a lab, but what we can produce on a large commercially viable scale. We're looking forward to getting these batteries in our customer's products throughout 2022.\"\n\nStory continues\n\nhttps:\/\/www.forbes.com\/sites\/davidphelan\/2021\/12\/16\/Elecjet-apollo-ultra-power-bank-review-eye-poppingly-fast\/?sh=7ff02d83fa0d\n\nKent B. Wilson, Alpine 4 CEO, had this to say: \"RCA Batteries was envisioned long before we closed on our subsidiary RCA Commercial in early December 2021. The goal was to enhance the amazing capabilities of the Elecjet family of graphene-enhanced batteries and attach it to a well-known name in the electronics industry. The merits of this joint venture are immense. RCA Batteries with its graphene enhanced battery cells, the manufacturing power of our subsidiaries RCA Commercial and Quality Circuit Assembly, will allow RCA Batteries the ability to start producing best in class battery cells for varying applications in the near future. The goal is to bring full manufacturing to the United States by Q4 2023. From a market perspective, our sights are set on the ESS (energy storage systems) market, including power walls, battery cells for EV's, and various other commercial applications, as well as the electrification of Vayu Aerospace's drones, including the newest fleet of drones under development.\"\n\nAbout RCA Commercial Electronics: RCA Commercial Electronics is the continuance of the legacy of the US-based conglomerate RCA Corporation which dominated the electronics industry of the 20th century. RCA Commercial acquired the rights to the RCA name brand in 2004 and the LG lighting division to which it acquired the name brand and intellectual property in 2016. The RCA Corporation was a major American electronics company, which was founded as the Radio Corporation of America in 1919. It was initially a patent trust owned by General Electric (GE), Westinghouse, AT&T Corporation, and United Fruit Company. But in 1932, RCA became an independent company, and this storied American company began.\r\nhttps:\/\/www.rcacommercialtv.com\/about\/\n\nAbout Elecjet: Elecjet specializes in developing super-fast charging, graphene battery solutions that offer convenience in the palm of your hands. For the past 11 years, our research and development team have been committed to advancing our products' charging performance and battery life.\r\nhttps:\/\/elecjet.com\/\n\nAbout Alpine 4 Holdings: Alpine 4 Holdings, Inc. (ALPP) is a NASDAQ traded conglomerate that acquires businesses that fit into its disruptive DSF business model of Drivers, Stabilizers, and Facilitators. At Alpine 4, we understand the nature of how technology and innovation can accentuate a business. Our focus is on how the adaptation of new technologies, even in brick-and-mortar businesses, can drive innovation. We also believe that our holdings should benefit synergistically from each other, have the ability to collaborate across varying industries, spawn new ideas, and create fertile ground for competitive advantages.\n\nFour principles at the core of our business are Synergy. Innovation. Drive. Excellence. At Alpine 4, we believe synergistic innovation drives excellence. By anchoring these words to our combined experience and capabilities, we can aggressively pursue opportunities within and across vertical markets. We deliver solutions that not only drive industry standards, but also increase value for our shareholders.\n\nContact: Investor Relations\r\ninvestorrelations@alpine4.com\r\nwww.alpine4.com\n\nForward-Looking Statements: Certain statements and information in this press release may constitute \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended (the \"Securities Act\"), Section 21E of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), and the Private Securities Litigation Reform Act of 1995. The information disclosed in this press release is made as of the date hereof and reflects Alpine 4 most current assessment of its historical financial performance. Actual financial results filed with the SEC may differ from those contained herein due to timing delays between the date of this release and confirmation of final audit results. These forward-looking statements are not guarantees of future performance and are subject to uncertainties and other factors that could cause actual results to differ materially from those expressed in the forward-looking statements including, without limitation, the risks, uncertainties, including the uncertainties surrounding the current market volatility, and other factors the Company identifies from time to time in its filings with the SEC. Although Alpine 4 believes that the assumptions on which these forward-looking statements are based are reasonable, any of those assumptions could prove to be inaccurate and, as a result, the forward-looking statements based on those assumptions also could be incorrect. You should not place undue reliance on these forward-looking statements. The forward-looking statements contained in this release are made as of the date hereof, and Alpine 4 disclaims any intention or obligation to update the forward-looking statements for subsequent events. Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/alpine-4-holdings-alpp-announces-the-formation-of-rca-batteries-corporation-a-joint-venture-between-its-subsidiaries-rca-commercial-and-elecjet-301468674.html\n\nSOURCE Alpine 4 Holdings, Inc.","link":"https:\/\/finance.yahoo.com\/news\/alpine-4-holdings-alpp-announces-143000801.html","symbols":["ALPP.US"],"tags":["ALPINE 4","ALPINE 4 HOLDINGS","INC","LITHIUM BATTERY","RCA"],"sentiment":{"polarity":0.999,"neg":0.015,"neu":0.872,"pos":0.113}},{"date":"2022-01-24T17:00:00+00:00","title":"LCA Quantifies Cinovec Lithium Chemical Production CO2 Emissions and Mitigation Scenarios Identified to Produce Low Carbon Products","content":"Figure 1 GWP Impact of LiOH produced from Cinovec PFS (2019), the theoretical Cinovec Decarbonised Case, for Chilean Brine, Australian Spodumene converted in China and US Sedimentary Clay. Source: Minviro\n\nGWP Impact of LiOH produced from Cinovec PFS (2019), the theoretical Cinovec Decarbonised Case, for Chilean Brine, Australian Spodumene converted in China and US Sedimentary Clay. Source: Minviro\n\nCEZ to Provide Green Power to Project\n\nHIGHLIGHTS\n\nCinovec’s Global Warming Potential has been modelled using ISO-compliant LCA by consultancy Minviro Ltd, providing clear resolution of the drivers of the project’s emissions.  GWP Impact Mitigation Scenarios identified for the Cinovec Project, potentially including solar power, electric mining fleet, Hypex Bio explosives and use of green hydrogen for thermal energy (Cinovec Decarbonised Case) which could make Cinovec’s lithium chemicals have some of the lowest CO2 intensity in the world if all impact mitigation strategies are pursued.  CEZ plans to provide 100% renewable energy to power the mine, the Front-End Comminution and Beneficiation (FECAB) and Lithium Chemical Plants (LCP)  LCA also assessed Acidification Potential (AP), Water Use and Land Use (per ISO standards).\n\nAP is comparable to Chilean Brine but only 13% of the equivalent for Australian spodumene processed in China.  Cinovec Water Use projected to be lower than all benchmarks and <5% of Chilean Brine Water Use even when water evaporated from the brine is not included in the water use calculation.\n\nPERTH, Australia, Jan. 24, 2022 (GLOBE NEWSWIRE) -- European Metals Holdings Limited (“EMH”, or “the Company”) (ASX & AIM: EMH, OTC – Nasdaq Intl ADS: EMHXY) is pleased to provide an update in relation to the outcomes of the Life Cycle Assessment conducted by Minviro in relation to lithium battery chemicals production from the Cinovec mine.\n\nKeith Coughlan, Executive Chairman, said “We are extremely pleased that the Minviro LCA has confirmed what we have believed to be the case for a long time – Cinovec has the potential to have the lowest overall environmental impacts compared to other conventional lithium battery metals projects not only in Europe but also on a global basis. With the use of solar power and other optimisations the Cinovec Project will set a standard by which all other conventional lithium producers could be judged. We expect the environmental credentials of the Cinovec Project will help make its product valuable to end users, particularly in light of the new EU requirements in relation to greenhouse emissions. Not only does the optimised model demonstrate very low CO2 emissions, the Project also delivers excellent results with regards to acidification and water consumption. As Cinovec is an historic underground mine with minimal social and environmental impacts, the entire ESG credentials of the Project are very strong.\n\nStory continues\n\nMINE, FECAB AND LCP TO BE POWERED BY SOLAR POWER PLANT\n\nCEZ, EMH’s joint venture partner in the Cinovec Lithium Project, plans to provide 100% renewable energy to power the mine, the Front-End Comminution and Beneficiation (FECAB) And Lithium Chemical Plants (LCP). CEZ currently owns renewables installations with aggregate power generation capacity of 1720 MW. This capacity will increase by 1500 MW by 2025.\n\nThe renewable energy sources will be capable of providing all the required power for all aspects of the Cinovec Project including the mine, the FECAB plant as well as the Lithium Chemical Plant under normal operating conditions. The Company is also considering the use of electric mining equipment to further reduce the CO2 footprint at Cinovec.\n\nCINOVEC LIFE CYCLE ASSESSMENT\n\nAs previously announced, Minviro (a UK-based and globally recognised sustainability and life cycle assessment consultancy) was engaged to conduct a Life Cycle Assessment (LCA) for the Cinovec Project’s proposed lithium battery-grade chemicals, Lithium Carbonate (Li2CO3) and Lithium Hydroxide Monohydrate (LiOH) (refer to the Company’s ASX release dated 10 June 2021). The LCA was completed at the end of 3Q21 and the full results underwent independent external QA\/QC peer review, including ISO compliance review, before finalisation.\n\nMinviro also assessed GWP reduction strategies being advanced by Geomet management (as part of the ongoing Definitive Feasibility Study) to reduce the carbon footprint of Cinovec, including full electrification of the mine and mining vehicle fleet; sourcing all electrical power for both the mine and lithium processing plant from a proposed co-developed photovoltaic cell array adjacent to the Cinovec processing plant; and green hydrogen as replacement for conventional gas in the ore roasting process (Decarbonization Case).\n\nThe LCA was conducted according to the requirements of the ISO-14040:2006 and ISO-14044:2006, including a third-party review from LCA experts to ensure that the LCA study is scientifically robust.\n\nResults of the Life Cycle Assessment\n\nLiOH Production\n\nLiOH products can have different environmental impacts depending on the natural resource they are produced from and the process technology chosen in flowsheets. A comparison of how the Cínovec LiOH product will compare to existing process pathways is shown below in Figure 1.\n\nFor all five production routes shown in Figure 1 the chemical processing is the largest driver of the impact. Transport is minimal for all routes except for the Australian spodumene route, where the spodumene concentrate is transported to China; and the LiOH product from all production routes is transported 400 km from the Port of Rotterdam to provide the GWP impacts as delivered at the same end-users.\n\nFigure 1 is available at https:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/9e7617d9-a206-439a-b1cd-3af29a15145c\n\nFULL ANNOUNCEMENT\n\nhttps:\/\/www.investi.com.au\/api\/announcements\/emh\/7b59ad15-7be.pdf\n\nCONTACT \r\nFor further information on this update or the Company generally, please visit our website at www.europeanmet.com.\n\nENQUIRIES:\n\nEuropean Metals Holdings Limited Keith Coughlan, Executive Chairman  Tel: +61 (0) 419 996 333\r\nEmail: keith@europeanmet.com  Kiran Morzaria, Non-Executive Director Tel: +44 (0) 20 7440 0647 Dennis Wilkins, Company Secretary Tel: +61 (0) 417 945 049\r\nEmail: dennis@europeanmet.com","link":"https:\/\/finance.yahoo.com\/news\/lca-quantifies-cinovec-lithium-chemical-170000186.html","symbols":["E86.F","E86.STU","E861.F","EMH.AU","EMH.LSE","EMHLF.US","EMHXY.US","ERPNF.US"],"tags":["CEZ","CHEMICAL PLANTS","CINOVEC DECARBONISED CASE","CINOVEC PFS","CINOVEC PROJECT","EUROPEAN METALS HOLDINGS LIMITED","LCA","LIFE CYCLE ASSESSMENT","LITHIUM BATTERY","LITHIUM CHEMICAL PLANT","SOLAR POWER","THE PROJECT"],"sentiment":{"polarity":0.995,"neg":0.016,"neu":0.908,"pos":0.076}},{"date":"2022-01-17T21:00:00+00:00","title":"Top 10 Lithium Stocks in LIT, the World's First Lithium ETF","content":"The Lithium & Battery Tech ETF's two largest holdings are miner Albemarle and Tesla, while a Warren Buffet-owned stock ranks No. 6.","link":"https:\/\/finance.yahoo.com\/m\/272c2e00-7902-32c5-9627-ede6f2997661\/top-10-lithium-stocks-in-lit%2C.html","symbols":["GSPC.INDX","LAC.TO","LAC.US","TL0.F","TL0.XETRA","TSLA.MX","TSLA.US","TSLA34.SA","WUC1.F"],"tags":["CHINA","LITHIUM BATTERIES","LITHIUM-ION BATTERIES","STOCK HOLDINGS"],"sentiment":{"polarity":-0.296,"neg":0.104,"neu":0.896,"pos":0}},{"date":"2022-01-13T21:15:00+00:00","title":"Albemarle and 6K Sign Joint Development Agreement to Develop Novel Lithium Battery Materials","content":"Albemarle to invest in 6K and sponsor development of UniMelt® system for advanced, sustainable materials production\n\nCHARLOTTE, N.C. and NORTH ANDOVER, Mass., Jan. 13, 2022 \/PRNewswire\/ -- Albemarle Corporation (NYSE: ALB), a global leader in advanced lithium materials, and 6K, an emerging leader of microwave-controlled plasma technology, today announced they have signed a joint development agreement (JDA) to explore the use of 6K's patented UniMelt® advanced, sustainable materials production platform to develop novel lithium battery materials through potentially disruptive manufacturing processes. Albemarle Corp. Logo. (PRNewsFoto\/Albemarle Corporation)\n\n\"Albemarle is developing advanced lithium materials to enable breakthrough levels of lithium-ion battery performance. The UniMelt plasma technology opens new reaction pathways for lithium material innovation. Our collaboration with 6K has significant potential,\" said Dr. Glen Merfeld, Chief Technical Officer for Albemarle Lithium.\n\nAt the same time, 6K's UniMelt platform promises benefits for sustainable manufacturing. For instance, if a conventional 16-GWh battery cathode production plant was converted to 6K's UniMelt platform, it would reduce CO2 emissions by 70% (equal to 10M trees per year); lower water consumption by 90% (6.3M barrels per year) and reduce wastewater production by 100% (7M barrels per year) while requiring a 50% smaller factory footprint.\n\n\"6K technology creates the opportunity for modular manufacturing allowing for a smaller footprint, faster construction, and new models for localization. The collaboration sets a strong foundation not only for advanced material development but also for future commercialization,\" Merfeld said.\n\n\"We are pleased to partner with a world leader in lithium technology and production,\" commented Dr. Aaron Bent, 6K's CEO. \"The agreement with Albemarle highlights the commitment of both organizations to drive battery material performance enhancements while introducing more sustainable production methods. We are thrilled to welcome Albemarle to our investor group and our engineers are eager to work alongside Albemarle's team.\"\n\nStory continues\n\nIn addition to the JDA, Albemarle has made an undisclosed investment in 6K through Volta Energy Technologies. An existing financial investor in 6K, Volta is a venture capital firm launched in 2017 that also connects strategic investors like Albemarle with well-researched investment opportunities in the energy storage sector. \"Albemarle's engagement with 6K is yet another example of Albemarle's commitment to maintain its technology leadership in lithium,\" said Dr. Jeff Chamberlain, CEO of Volta Energy Technologies. \"Volta is thrilled that 6K continues to work directly with world leaders in the development of its ground-breaking manufacturing technology.\"\n\nAbout Albemarle\r\nAlbemarle Corporation (NYSE: ALB) is a global specialty chemicals company with leading positions in lithium, bromine and catalysts. We think beyond business as usual to power the potential of companies in many of the world's largest and most critical industries, such as energy, electronics, and transportation. We actively pursue a sustainable approach to managing our diverse global footprint of world-class resources. In conjunction with our highly experienced and talented global teams, our deep-seated values, and our collaborative customer relationships, we create value-added and performance-based solutions that enable a safer and more sustainable future.\n\nWe regularly post information to www.albemarle.com, including notification of events, news, financial performance, investor presentations and webcasts, non-GAAP reconciliations, SEC filings and other information regarding our company, its businesses, and the markets it serves.\n\nForward-Looking Statements Some of the information presented in this press release, including, without limitation, information related to the exploration of the use of 6K's patented UniMelt® advanced, sustainable materials production platform to develop novel lithium battery materials through potentially disruptive manufacturing processes; Albemarle's developing advanced lithium materials in an effort to enable breakthrough levels of lithium-ion battery performance; the UniMelt plasma technology opening new reaction pathways for lithium material innovation; Albemarle's collaboration with 6K having significant potential; UniMelt's platform promising benefits for sustainable manufacturing (and the related metrics associated therewith); 6K's technology creating the opportunity for modular manufacturing allowing for a smaller footprint, faster construction, and new models for localization; the collaboration setting a strong foundation for advanced material development and for future commercialization; and all other information relating to matters that are not historical facts may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Actual results could differ materially from the views expressed herein. Factors that could cause Albemarle's actual results to differ materially from the outlook expressed or implied in any forward-looking statement include, without limitation: Albemarle and 6K may be unsuccessful in using 6K's patented UniMelt® advanced, sustainable materials production platform to develop novel lithium battery materials through potentially disruptive manufacturing processes; changes in economic and business conditions; changes in financial and operating performance of its major customers and industries and markets served by it; the timing of orders received from customers; the gain or loss of significant customers; competition from other manufacturers; changes in the demand for its products or the end-user markets in which its products are sold; limitations or prohibitions on the manufacture and sale of its products; availability of raw materials; increases in the cost of raw materials and energy, and its ability to pass through such increases to its customers; changes in its markets in general; fluctuations in foreign currencies; changes in laws and government regulation impacting its operations or our products; the occurrence of regulatory actions, proceedings, claims or litigation; the occurrence of cyber-security breaches, terrorist attacks, industrial accidents, natural disasters or climate change; hazards associated with chemicals manufacturing; the inability to maintain current levels of product or premises liability insurance or the denial of such coverage; political unrest affecting the global economy, including adverse effects from terrorism or hostilities; political instability affecting its manufacturing operations or joint ventures; changes in accounting standards; the inability to achieve results from its global manufacturing cost reduction initiatives as well as its ongoing continuous improvement and rationalization programs; changes in the jurisdictional mix of its earnings and changes in tax laws and rates; changes in monetary policies, inflation or interest rates that may impact its ability to raise capital or increase its cost of funds, impact the performance of its pension fund investments and increase its pension expense and funding obligations; volatility and uncertainties in the debt and equity markets; technology or intellectual property infringement, including cyber-security breaches, and other innovation risks; decisions it may make in the future; the ability to successfully execute, operate and integrate acquisitions and divestitures; uncertainties as to the duration and impact of the coronavirus (COVID-19) pandemic; and the other factors detailed from time to time in the reports Albemarle files with the SEC, including those described under \"Risk Factors\" in its Annual Report on Form 10-K and its Quarterly Reports on Form 10-Q. These forward-looking statements speak only as of the date of this press release. Albemarle assumes no obligation to provide any revisions to any forward-looking statements should circumstances change, except as otherwise required by securities and other applicable laws.\n\nAbout 6K 6K represents 6000 degrees, setting 6K technology apart from all others. It is the temperature of operation of UniMelt (5778°K to be exact), the world's only microwave production-scale plasma, and also is the temperature of the surface of the sun.\n\n6K uses proprietary, advanced plasma processing and industrial systems to create materials that are enabling the next generation of commercial and consumer products. The company's continuous UniMelt process allows for complete and unprecedented control of the entire materials engineering process to produce materials at exact specifications.\n\nThe 6K Additive division is an ISO9001 facility, reclaims and processes over a million pounds of Ti-64 per year, and has recently built and commissioned a state-of-the-art, 48,000-square-foot production facility for additive manufacturing powders.\n\nTo learn more about 6K, please visit www.6Kinc.com\n\nAbout Volta Energy Technologies Volta Energy Technologies is a venture capital firm spun out of the U.S. Department of Energy's Argonne National Laboratory, focused on identifying and investing in breakthrough energy storage and battery innovations after performing deep diligence with the support of unparalleled global research institutions. Seeded by strategic corporate investors Albemarle, Exelon, Equinor and Hanon Systems, Volta connects innovators with investors and relevant industries that are adopting energy storage technology, delivering strategic returns for all. To learn more, visit plusvolta.com and follow @VoltaLink on Twitter.\n\nTo learn more about Volta, please visit https:\/\/volta.vc\/\n\nNotes for editors\n\nAlbemarle press releases are available here.\n\n6K press releases are available here.\n\nVolta press releases are available here. 6K Logo Cision\n\nView original content to download multimedia:https:\/\/www.prnewswire.com\/news-releases\/albemarle-and-6k-sign-joint-development-agreement-to-develop-novel-lithium-battery-materials-301460880.html\n\nSOURCE Albemarle Corporation","link":"https:\/\/finance.yahoo.com\/news\/albemarle-6k-sign-joint-development-211500786.html","symbols":["ALB.US","AMC.F"],"tags":["6K","ALBEMARLE","ALBEMARLE CORPORATION","LITHIUM BATTERY","MANUFACTURING","MANUFACTURING PROCESSES","SUSTAINABLE MATERIALS PRODUCTION","UNIMELT","VOLTA ENERGY TECHNOLOGIES"],"sentiment":{"polarity":0.999,"neg":0.056,"neu":0.799,"pos":0.145}}]