[{"date":"2022-04-11T15:00:00+00:00","title":"Arena Minerals Drills 300 Metre Gravel Aquifer Averaging 503 Mg\/L Lithium at Sal de la Puna Project; Mobilizes Additional Drill Rigs","content":"Arena Minerals Inc.\n\nTORONTO, April 11, 2022 (GLOBE NEWSWIRE) -- Arena Minerals Inc. (\"Arena\" or the \"Company\") (TSX-V: AN) is pleased to announce it has completed drilling of its first diamond drill hole (DD-02) at the Sal de la Puna Project (“SDLP Project”) located in the Pastos Grandes basin within Salta province, Argentina. The diamond drill hole is located on the Almafuerte claim and intersected a continuous brine column from 140 metres to the total drilled depth of 646 metres. The entire sampled brine column averaged 496 milligrams per litre (“mg\/l”) lithium (“Li”).\n\nAn uninterrupted gravel aquifer was intersected between 334 metres and 634 metres down hole, representing the thickest gravel sequence drilled in the basin. The gravel aquifer averaged 503 mg\/l Li with grades as high as 557 mg\/l Li at 550 metres below surface. Gravel and sand aquifers typically have favourable effective porosity values and high flow rates, which translate to highly productive wells. DD-02 was completed as an observation well with 2-inch diameter blank and screened PVC casing to 450 m depth.\n\nWilliam Randall, President & CEO of Arena, stated, “This first drill hole completed by Arena exceeds our expectations. The coarse gravel aquifer, where higher flow rates are typically found, appears to be thicker in our end of the Pastos Grandes basin with high grade lithium values and favourable geochemistry. We kept the drill turning past our target depth to determine the total thickness of this gravel sequence; however, the brine column remains open at depth for future potential resource expansion.” He added, “We have now mobilized an additional drill rig to ensure we meet our development timelines.”\n\nDepth specific brine sampling was caried out in DD-2 over the entire brine column using double and simple packer sampling systems. The brine column averaged magnesium to lithium ratios of 4.5 to 1 and sulphate to lithium ratios of 15 to 1.\n\nEduardo Morales, Executive Chairman of Arena, added, “In addition to excellent lithium grades, we are very pleased with the brine geochemistry. The magnesium and sulphate ratios are within those currently used in our pilot facilities giving us great confidence that our objective of producing technical grade lithium chloride (6% Li) is achievable from the drilled aquifers.”\n\nStory continues\n\nMobilization of two additional drills\n\nThe Company is also pleased to announce that two additional drill rigs have been mobilized to site. One diamond drill rig is currently set up at DD-01, located on the Graciela claim, and has a target depth of 550 metres. The depth of the hole may be extended if favourable lithologies are encountered, as happened in DD-02 in the adjacent Almafuerte claim.\n\nA second rotary drill is scheduled to mobilize in three weeks to Almafuerte to drill a production well (P-1) 15 metres away from DD-02. The well has a target depth of 450 metres and looks to test the productive capabilities of the gravel aquifer intersected in DD-02 by completing pumping tests using the neighbouring DD-02 as a monitoring well.\n\nArena is operating the drill program on behalf of Sal de la Puna Holdings Ltd., which is jointly owned by Arena (65%) and Ganfeng New Energy Technology Development (Suzhou) Co., Ltd. (“Ganfeng Lithium”; 1772.HK; OTCQX: GNENF) (35%).\n\nThe drill program is focused on the Almafuerte and Graciela blocks which border Lithium America’s (TSX: LAC; NYSE: LAC) Pastos Grandes project to the south and south-east and consists of 3,000 metres with the objective of both increasing the category of the current resource and increasing the SDLP Project’s resource base.\n\nThe drill program is jointly designed and supervised by the Company and Atacama Water consultants. All brine samples are sent to SGS Laboratories, Salta, Argentina, an independent and fully international accredited laboratory for analysis for lithium multi-element Induction Coupled Plasma Spectroscopy. Arena has a regimented Quality Assurance, Quality Control program where at least 10% duplicates, blanks and standards are inserted into each sample shipment.\n\nCorporate Matters\n\nThe Company has engaged Digitonic Limited to provide investor awareness services for USD216,000. Digitonic Limited is based in Glasgow, Scotland and operates under the direction of Mr. Neil Reynolds.\n\nAbout Arena Minerals Inc.\n\nArena owns 65% of the Sal de la Puna Project covering approximately 11,000 hectares of the Pastos Grandes basin located in Salta, Argentina. The claims are highly prospective and share the basin with two advanced lithium brine projects. In addition to Sal de la Puna, the Company owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation's Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property within the Antofagasta region of Chile, and 5.8 million shares of Astra Exploration. The projects are at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile's premier copper mining district.\n\nFor more information regarding the Company, its management, expertise, and projects, please visit www.arenaminerals.com. An email registration allowing subscribers to directly receive news and updates is also available on the website.\n\nThe technical information contained in this news release has been reviewed and approved by William Randall, P.Geo, who is a Qualified Person as defined under NI 43-101. Mr. Randall is a director and is the Chief Executive Officer and President of Arena.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or Simon Marcotte, Corporate Development, at +1-647-801-7273 or smarcotte@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc.\n\nWilliam Randall, President and CEO\n\nCautionary Note Regarding Accuracy and Forward-Looking Information\n\nThis news release may contain forward-looking information within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements, projections and estimates relating to the future development of any of the Company's properties, the anticipating timing with respect to private placement financings, the ability of the Company to complete private placement financings, results of the exploration program, future financial or operating performance of the Company, its subsidiaries and its projects, the development of and the anticipated timing with respect to the Atacama project in Chile, the Antofalla, Hombre Muerto or Pocitos Projects in Argentina , and the Company's ability to obtain financing. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The statements made herein are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors discussed in the management discussion and analysis section of the Company's interim and most recent annual financial statement or other reports and filings with the TSX Venture Exchange and applicable Canadian securities regulations. Estimates underlying the results set out in this news release arise from work conducted by the previous owners and the Company. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, including but not limited to: general business, economic, competitive, geopolitical and social uncertainties; the actual results of current exploration activities; other risks of the mining industry and the risks described in the annual information form of the Company. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. Arena Minerals does not undertake to update any forward-looking information, except in accordance with applicable securities laws.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-drills-300-metre-150000013.html","symbols":["002460.SHE","1772.HK","39EA.F","39EA.STU","AMRZF.US","AN.US","AN.V","GNENF.US","LAC.TO","LAC.US","WUC1.F"],"tags":["ARENA","ARENA MINERALS INC","DRILL HOLE","GRAVEL AQUIFER","LA PUNA","PASTOS GRANDES","TARGET DEPTH","THE COMPANY","WILLIAM RANDALL"],"sentiment":{"polarity":0.993,"neg":0.026,"neu":0.905,"pos":0.069}},{"date":"2021-11-12T12:30:00+00:00","title":"Arena Minerals Announces Commencement of Resource Drilling at Sal de la Puna Lithium Project","content":"TORONTO, Nov. 12, 2021 (GLOBE NEWSWIRE) -- Arena Minerals Inc. (\"Arena\" or the \"Company\") (TSX-V: AN) is pleased to announce the commencement of drilling on the Sal de la Puna Project (“SDLP Project”) located in the Pastos Grandes basin within Salta province, Argentina. Arena is operating the drill program on behalf of Sal de la Puna Holdings Ltd., which is jointly owned by Arena (65%) and Ganfeng New Energy Technology Development (Suzhou) Co., Ltd. (“Ganfeng Lithium”; 1772.HK; OTCQX: GNENF) (35%).\n\nThe drill program is focused on the Almafuerte and Graciela blocks which border Millennial Lithium’s Pastos Grandes project to the south and south-east and consists of 3,000 metres with the objective of both increasing the category of the current resource and increasing the SDLP Project’s resource base. For more information on the drill program please refer to press release dated October 28, 2021.\n\nPictures of the activity on site can be found in the Corporate Presentation of the Company at www.arenaminerals.com.\n\nAbout Arena Minerals Inc.\n\nArena owns 65% of the Sal de la Puna Project covering approximately 11,000 hectares of the Pastos Grandes basin located in Salta, Argentina. The claims are highly prospective and share the basin with two advanced lithium brine projects. In addition to Sal de la Puna, the Company owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation's Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property within the Antofagasta region of Chile, and 5.8 million shares of Astra Exploration. The projects are at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile's premier copper mining district.\n\nStory continues\n\nFor more information regarding the Company, its management, expertise, and projects, please visit www.arenaminerals.com. An email registration allowing subscribers to directly receive news and updates is also available on the website.\n\nThe technical information contained in this news release has been reviewed and approved by William Randall, P.Geo, who is a Qualified Person as defined under NI 43-101. Mr. Randall is a director and is the Chief Executive Officer and President of Arena.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or Simon Marcotte, Corporate Development, at +1-647-801-7273 or smarcotte@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc.\n\nWilliam Randall, President and CEO\n\nCautionary Note Regarding Accuracy and Forward-Looking Information\n\nThis news release may contain forward-looking information within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements, projections and estimates relating to the future development of any of the Company's properties, the anticipating timing with respect to private placement financings, the ability of the Company to complete private placement financings, results of the exploration program, future financial or operating performance of the Company, its subsidiaries and its projects, the development of and the anticipated timing with respect to the Atacama project in Chile, the Antofalla, Hombre Muerto or Pocitos Projects in Argentina , and the Company's ability to obtain financing. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The statements made herein are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors discussed in the management discussion and analysis section of the Company's interim and most recent annual financial statement or other reportsandfilings with the TSX Venture Exchange and applicable Canadian securities regulations. Estimates underlying the results set out in this news release arise from work conducted by the previous owners and the Company. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, including but not limited to: general business, economic, competitive, geopolitical and social uncertainties; the actual results of current exploration activities; other risks of the mining industry and the risks described in the annual information form of the Company. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. Arena Mineralsdoes not undertake to update any forward-looking information, except in accordance with applicable securities laws.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-announces-commencement-drilling-123000849.html","symbols":["002460.SHE","1772.HK","39EA.F","39EA.STU","AMRZF.US","AN.V","GNENF.US","GNENY.US"],"tags":["ARENA","GANFENG NEW ENERGY TECHNOLOGY DEVELOPMENT (SUZHOU) CO","LA PUNA","LTD","PASTOS GRANDES","SAL DE LA PUNA","SALAR DE ANTOFALLA","WILLIAM RANDALL"],"sentiment":{"polarity":0.981,"neg":0.028,"neu":0.905,"pos":0.068}},{"date":"2021-11-01T10:31:13+00:00","title":"UPDATE 1-China's Ganfeng Lithium inks 3-year supply contract with Tesla","content":"(Adds details, background)\n\nBEIJING\/HONG KONG, Nov 1 (Reuters) - China's Ganfeng Lithium Co Ltd and its unit GFL International Co Ltd have signed a contract to supply battery-grade lithium products to U.S. electric vehicle (EV) maker Tesla Inc.\n\nGanfeng, the world's top lithium company by market capitalisation, has already supplied battery-grade lithium to EV producers including Tesla.\n\nThe new contract will allow the company and its unit to provide products to Tesla for three years starting from 2022, Ganfeng said on Monday in a filing to the Shenzhen Stock Exchange.\n\nThe sales amount and value of the contract are still pending Tesla's purchase orders, according to the filing.\n\nGanfeng has posted stellar earnings this year, with its third-quarter and nine-month net profits up 507% and 648% on an annual basis, respectively, thanks to rising lithium prices and robust demand.\n\nThe Jiangxi-based firm also announced an 8.4 billion yuan ($1.31 billion) investment in two battery production projects in August.\n\nGanfeng's share price, up more than 60% this year, closed at 162.1 yuan on Monday.\n\n($1 = 6.3965 Chinese yuan renminbi) (Reporting by Min Zhang in Beijing and Meg Shen in Hong Kong Editing by Jan Harvey and Mark Potter)","link":"https:\/\/finance.yahoo.com\/news\/1-chinas-ganfeng-lithium-inks-103113268.html","symbols":["002460.SHE","1772.HK","39EA.F","39EA.STU","GNENF.US","TL0.F","TL0.XETRA","TSLA.MX","TSLA.US","TSLA34.SA"],"tags":["GANFENG LITHIUM CO LTD","MARKET CAPITALISATION","SHENZHEN STOCK EXCHANGE"],"sentiment":{"polarity":0.937,"neg":0.007,"neu":0.9,"pos":0.092}},{"date":"2021-10-28T11:52:00+00:00","title":"Arena Minerals Initiates Comprehensive Work Program Focused on Resource Expansion and Processing at the Sal De La Puna Lithium Project in Argentina","content":"FIGURE 1 Pastos Grandes Basin claim map showing distribution of existing and proposed drilling on Sal de la Puna Project.\n\nPastos Grandes Basin claim map showing distribution of existing and proposed drilling on Sal de la Puna Project.\n\nTHISNEWSRELEASEISNOTFORDISTRIBUTIONTOU.S.NEWSWIRESERVICESORFORDISSEMINATIONINTHEUNITEDSTATES\n\nTORONTO, Oct. 28, 2021 (GLOBE NEWSWIRE) -- ArenaMineralsInc.(\"Arena\"orthe\"Company\")(TSX-V:AN) is pleased to announce that the Board of Sal de la Puna Holdings Ltd. has approved a comprehensive development work program for the Sal de la Puna Project. Sal de la Puna Holdings owns 100% interest in the Sal de la Puna Project (“SDLP”) in the Pastos Grandes Basin located in Salta, Argentina, and is jointly owned by Arena (65%) and Ganfeng New Energy Technology Development (Suzhou) Co., Ltd. (“Ganfeng Lithium”; 1772.HK; OTCQX: GNENF) (35%).\n\nThe approved work program focuses on expanding the recently announced maiden lithium brine resource estimate (please refer to press release dated October 19, 2021) and advancing processing studies in order to establish an optimal route for the production of high purity lithium products.\n\nHighlights of the approved work program include:\n\nDrilling to focus on resource upgrade and expansion Minimum 3,000 metres of diamond drilling 2 large diameter production wells Drilling covering 6 claims within Pastos Grandes basin Pilot plant and pond construction Engineering studies to optimize process routes to produce >30% lithium chloride products\n\nThe work program is fully permitted and is set to commence immediately.\n\n“This work program is the backbone of our plan to fast-track the Sal de la Puna Project to a production decision. The drill program will help determine the potential resource on the most prospective claims while establishing a high quality measured and indicated resource on the Almafuerte & Graciela claims. Along with our engineering and processing studies that form part of this program, Arena will be in a great position to compile a preliminary mine plan and corresponding economic study,” commented Eduardo Morales, Executive Chairman.\n\nStory continues\n\n“Thanks to the sizeable backing from our partner Ganfeng Lithium and strategic investor Lithium Americas (TSX: LAC; NYSE: LAC) we are fully funded for the approved work program at SDLP,” added William Randall, President & CEO.\n\nResourceGrowthProgram\n\nThe drill program will be focused on the Almafuerte and Graciela blocks which border Millennial Lithium’s Pastos Grandes project to the south and south-east. A map showing the proposed locations of the drill holes and wells can be seen in Figure 1. The program has been designed by the Management Committee, Arena and consultants to the Company with the objective of both increasing the category of the current resource and increasing the Project’s resource base.\n\nTo date, resources have only been defined on the Almafuerte block covering approximately 6.5% of the total landholdings of the Company in the Pastos Grandes basin. Additional drill holes and a production well are planned within the Alamfuerte claim to increase the resource category and conduct long term pump tests to evaluate production potential of the lithium bearing aquifers. If successful, this drilling will allow the Company to graduate portions of the resource to Measured and\/or Indicated categories and conduct preliminary wellfield designs, including predicted production capacities.\n\nPriority resource expansion drilling will focus on the Graciela block, located less than one kilometre north of the Almafuerte block. Graciela lies immediately adjacent to established lithium bearing aquifers drilled by other operators in the basin. Favourable geophysics suggest these brine bodies continue onto the Graciela block.\n\nBrine is also interpreted to occur in the Patovica I, Barreal II and southern end of the La Relojera properties, as determined by proximity to known brine bodies and favourable geophysics. TEM lines across these properties indicate the presence of brines at depth, within a well-established lithium bearing basin. Exploration drilling is planned for these properties, more than doubling the drilled area.\n\nEngineeringandMetallurgical Program\n\nThe main objective of the approved metallurgical program is to optimize Arena’s processing technology at SDLP. The process will aim to produce a low volume, concentrated >30% lithium chloride (approximately 6% Li) product that can be transported over great distances cost effectively to produce battery grade lithium carbonate. This process allows a centralized lithium carbonate plant to be constructed off-site at lower altitudes in areas with greater infrastructure and access to skilled labour.\n\nTesting has commenced at laboratory scale and shall proceed to greater and more continuous volumes at a pilot facility to be constructed at SDLP. The pilot facility is fully permitted and will consist of laboratory modules and lined evaporation ponds.\n\nThe results will be used to continuously optimize concentration paths culminating in an initial pond design and basic engineering, including inputs for operating cost estimates and capital requirements. These results, along with the resource expansion program, will form the basis of an economic study on SDLP.\n\nBudget\n\nA budget of approximately USD 4 million has been approved and will be contributed on an ownership pro-rata basis by Arena and Ganfeng Lithium. The SDLP work program will be operated by Arena as stipulated in the SDLP Joint Venture Agreement (for more details please refer to press release June 10, 2021).\n\nAboutArenaMineralsInc.\n\nArena owns 65% of the Sal de la Puna Project covering approximately 11,000 hectares of the Pastos Grandes basin located in Salta, Argentina. The claims are highly prospective and share the basin with two advanced lithium brine projects. In addition to Sal de la Puna, the Company owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation's Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property within the Antofagasta region of Chile, and 5.8 million shares of Astra Exploration. The projects are at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile's premier copper mining district.\n\nFor more information regarding the Company, its management, expertise, and projects, please visit www.arenaminerals.com. An email registration allowing subscribers to directly receive news and updates is also available on the website.\n\nThe technical information contained in this news release has been reviewed and approved by William Randall, P.Geo, who is a Qualified Person as defined under NI 43-101. Mr. Randall is a director and is the Chief Executive Officer and President of Arena.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or Simon Marcotte, Corporate Development, at +1-647-801-7273 or smarcotte@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc. \r\nWilliam Randall, President and CEO\r\n\r\nCautionaryNoteRegardingAccuracyandForward-LookingInformation\n\nThis news release may contain forward-looking information within the meaning of applicableCanadian securities legislation. Forward-looking information includes, but is not limited to,statements, projections and estimates relating to the future development of any of the Company'sproperties, the anticipating timing with respect to private placement financings, the ability of theCompany to complete private placement financings, results of the exploration program, futurefinancialoroperatingperformanceoftheCompany,itssubsidiariesanditsprojects,thedevelopment of and the anticipated timing with respect to the Atacama project in Chile, theAntofalla, Hombre Muerto or Pocitos Projects in Argentina , and the Company's ability to obtainfinancing. Generally, forward-looking information can be identified by the use of forward-lookingterminologysuchas\"plans\",\"expects\"or\"doesnotexpect\",\"isexpected\",\"budget\",\"scheduled\",\"estimates\",\"forecasts\",\"intends\",\"anticipates\"or\"doesnotanticipate\",or\"believes\",orvariationsofsuchwordsandphrasesorstatethatcertainactions,eventsorresults\"may\",\"could\",\"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The statements made herein arebased on current expectations and assumptions that are subject to risks and uncertainties. Actualresults could differ materially because of factors discussed in the management discussion andanalysis section of the Company's interim and most recent annual financial statement or otherreportsandfilingswiththeTSXVentureExchangeandapplicableCanadiansecuritiesregulations.Estimates underlying the results set out in this news release arise from work conducted by thepreviousownersandtheCompany.Forward-lookinginformationissubjecttoknownandunknownrisks,uncertaintiesandotherfactorsthatmaycausetheactualresults,levelofactivity,performance or achievements of the Company to be materially different from those expressed orimplied by such forward-looking information, including but not limited to: general business,economic,competitive,geopoliticalandsocialuncertainties;theactualresultsofcurrentexploration activities; other risks of the mining industry and the risks described in the annualinformation form of the Company. Although the Company has attempted to identify importantfactorsthatcouldcauseactualresultstodiffermateriallyfromthosecontainedinforward-lookinginformation, there may be other factors that cause results not to be as anticipated, estimated orintended. There can be no assurance that such information will prove to be accurate, as actualresultsandfutureeventscoulddiffermateriallyfromthoseanticipatedinsuchstatements.Accordingly, readers should not place undue reliance on forward-looking information. ArenaMineralsdoesnotundertaketoupdateanyforward-lookinginformation,exceptinaccordancewithapplicablesecurities laws.\n\nNeitherTSXVentureExchangenoritsRegulationServicesProvider(asthattermisdefinedinthepolicies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of thisrelease.\n\nA photo accompanying this announcement is available at https:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/879e10f8-91d6-4947-8185-c62772a0b1ce","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-initiates-comprehensive-program-115200923.html","symbols":["002460.SHE","1772.HK","39EA.F","39EA.STU","AMRZF.US","AN.V","GNENF.US","GNENY.US","LAC.TO","LAC.US","WUC1.F"],"tags":["ARENA","DIAMOND DRILLING","GANFENG LITHIUM","LA PUNA","LITHIUM CHLORIDE","PASTOS GRANDES","SDLP","WILLIAM RANDALL"],"sentiment":{"polarity":0.994,"neg":0.021,"neu":0.908,"pos":0.071}},{"date":"2021-10-15T12:42:00+00:00","title":"Arena Minerals Announces Closing Second &amp; Final Tranche of Offering With Ganfeng Lithium and Lithium Americas","content":"THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES\r\nOR FOR DISSEMINATION IN THE UNITED STATES\n\nTORONTO, Oct. 15, 2021 (GLOBE NEWSWIRE) -- Arena Minerals Inc. (\"Arena\" or the \"Company\") (TSX-V: AN) is pleased to announce that it has closed the second and final tranche of its $10 million subscription receipts private placement announced July 12, 2021.\n\nWilliam Randall, President and Chief Executive Officer of the Company, commented, “Given the continued international interest in the Pastos Grandes basin, closing this second and final tranche is a key step, as it provides Arena with funds to initiate an aggressive resource definition drill program. The Sal de la Puna Project is a key claim block in the basin, not only its lithium brine resource potential and extensive land position, but also its potential large freshwater resources. Along with our partners Ganfeng Lithium, we are in the final stages of planning our upcoming drill program and will be communicating the commencement of exploration activities in the near future.”\n\nPrivate Placement\n\nThe Company has closed the second and final tranche of its private placement announced on July 12, 2021. In the first tranche, which closed and was announced on July 26, 2021, the Company issued 42,857,143 units to Lithium Americas Corporation (\"Lithium Americas\") (TSX: LAC; NYSE: LAC) for aggregate consideration of $6 million. In the second and final tranche, the Company issued a total of 28,571,428 units for an aggregate consideration of $4 million including 26,678,571 units to GFL International Co. Ltd., a subsidiary of Ganfeng Lithium Co., Ltd. (“Ganfeng Lithium”) (1772.HK; OTCQX: GNENF), for a further consideration of $3.735 million.\n\nPost closing of this placement, Lithium Americas held 42,857,143 common shares and 21,428,571 warrants, and Ganfeng Lithium held 66,226,146 common shares and 33,113,072 warrants. The common shares, warrants and any shares issued upon the exercise of the warrants (the “Placement Securities”) issued to Lithium Americas in the first tranche closing are subject to a hold period ending on November 27, 2021. The Placement Securities issued or issuable to Ganfeng Lithium pursuant to the second closing are subject to a four month hold period expiring on February 15, 2022.\n\nStory continues\n\nSal de la Puna Joint-Venture\n\nArena and Ganfeng Lithium have entered into a joint venture for the exploration and development of the Sal de la Puna project, holding 65% and 35%, respectively, in a newly incorporated joint venture company through which the project is held. Ganfeng Lithium contributed USD $7,789,055 to acquire its stake in the joint venture through the exercise of its right to acquire a 35% interest in any project acquired by Arena (see Arena’s news release of February 4, 2021). The joint venture agreement provides for the funding of the project by the parties in proportion to their respective interests, which interests are subject to adjustment in the event that a party does not contribute its share of such funding. The joint venture company has a board comprised of two nominees of Arena and one nominee of Ganfeng, and a management committee comprised of two representatives of each shareholder, who are entitled to vote in proportion to the shares held by their nominating shareholders. As long as a shareholder holds at least 20% of the joint venture company’s shares, unanimous management committee approval is required for a variety of matters relating to the business of the joint venture company, including the approval of or any changes to budgets or work programs, the replacement of the operator, and various significant transactions, major expenditures, or changes to the joint venture company or its business.\n\nCorporate Matters\n\nThe Company has engaged OGIB Corporate Bulletin Ltd and Bull Markets Media GmbH to provide investor awareness services.\n\nAbout Arena Minerals Inc.\n\nArena owns 65% of the Sal de la Puna Project covering approximately 11,000 hectares of the Pastos Grandes basin located in Salta, Argentina. The claims are highly prospective and share the basin with two advanced lithium brine projects. In addition to Sal de la Puna, the Company owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation's Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property within the Antofagasta region of Chile, and 5.8 million shares of Astra Exploration. The projects are at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile's premier copper mining district.\n\nTo view our website, please visit www.arenaminerals.com. In addition to featuring information regarding the Company, its management, and projects, the site also contains the latest corporate news, a long form text explaining the unique business model of the Company (under the tab \"the Company Explained\") and an email registration allowing subscribers to receive news and updates directly.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or wrandall@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc.\n\nWilliam Randall, President and CEO\n\nCautionary Note Regarding Accuracy and Forward-Looking Information\n\nThis news release may contain forward-looking information within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements, projections and estimates relating to the future development of any of the Company's properties, the anticipating timing with respect to private placement financings, the ability of the Company to complete private placement financings, results of the exploration program, future financial or operating performance of the Company, its subsidiaries and its projects, the development of and the anticipated timing with respect to the Atacama project in Chile, the Antofalla, Hombre Muerto or Pocitos Projects in Argentina, and the Company's ability to obtain financing. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The statements made herein are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors discussed in the management discussion and analysis section of the Company's interim and most recent annual financial statement or other reports and filings with the TSX Venture Exchange and applicable Canadian securities regulations. Estimates underlying the results set out in this news release arise from work conducted by the previous owners and the Company. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, including but not limited to: general business, economic, competitive, geopolitical and social uncertainties; the actual results of current exploration activities; other risks of the mining industry and the risks described in the annual information form of the Company. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. Arena Minerals does not undertake to update any forward-looking information, except in accordance with applicable securities laws.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-announces-closing-second-124200232.html","symbols":["002460.SHE","1772.HK","39EA.F","39EA.STU","AMRZF.US","AN.V","GNENF.US","GNENY.US","LAC.TO","LAC.US","WUC1.F"],"tags":["ARENA","ARENA MINERALS INC","COMMON SHARES","COMPANY","GANFENG LITHIUM","JOINT VENTURE","LITHIUM AMERICAS","LITHIUM AMERICAS CORPORATION","SAL DE LA PUNA","THE COMPANY","WILLIAM RANDALL"],"sentiment":{"polarity":0.999,"neg":0.021,"neu":0.878,"pos":0.101}},{"date":"2021-07-16T12:54:17+00:00","title":"UPDATE 1-China's Ganfeng to offer to buy Millennial Lithium for up to $280 mln","content":"* Offer at C$3.60\/share versus current Millennial price of C$3.32 Target has two lithium projects in Argentina near Ganfeng assets (Adds background, detail)\n\nBy Tom Daly\n\nJuly 16 (Reuters) - China's Ganfeng Lithium Co Ltd , one of the world's biggest lithium producers, said on Friday its board had approved an offer to buy Argentina-focused Millennial Lithium Corp for as much as C$353 million ($280 million).\n\nThe bid will be made by subsidiary Ganfeng International at C$3.60 per share, the company said in a filing to the Shenzhen Stock Exchange, or a premium of 8.4% to Vancouver-based Millennial's closing price of C$3.32 on Thursday.\n\nMillennial did not immediately respond to a request for comment.\n\nThe offer aims to extend an acquisition spree by Ganfeng in 2021 as prices for lithium, a key ingredient in electric vehicle batteries, are up more than 65% year-to-date in China amid resurgent demand following a three-year downturn.\n\nThe company has so far this year agreed to buy the shares it does not already own in Mexico-focused Bacanora Lithium for $264.5 million, as well as stakes in a lithium mine in Mali and a salt lake in China for $130 million and 1.47 billion yuan ($227 million), respectively.\n\nMillennial has two non-producing lithium brine projects - Pastos Grandes and Cauchari East - in northern Argentina close to Ganfeng's existing operations in the country.\n\nGanfeng said this week it expects first-half net profit to rise up to 922.5% year-on-year to as much as 1.6 billion yuan, having earlier forecast a rise of 411.2-666.9%, as the lithium price rally helps fund its expansion plans. ($1 = 1.2589 Canadian dollars) ($1 = 6.4705 Chinese yuan renminbi) (Reporting by Tom Daly; additional reporting by Jeff Lewis in Toronto; editing by Jason Neely and David Evans)","link":"https:\/\/finance.yahoo.com\/news\/1-chinas-ganfeng-offer-buy-125417825.html","symbols":["002460.SHE","GNENF.US"],"tags":["CHINA","GANFENG INTERNATIONAL","GANFENG LITHIUM CO LTD","LITHIUM PRODUCERS","MILLENNIAL","MILLENNIAL LITHIUM CORP","SHENZHEN STOCK EXCHANGE"],"sentiment":{"polarity":0.944,"neg":0.005,"neu":0.924,"pos":0.071}},{"date":"2021-07-12T13:00:00+00:00","title":"Arena Minerals Announces $10 Million Offering Led by  Lithium Americas","content":"THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES\n\nTORONTO, July 12, 2021 (GLOBE NEWSWIRE) -- Arena Minerals Inc. (\"Arena\" or the \"Company\") (TSX-V: AN) announces a non-brokered private placement of subscription receipts (the \"Subscription Receipts\") at a price of $0.14 per Subscription Receipt for gross proceeds of up to $10,000,000 (the \"Offering\"). The proceeds of the Offering will be applied to the acquisition of the Sal de la Puna lithium brine project from Centaur Resources Pty Ltd., described in the Company's news releases of May 25, 2021 and June 10, 2021 (the \"Centaur Acquisition\"). Amounts not required to complete the Centaur Acquisition will be used by Arena for exploration and development expenditures on the Company's lithium assets and for general corporate purposes.\n\nLithium Americas Corp. (\"Lithium Americas” or “LAC”) will be acquiring $6 million of Subscription Receipts in the Offering. Under LAC’s subscription agreement with Arena, and provided it holds at least 7.5% of Arena's common shares, LAC has been granted the right (i) to participate in future Arena financings to maintain its percentage ownership interest in Arena; and (ii) to appoint a nominee to the Arena board of directors as long as it holds at least 10% of Arena's common shares.\n\nGanfeng Lithium Co., Ltd (\"Ganfeng Lithium\") holds a contractual right to participate in the Offering to maintain its percentage ownership interest in Arena under the Subscription agreement dated February 3, 2021.\n\nUpon successful closing of the Company’s share purchase agreement with Centaur Resources Pty Ltd. (the \"Release Condition\"), the Subscription Receipts will be exchanged without payment of additional consideration for units of the Company (each a \"Unit\"). Each Unit shall consist of one common share of the Company (a \"Common Share\") and one-half of one common share purchase warrant (each whole warrant, a \"Warrant\"). Each Warrant entitles the holder to acquire one Common Share of the Company at $0.25 for a period of 24 months from the date of issuance. If the Release Condition is not met by August 15, 2021, the proceeds of the Offering will be returned to the subscribers without interest or deduction.\n\nStory continues\n\nWill Randall, President and Chief Executive Officer of Arena, commented: “Thanks to the support shown by Ganfeng Lithium, and today’s equity investment by Lithium Americas, I am pleased to confirm that upon closing of this offering, Arena will be fully funded to close the transformative acquisition of the Sal de la Puna Project in Salta, Argentina. Indeed, this financing provides the Company with sufficient working capital to advance our lithium projects towards our ultimate goal of becoming a low-cost supplier to the lithium carbonate industry.”\n\nThe Sal de la Puna Project\n\nThe Sal de la Puna Project covers approximately 11,000 hectares of the Pastos Grandes basin located in the Puna region of Salta province at an average elevation of 4,000 metres above sea level. The project hosts a large portion of the Pastos Grandes salar adjacent and south of Millennial Lithium’s 12,700-hectare Pastos Grandes project and Litica’s Pozuelos-Pastos Grandes project which shares the northern portion of the same salar. Litica is a subsidiary of Latin American leading oil and gas producers PlusPetrol S.A., who acquired LSC Lithium in 2019 giving them ownership of their lithium assets in Argentina. The Sal de la Puna project is also located 50 km north of Lithium X Energy Corp.’s project, which was sold for $265 million in 2018, where Mr. Morales, Executive Chairman, and Mr. Randall, President and CEO, were senior executives.\n\nApproximately $22 million has been invested in the property by the current private operators\/owners, including approximately $13 million in work completed at Sal de la Puna over the last five years. Work included drilling of three wells, including a pumping well to approximately 600 metres below surface, pumping tests, seismic and TEM geophysical surveys. The drilling was carried out on a portion of the Alma Fuerte, one of the nine 100% owned claims.\n\nThe technical information contained in this news release has been reviewed and approved by William Randall, P.Geo, who is a Qualified Person as defined under NI 43-101. As President and Chief Executive Officer of the Company, Mr. Randall is not considered independent.\n\nAbout Lithium Americas Corp.\n\nLithium Americas is advancing to production the Caucharí-Olaroz lithium brine project in partnership with Ganfeng in Argentina and developing the Thacker Pass lithium project in Nevada, USA. Lithium Americas is a Canadian-based company listed on both the Toronto Stock Exchange (“TSX”) and New York Stock Exchange (“NYSE”) under the ticker symbol “LAC”, with a market capitalisation of more than $2 billion.\n\nAbout Ganfeng Lithium Co.\n\nGanfeng Lithium (1772.HK; OTCQX: GNENF), is one of the world’s leading lithium manufacturers and is listed on the Shenzhen Stock Exchange and on the Hong Kong Stock Exchange (Ticker 1772.HK) since 2018 when it raised US$ 440 million in an IPO. Ganfeng Lithium is a top three lithium compound producer, and the largest producer of lithium metal globally. Ganfeng has a strong presence in Argentina, including a 46.7% ownership in Minera Exar which operates the Caucharí-Olaroz project in Jujuy province.\n\nAbout Arena Minerals Inc.\n\nArena owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation's Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property covering approximately 5,000 hectares within the Antofagasta region of Chile. The project is at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile's premier copper mining district. Arena holds 5.82 million shares of Astra Exploration Ltd as a result of the sale of its 80% interest in the Pampa Paciencia epithermal gold property, also located in northern Chile, to Astra Exploration Ltd.\n\nTo view our website, please visit www.arenaminerals.com. In addition to featuring information regarding the Company, its management, and projects, the site also contains the latest corporate news, a long form text explaining the unique business model of the Company (under the tab \"the Company Explained\") and an email registration allowing subscribers to receive news and updates directly.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or Simon Marcotte, Vice-President Corporate Development, at +1-647-801-7273 or smarcotte@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc.\n\nWilliam Randall, President and CEO\n\nCautionary Note Regarding Accuracy and Forward-Looking Information\n\nThis news release may contain forward-looking information within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements, projections and estimates relating to the future development of any of the Company's properties, the anticipating timing with respect to private placement financings, the ability of the Company to complete private placement financings, results of the exploration program, future financial or operating performance of the Company, its subsidiaries and its projects, the development of and the anticipated timing with respect to the Atacama project in Chile, the Antofalla, Hombre Muertos or Posits Projects in Argentina, and the Company's ability to obtain financing. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The statements made herein are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors discussed in the management discussion and analysis section of the Company's interim and most recent annual financial statement or other reports and filings with the TSX Venture Exchange and applicable Canadian securities regulations. Estimates underlying the results set out in this news release arise from work conducted by the previous owners and the Company. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, including but not limited to: general business, economic, competitive, geopolitical and social uncertainties; the actual results of current exploration activities; other risks of the mining industry and the risks described in the annual information form of the Company. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. Arena Minerals does not undertake to update any forward-looking information, except in accordance with applicable securities laws.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-announces-10-million-130000562.html","symbols":["AMRZF.US","AN.V","GNENF.US","GNENY.US","LAC.US","WUC1.F"],"tags":[],"sentiment":{"polarity":0.994,"neg":0.017,"neu":0.919,"pos":0.064}},{"date":"2021-05-28T11:00:00+00:00","title":"Lithium Americas and Ganfeng Lithium Commence Expansion Planning at Caucharí-Olaroz","content":"VANCOUVER, British Columbia, May 28, 2021 (GLOBE NEWSWIRE) -- Lithium Americas Corp. (TSX: LAC) (NYSE: LAC) (\"Lithium Americas\" or the \"Company\") is pleased to provide an update on the Caucharí-Olaroz lithium project (“Caucharí-Olaroz”) in partnership with Ganfeng Lithium Co., Ltd (“Ganfeng Lithium”) (together, the “Caucharí-Olaroz Partners”) in Jujuy province, Argentina.\n\nThe Caucharí-Olaroz Partners have approved the commencement of development planning for a second stage (“Stage 2”) expansion of at least an additional 20,000 tonnes per annum (“tpa”) of lithium carbonate equivalent (“LCE”) production capacity from Caucharí-Olaroz.\n\n“Caucharí-Olaroz is on track to become the largest new lithium brine operation in over 20 years,” commented George Ireland, Chairman of Lithium Americas, “With construction for Stage 1 expected to be complete within the next year, together with Ganfeng Lithium, we are beginning to plan our next phase of growth in Argentina.”\n\nStage 2 Expansion Plan\r\nThe Caucharí-Olaroz Stage 2 expansion is targeting the following development parameters:\n\nProduction capacity of at least 20,000 tpa LCE to commence in 2025. Construction commencing in H2 2022, following the commissioning and start-up of the initial 40,000 tpa operation (“Stage 1”). Infrastructure additions to support long-term expansions beyond Stage 2.\n\nThe Caucharí-Olaroz Partners expect to provide further details of the Stage 2 expansion plan by Q4 2021, followed by an updated feasibility study in 2022.\n\nStage 1 Construction Update\r\nConstruction on the initial 40,000 tpa Stage 1 operation remains on track for first production in mid-2022.\n\nThere are currently over 1,000 workers on site, following the completion of additional camp capacity to ensure compliance with strict COVID-19 health and safety protocols. No positive cases of COVID-19 have been reported at site in eight months. In Q2 2021, senior members of Ganfeng Lithium’s commissioning and construction team arrived in Argentina to assist the project through to start-up. Ganfeng Lithium’s team brings recent experience constructing and commissioning lithium carbonate plants in China. All major equipment and the majority of bulk materials have been delivered to site, reducing risk of supply chain delays. The evaporation ponds are well advanced with sufficient brine inventory to support production ramp up. Mechanical construction of the lime plant is completed and the piping work to connect the lime line is more than 95% complete.\n\nQualified Person\r\nThe scientific and technical information in this news release has been reviewed and approved by Dr. Rene LeBlanc, a Qualified Person for purposes of NI 43-101 by virtue of his experience, education and professional association. Dr. LeBlanc is the Chief Technical Officer of the Company. Detailed scientific and technical information on the Caucharí-Olaroz project can be found in the “NI 43-101 Technical Report – Updated Feasibility Study and Mineral Reserve Estimation to Support 40,000 tpa Lithium Carbonate Production at the Caucharí-Olaroz Salars, Jujuy Province, Argentina”, with an effective date of September 30, 2020, available on the Company’s SEDAR profile at www.sedar.com.\n\nStory continues\n\nAbout Ganfeng Lithium\r\nGanfeng Lithium is the largest lithium chemicals producer in China, with a diverse product mix including lithium carbonate, lithium chloride, lithium fluoride, lithium metal and butyl lithium. Founded in 2000, Ganfeng Lithium is listed on the Shenzhen Stock Exchange and Hong Kong Stock Exchange (HKEX: 1772, SZSE: 002460).\n\nAbout Lithium Americas\r\nLithium Americas is a development-stage company with projects in Jujuy, Argentina and Nevada, United States. The Company trades on both the Toronto Stock Exchange and on the New York Stock Exchange, under the ticker symbol “LAC”.\n\nFor further information contact:\n\nInvestor Relations\r\nTelephone: +1-778-656-5820\r\nEmail: ir@lithiumamericas.com\r\nWebsite: www.lithiumamericas.com\n\nForward-Looking Statements \r\nThis news release contains “forward-looking information” and “forward-looking statements” (which we refer to collectively as forward-looking information) under the provisions of applicable securities legislation. All statements, other than statements of historical fact, are forward-looking information. Examples of forward-looking information in this news release include, among other things, statements related to: successful development of the Caucharí-Olaroz project and future expansion plans, including timing, progress, construction, milestones, anticipated production and results thereof; the expected benefits from previous transactions; expectations and anticipated impact of the COVID-19; capital expenditures and programs; estimates of the mineral resources and mineral reserves at the Company’s properties; development of mineral resources and mineral reserves; government regulation of mining operations and treatment under governmental and taxation regimes; the future price of commodities, including lithium; the realization of mineral resources and mineral reserves estimates; the timing and amount of future production; currency exchange and interest rates; expected outcome and timing of environmental surveys and permit applications and other environmental matters; the Company’s ability to raise capital; expected expenditures to be made by the Company on the properties in which it holds an interest; the timing, cost, quantity, capacity and product quality of production of the Caucharí-Olaroz project; successful operation of the Caucharí-Olaroz project under its co-ownership structure; whether the Company will ever be able to realize on an additional debt funding commitment, including the terms and timing thereof; ability to produce high purity battery grade lithium products; capital costs, operating costs, and sustaining capital requirements of the Caucharí-Olaroz project; the Company’s share of the expected capital expenditures for the construction of the Caucharí-Olaroz project; ability to achieve capital cost efficiencies; and stability and inflation related to the Argentine peso, whether the Argentine government implements additional foreign exchange and capital controls, and the effect of current or any additional regulations on the Company’s operations.\n\nForward-looking information is based upon a number of factors and assumptions that, if untrue, could cause the actual results, performances or achievements of the Company to be materially different from future results, performances or achievements expressed or implied by such information. Such information reflects the Company’s current views with respect to future events and is necessarily based upon a number of assumptions that, while considered reasonable by the Company today, are inherently subject to significant uncertainties and contingencies. These assumptions include, among others, the following: current technological trends; a cordial business relationship between the Company, Ganfeng and JEMSE for the Caucharí-Olaroz project; the ability of the Company to fund, advance and develop the Caucharí-Olaroz project and the Thacker Pass project, and the respective impacts of the projects when production commences; the Company’s ability to operate in a safe and effective manner; uncertainties relating to receiving and maintaining mining, exploration, environmental and other permits or approvals in Nevada and Argentina; demand for lithium, including that such demand is supported by growth in the electric vehicle market; the impact of increasing competition in the lithium business, and LAC’s competitive position in the industry; general economic conditions; the stable and supportive legislative, regulatory and community environment in the jurisdictions where the Company operates; stability and inflation of the Argentinian peso, including any foreign exchange or capital controls which may be enacted in respect thereof, and the effect of current or any additional regulations on the Company’s operations; the impact of unknown financial contingencies, including litigation costs, on the Company’s operations; gains or losses, in each case, if any, from short-term investments in Argentine bonds and equities; estimates of and unpredictable changes to the demand and market prices for lithium products; exploration, development and construction costs for the Caucharí-Olaroz project and the Thacker Pass project; estimates of mineral resources and mineral reserves, including whether mineral resources will ever be developed into mineral reserves; reliability of technical data; anticipated timing and results of exploration, development and construction activities, including the impact of COVID-19 on such timing; timely responses from governmental agencies responsible for reviewing and considering permitting activities for the projects in which the Company holds an interest; the Company’s ability to obtain additional financing as needed to advance the projects in which it holds an interest, including pursuant to an additional debt funding commitment, on satisfactory terms or at all; the ability to develop and achieve production at any of the Company’s mineral exploration and development properties; the impact of COVID-19 on the Company’s business generally; the expected benefits from prior transactions; accuracy of development budget and construction estimates; and preparation of a development plan and feasibility study for lithium production at the Thacker Pass project.\n\nForward-looking information also involves known and unknown risks that may cause actual results to differ materially. These risks include, among others, inherent risks in the development of capital intensive mineral projects (including as co-owners); variations in mineral resources and mineral reserves; global demand for lithium; recovery rates and lithium pricing; risks associated with successfully securing adequate financing; changes in project parameters and funding thereof; risks related to growth of lithium markets and pricing for products thereof; changes in legislation; governmental or community policy; political risk associated with foreign operations; permitting risk, including receipt of new permits and maintenance of existing permits; title and access risk; cost overruns; unpredictable weather and maintenance of natural resources; unanticipated delays; intellectual property risks; currency and interest rate fluctuations; operational risks; health and safety risks; and, general market and industry conditions. Additional risks, assumptions and other factors are set out in the Company’s latest management discussion analysis and annual information form, copies of which are available on SEDAR at www.sedar.com.\n\nAlthough the Company has attempted to identify important risks and assumptions, given the inherent uncertainties in such forward-looking information, there may be other factors that cause results to differ materially. Forward-looking information is made as of the date hereof and the Company does not intend, and expressly disclaims any obligation to, update or revise the forward-looking information contained in this news release, except as required by law. Accordingly, readers are cautioned not to place undue reliance on forward-looking information.","link":"https:\/\/finance.yahoo.com\/news\/lithium-americas-ganfeng-lithium-commence-110000080.html?.tsrc=rss","symbols":["002460.SHE","GNENF.US","GNENY.US","LAC.TO","LAC.US"],"tags":["CAUCHARí-OLAROZ PARTNERS","COMPANY","GANFENG LITHIUM","LITHIUM AMERICAS","LITHIUM AMERICAS CORP","LITHIUM CARBONATE","THE COMPANY"],"sentiment":{"polarity":0.999,"neg":0.032,"neu":0.869,"pos":0.099}},{"date":"2021-05-28T11:00:00+00:00","title":"Lithium Americas and Ganfeng Lithium Commence Expansion Planning at Caucharí-Olaroz","content":"VANCOUVER, British Columbia, May 28, 2021 (GLOBE NEWSWIRE) -- Lithium Americas Corp. (TSX: LAC) (NYSE: LAC) (\"Lithium Americas\" or the \"Company\") is pleased to provide an update on the Caucharí-Olaroz lithium project (“Caucharí-Olaroz”) in partnership with Ganfeng Lithium Co., Ltd (“Ganfeng Lithium”) (together, the “Caucharí-Olaroz Partners”) in Jujuy province, Argentina.\n\nThe Caucharí-Olaroz Partners have approved the commencement of development planning for a second stage (“Stage 2”) expansion of at least an additional 20,000 tonnes per annum (“tpa”) of lithium carbonate equivalent (“LCE”) production capacity from Caucharí-Olaroz.\n\n“Caucharí-Olaroz is on track to become the largest new lithium brine operation in over 20 years,” commented George Ireland, Chairman of Lithium Americas, “With construction for Stage 1 expected to be complete within the next year, together with Ganfeng Lithium, we are beginning to plan our next phase of growth in Argentina.”\n\nStage 2 Expansion Plan\r\nThe Caucharí-Olaroz Stage 2 expansion is targeting the following development parameters:\n\nProduction capacity of at least 20,000 tpa LCE to commence in 2025. Construction commencing in H2 2022, following the commissioning and start-up of the initial 40,000 tpa operation (“Stage 1”). Infrastructure additions to support long-term expansions beyond Stage 2.\n\nThe Caucharí-Olaroz Partners expect to provide further details of the Stage 2 expansion plan by Q4 2021, followed by an updated feasibility study in 2022.\n\nStage 1 Construction Update\r\nConstruction on the initial 40,000 tpa Stage 1 operation remains on track for first production in mid-2022.\n\nThere are currently over 1,000 workers on site, following the completion of additional camp capacity to ensure compliance with strict COVID-19 health and safety protocols. No positive cases of COVID-19 have been reported at site in eight months. In Q2 2021, senior members of Ganfeng Lithium’s commissioning and construction team arrived in Argentina to assist the project through to start-up. Ganfeng Lithium’s team brings recent experience constructing and commissioning lithium carbonate plants in China. All major equipment and the majority of bulk materials have been delivered to site, reducing risk of supply chain delays. The evaporation ponds are well advanced with sufficient brine inventory to support production ramp up. Mechanical construction of the lime plant is completed and the piping work to connect the lime line is more than 95% complete.\n\nQualified Person\r\nThe scientific and technical information in this news release has been reviewed and approved by Dr. Rene LeBlanc, a Qualified Person for purposes of NI 43-101 by virtue of his experience, education and professional association. Dr. LeBlanc is the Chief Technical Officer of the Company. Detailed scientific and technical information on the Caucharí-Olaroz project can be found in the “NI 43-101 Technical Report – Updated Feasibility Study and Mineral Reserve Estimation to Support 40,000 tpa Lithium Carbonate Production at the Caucharí-Olaroz Salars, Jujuy Province, Argentina”, with an effective date of September 30, 2020, available on the Company’s SEDAR profile at www.sedar.com.\n\nStory continues\n\nAbout Ganfeng Lithium\r\nGanfeng Lithium is the largest lithium chemicals producer in China, with a diverse product mix including lithium carbonate, lithium chloride, lithium fluoride, lithium metal and butyl lithium. Founded in 2000, Ganfeng Lithium is listed on the Shenzhen Stock Exchange and Hong Kong Stock Exchange (HKEX: 1772, SZSE: 002460).\n\nAbout Lithium Americas\r\nLithium Americas is a development-stage company with projects in Jujuy, Argentina and Nevada, United States. The Company trades on both the Toronto Stock Exchange and on the New York Stock Exchange, under the ticker symbol “LAC”.\n\nFor further information contact:\n\nInvestor Relations\r\nTelephone: +1-778-656-5820\r\nEmail: ir@lithiumamericas.com\r\nWebsite: www.lithiumamericas.com\n\nForward-Looking Statements \r\nThis news release contains “forward-looking information” and “forward-looking statements” (which we refer to collectively as forward-looking information) under the provisions of applicable securities legislation. All statements, other than statements of historical fact, are forward-looking information. Examples of forward-looking information in this news release include, among other things, statements related to: successful development of the Caucharí-Olaroz project and future expansion plans, including timing, progress, construction, milestones, anticipated production and results thereof; the expected benefits from previous transactions; expectations and anticipated impact of the COVID-19; capital expenditures and programs; estimates of the mineral resources and mineral reserves at the Company’s properties; development of mineral resources and mineral reserves; government regulation of mining operations and treatment under governmental and taxation regimes; the future price of commodities, including lithium; the realization of mineral resources and mineral reserves estimates; the timing and amount of future production; currency exchange and interest rates; expected outcome and timing of environmental surveys and permit applications and other environmental matters; the Company’s ability to raise capital; expected expenditures to be made by the Company on the properties in which it holds an interest; the timing, cost, quantity, capacity and product quality of production of the Caucharí-Olaroz project; successful operation of the Caucharí-Olaroz project under its co-ownership structure; whether the Company will ever be able to realize on an additional debt funding commitment, including the terms and timing thereof; ability to produce high purity battery grade lithium products; capital costs, operating costs, and sustaining capital requirements of the Caucharí-Olaroz project; the Company’s share of the expected capital expenditures for the construction of the Caucharí-Olaroz project; ability to achieve capital cost efficiencies; and stability and inflation related to the Argentine peso, whether the Argentine government implements additional foreign exchange and capital controls, and the effect of current or any additional regulations on the Company’s operations.\n\nForward-looking information is based upon a number of factors and assumptions that, if untrue, could cause the actual results, performances or achievements of the Company to be materially different from future results, performances or achievements expressed or implied by such information. Such information reflects the Company’s current views with respect to future events and is necessarily based upon a number of assumptions that, while considered reasonable by the Company today, are inherently subject to significant uncertainties and contingencies. These assumptions include, among others, the following: current technological trends; a cordial business relationship between the Company, Ganfeng and JEMSE for the Caucharí-Olaroz project; the ability of the Company to fund, advance and develop the Caucharí-Olaroz project and the Thacker Pass project, and the respective impacts of the projects when production commences; the Company’s ability to operate in a safe and effective manner; uncertainties relating to receiving and maintaining mining, exploration, environmental and other permits or approvals in Nevada and Argentina; demand for lithium, including that such demand is supported by growth in the electric vehicle market; the impact of increasing competition in the lithium business, and LAC’s competitive position in the industry; general economic conditions; the stable and supportive legislative, regulatory and community environment in the jurisdictions where the Company operates; stability and inflation of the Argentinian peso, including any foreign exchange or capital controls which may be enacted in respect thereof, and the effect of current or any additional regulations on the Company’s operations; the impact of unknown financial contingencies, including litigation costs, on the Company’s operations; gains or losses, in each case, if any, from short-term investments in Argentine bonds and equities; estimates of and unpredictable changes to the demand and market prices for lithium products; exploration, development and construction costs for the Caucharí-Olaroz project and the Thacker Pass project; estimates of mineral resources and mineral reserves, including whether mineral resources will ever be developed into mineral reserves; reliability of technical data; anticipated timing and results of exploration, development and construction activities, including the impact of COVID-19 on such timing; timely responses from governmental agencies responsible for reviewing and considering permitting activities for the projects in which the Company holds an interest; the Company’s ability to obtain additional financing as needed to advance the projects in which it holds an interest, including pursuant to an additional debt funding commitment, on satisfactory terms or at all; the ability to develop and achieve production at any of the Company’s mineral exploration and development properties; the impact of COVID-19 on the Company’s business generally; the expected benefits from prior transactions; accuracy of development budget and construction estimates; and preparation of a development plan and feasibility study for lithium production at the Thacker Pass project.\n\nForward-looking information also involves known and unknown risks that may cause actual results to differ materially. These risks include, among others, inherent risks in the development of capital intensive mineral projects (including as co-owners); variations in mineral resources and mineral reserves; global demand for lithium; recovery rates and lithium pricing; risks associated with successfully securing adequate financing; changes in project parameters and funding thereof; risks related to growth of lithium markets and pricing for products thereof; changes in legislation; governmental or community policy; political risk associated with foreign operations; permitting risk, including receipt of new permits and maintenance of existing permits; title and access risk; cost overruns; unpredictable weather and maintenance of natural resources; unanticipated delays; intellectual property risks; currency and interest rate fluctuations; operational risks; health and safety risks; and, general market and industry conditions. Additional risks, assumptions and other factors are set out in the Company’s latest management discussion analysis and annual information form, copies of which are available on SEDAR at www.sedar.com.\n\nAlthough the Company has attempted to identify important risks and assumptions, given the inherent uncertainties in such forward-looking information, there may be other factors that cause results to differ materially. Forward-looking information is made as of the date hereof and the Company does not intend, and expressly disclaims any obligation to, update or revise the forward-looking information contained in this news release, except as required by law. Accordingly, readers are cautioned not to place undue reliance on forward-looking information.","link":"https:\/\/finance.yahoo.com\/news\/lithium-americas-ganfeng-lithium-commence-110000080.html","symbols":["002460.SHE","GNENF.US","GNENY.US","LAC.TO","LAC.US"],"tags":["CAUCHARí-OLAROZ PARTNERS","COMPANY","GANFENG LITHIUM","LITHIUM AMERICAS","LITHIUM AMERICAS CORP","LITHIUM CARBONATE","THE COMPANY"],"sentiment":{"polarity":0.999,"neg":0.032,"neu":0.869,"pos":0.099}},{"date":"2021-03-16T11:30:00+00:00","title":"Arena Minerals Closes $2.8M Financing Led by Leading Lithium Producer Ganfeng Lithium Co.","content":"THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES\r\nOR FOR DISSEMINATION IN THE UNITED STATES\n\nTORONTO, March 16, 2021 (GLOBE NEWSWIRE) -- Arena Minerals Inc. (\"Arena\" or the \"Company\") (TSX-V: AN) announces the closing of the second and final tranche of the non-brokered private placement announced on February 4, 2021. The Company has issued an additional 25,236,278 units (the “Units”) at a price of $0.05 per Unit for additional proceeds of $1,261,813. Each Unit consists of one common share of the Company (a “Common Share”) and one-half of one common share purchase warrant (each whole warrant, a “Warrant”). Each Warrant entitles the holder to acquire one Common Share of the Company at $0.15 for a period of 36 months from the date of issuance. The shares, warrants and any shares issued upon the exercise of the warrants issued in this second tranche closing are subject to a hold period which expires March 16, 2021. With the closing of the first tranche which closed on March 15, the total raised in the financing was $2.8 million.\n\nGFL International Co., Ltd, a wholly owned subsidiary of Ganfeng Lithium Co. (“Ganfeng”; 1772.HK; OTCQX: GNENF), an established global lithium carbonate producer, has acquired a total of 39,525,596 Units for gross proceeds of $1,976,280 pursuant to the terms of the offering.\n\nArena also announces that 9,205,000 warrants with a strike price of $0.10 have recently been exercised for total proceeds of $920,500. An additional 36,795,000 unexercised warrants with a strike price of $0.10 expire on September 10, 2021. Considering this and the present closing, Ganfeng now owns 19% of the Company’s issued and outstanding Common Shares.\n\nGanfeng is one of the world’s leading lithium manufacturers and is listed on the Shenzhen Stock Exchange and on the Hong Kong Stock Exchange since 2018 when it raised US$ 440 million in an IPO. Ganfeng is a top three lithium compound producer, and the largest producer of lithium metal globally. Ganfeng has a strong presence in Argentina, including a 51% ownership in Minera Exar whom operates the Cauchari Lithium project in Jujuy province.\n\nStory continues\n\nAs a result of the non-brokered private placement, the exercise of warrants, previously held cash and cash equivalents, the Company is now well financed for the advancement of its drill ready lithium brine properties in Argentina and other corporate initiatives. The proceeds from the Offering will be used by Arena to develop its Antofalla lithium brine property in the puna region of Argentina, for potential acquisitions, and for general corporate purposes. Arena’s Antofalla properties comprise a total of 6,000 hectares covering a portion of the Antofalla salar located in Catamarca, Argentina. The properties are immediately south and adjacent to Albemarle Corporation’s similarly named Antofalla project.\n\nMr. Eduardo Morales, Executive Chairman of Arena, commented: “We are now in a strong position, thanks to our healthy financial situation and our partnership with Ganfeng Lithium, one of the world’s largest and most successful companies in the battery materials sector, to execute on our business plan. Alongside developing the Antofalla project, we have a clear strategy in mind to grow this Company to become a lithium producer by targeting and acquiring further mid-size projects to complement Antofalla. As stated before, our objective is to ultimately own and operate several high-quality assets and supply lithium chloride to a centralized chemical plant. We are convinced this is the future of the brine lithium industry, allowing assets to be developed without incurring excessive capital costs while reducing the technical risk of having to build and operate a chemical plant.” Mr. Morales is the former President of Rockwood Litio Ltda (Chile), where he oversaw the development of the world’s premier lithium brine asset in the Salar the Atacama, Chile. Rockwood was sold in 2014 for USD 6.2 Billion.\n\nUnder its subscription agreement with Arena, and provided it holds at least 7.5% of Arena's common shares, Ganfeng has been granted the right (i) to participate in future Arena financings to maintain its percentage ownership interest in Arena; (ii) to acquire up to 35% interest in any asset acquisition completed by Arena; and iii) a Right of First Offer on off-take agreements on a per project basis. Ganfeng has also been granted the right to appoint a nominee to the Arena board of directors as long as it holds at least 10% of Arena's common shares.\n\nThis summary is qualified in its entirety by reference to the full text of the Agreement, a copy of which has been filed by Arena on SEDAR (www.sedar.com).\n\nAbout Arena Minerals Inc.\n\nArena owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation's Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property, consisting of two projects covering approximately 7,000 hectares within the Antofagasta region of Chile. The projects are at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile's premier copper mining district.\n\nThe technical and scientific aspects of this news release have been reviewed and approved by Mr. William Randall, P.Geo, who is a qualified person pursuant to NI 43-101. As the President & CEO of the Company, Mr. Randall is not considered independent.\n\nTo view our website, please visit www.arenaminerals.com. In addition to featuring information regarding the Company, its management, and projects, the site also contains the latest corporate news, a long form text explaining the unique business model of the Company (under the tab “the Company Explained”) and an email registration allowing subscribers to receive news and updates directly.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or Simon Marcotte, Vice-President Corporate Development, at +1-647-801-7273 or smarcotte@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc.\n\nWilliam Randall, President and CEO\n\nCautionary Note Regarding Accuracy and Forward-Looking Information\n\nThis news release may contain forward-looking information within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements, projections and estimates relating to the future development of any of the Company's properties, the anticipating timing with respect to private placement financings, the ability of the Company to complete private placement financings, results of the exploration program, future financial or operating performance of the Company, its subsidiaries and its projects, the development of and the anticipated timing with respect to the Atacama project in Chile, the Antofalla, Hombre Muerto or Pocitos Projects in Argentina, and the Company's ability to obtain financing. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The statements made herein are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors discussed in the management discussion and analysis section of the Company's interim and most recent annual financial statement or other reports and filings with the TSX Venture Exchange and applicable Canadian securities regulations. Estimates underlying the results set out in this news release arise from work conducted by the previous owners and the Company. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, including but not limited to: general business, economic, competitive, geopolitical and social uncertainties; the actual results of current exploration activities; other risks of the mining industry and the risks described in the annual information form of the Company. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. Arena Minerals does not undertake to update any forward-looking information, except in accordance with applicable securities laws.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-closes-2-8m-113000995.html","symbols":["002460.SHE","AMRZF.US","AN.V","GNENF.US"],"tags":["ALBEMARLE CORPORATION","ARENA","ARENA MINERALS INC","COMPANY","LITHIUM","LITHIUM CARBONATE","THE COMPANY"],"sentiment":{"polarity":0.995,"neg":0.02,"neu":0.91,"pos":0.07}},{"date":"2021-03-16T11:30:00+00:00","title":"Arena Minerals Closes $2.8M Financing Led by Leading Lithium Producer Ganfeng Lithium Co.","content":"THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES\r\nOR FOR DISSEMINATION IN THE UNITED STATES\n\nTORONTO, March 16, 2021 (GLOBE NEWSWIRE) -- Arena Minerals Inc. (\"Arena\" or the \"Company\") (TSX-V: AN) announces the closing of the second and final tranche of the non-brokered private placement announced on February 4, 2021. The Company has issued an additional 25,236,278 units (the “Units”) at a price of $0.05 per Unit for additional proceeds of $1,261,813. Each Unit consists of one common share of the Company (a “Common Share”) and one-half of one common share purchase warrant (each whole warrant, a “Warrant”). Each Warrant entitles the holder to acquire one Common Share of the Company at $0.15 for a period of 36 months from the date of issuance. The shares, warrants and any shares issued upon the exercise of the warrants issued in this second tranche closing are subject to a hold period which expires March 16, 2021. With the closing of the first tranche which closed on March 15, the total raised in the financing was $2.8 million.\n\nGFL International Co., Ltd, a wholly owned subsidiary of Ganfeng Lithium Co. (“Ganfeng”; 1772.HK; OTCQX: GNENF), an established global lithium carbonate producer, has acquired a total of 39,525,596 Units for gross proceeds of $1,976,280 pursuant to the terms of the offering.\n\nArena also announces that 9,205,000 warrants with a strike price of $0.10 have recently been exercised for total proceeds of $920,500. An additional 36,795,000 unexercised warrants with a strike price of $0.10 expire on September 10, 2021. Considering this and the present closing, Ganfeng now owns 19% of the Company’s issued and outstanding Common Shares.\n\nGanfeng is one of the world’s leading lithium manufacturers and is listed on the Shenzhen Stock Exchange and on the Hong Kong Stock Exchange since 2018 when it raised US$ 440 million in an IPO. Ganfeng is a top three lithium compound producer, and the largest producer of lithium metal globally. Ganfeng has a strong presence in Argentina, including a 51% ownership in Minera Exar whom operates the Cauchari Lithium project in Jujuy province.\n\nStory continues\n\nAs a result of the non-brokered private placement, the exercise of warrants, previously held cash and cash equivalents, the Company is now well financed for the advancement of its drill ready lithium brine properties in Argentina and other corporate initiatives. The proceeds from the Offering will be used by Arena to develop its Antofalla lithium brine property in the puna region of Argentina, for potential acquisitions, and for general corporate purposes. Arena’s Antofalla properties comprise a total of 6,000 hectares covering a portion of the Antofalla salar located in Catamarca, Argentina. The properties are immediately south and adjacent to Albemarle Corporation’s similarly named Antofalla project.\n\nMr. Eduardo Morales, Executive Chairman of Arena, commented: “We are now in a strong position, thanks to our healthy financial situation and our partnership with Ganfeng Lithium, one of the world’s largest and most successful companies in the battery materials sector, to execute on our business plan. Alongside developing the Antofalla project, we have a clear strategy in mind to grow this Company to become a lithium producer by targeting and acquiring further mid-size projects to complement Antofalla. As stated before, our objective is to ultimately own and operate several high-quality assets and supply lithium chloride to a centralized chemical plant. We are convinced this is the future of the brine lithium industry, allowing assets to be developed without incurring excessive capital costs while reducing the technical risk of having to build and operate a chemical plant.” Mr. Morales is the former President of Rockwood Litio Ltda (Chile), where he oversaw the development of the world’s premier lithium brine asset in the Salar the Atacama, Chile. Rockwood was sold in 2014 for USD 6.2 Billion.\n\nUnder its subscription agreement with Arena, and provided it holds at least 7.5% of Arena's common shares, Ganfeng has been granted the right (i) to participate in future Arena financings to maintain its percentage ownership interest in Arena; (ii) to acquire up to 35% interest in any asset acquisition completed by Arena; and iii) a Right of First Offer on off-take agreements on a per project basis. Ganfeng has also been granted the right to appoint a nominee to the Arena board of directors as long as it holds at least 10% of Arena's common shares.\n\nThis summary is qualified in its entirety by reference to the full text of the Agreement, a copy of which has been filed by Arena on SEDAR (www.sedar.com).\n\nAbout Arena Minerals Inc.\n\nArena owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation's Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property, consisting of two projects covering approximately 7,000 hectares within the Antofagasta region of Chile. The projects are at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile's premier copper mining district.\n\nThe technical and scientific aspects of this news release have been reviewed and approved by Mr. William Randall, P.Geo, who is a qualified person pursuant to NI 43-101. As the President & CEO of the Company, Mr. Randall is not considered independent.\n\nTo view our website, please visit www.arenaminerals.com. In addition to featuring information regarding the Company, its management, and projects, the site also contains the latest corporate news, a long form text explaining the unique business model of the Company (under the tab “the Company Explained”) and an email registration allowing subscribers to receive news and updates directly.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or Simon Marcotte, Vice-President Corporate Development, at +1-647-801-7273 or smarcotte@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc.\n\nWilliam Randall, President and CEO\n\nCautionary Note Regarding Accuracy and Forward-Looking Information\n\nThis news release may contain forward-looking information within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements, projections and estimates relating to the future development of any of the Company's properties, the anticipating timing with respect to private placement financings, the ability of the Company to complete private placement financings, results of the exploration program, future financial or operating performance of the Company, its subsidiaries and its projects, the development of and the anticipated timing with respect to the Atacama project in Chile, the Antofalla, Hombre Muerto or Pocitos Projects in Argentina, and the Company's ability to obtain financing. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The statements made herein are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors discussed in the management discussion and analysis section of the Company's interim and most recent annual financial statement or other reports and filings with the TSX Venture Exchange and applicable Canadian securities regulations. Estimates underlying the results set out in this news release arise from work conducted by the previous owners and the Company. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, including but not limited to: general business, economic, competitive, geopolitical and social uncertainties; the actual results of current exploration activities; other risks of the mining industry and the risks described in the annual information form of the Company. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. Arena Minerals does not undertake to update any forward-looking information, except in accordance with applicable securities laws.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-closes-2-8m-113000995.html?.tsrc=rss","symbols":["002460.SHE","AMRZF.US","AN.V","GNENF.US"],"tags":["ALBEMARLE CORPORATION","ARENA","ARENA MINERALS INC","COMPANY","LITHIUM","LITHIUM CARBONATE","THE COMPANY"],"sentiment":{"polarity":0.995,"neg":0.02,"neu":0.91,"pos":0.07}},{"date":"2021-03-01T13:13:00+00:00","title":"Arena Minerals Announces First Tranche Closing of $2.8 Million Private Placement Led by Leading Lithium Producer Ganfeng Lithium Co.","content":"THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES\r\nOR FOR DISSEMINATION IN THE UNITED STATES\n\nTORONTO, March 01, 2021 (GLOBE NEWSWIRE) -- Arena Minerals Inc. (“Arena” or the “Company”) (TSX-V: AN) announces that it has closed an initial tranche of its private placement announced on February 4, 2021. The Company has issued an aggregate of 30,763,720 units (the “Units”) at a price of $0.05 per Unit for gross proceeds of $1,538,186. Each Unit consists of one common share of the Company (a “Common Share”) and one-half of one common share purchase warrant (each whole warrant, a “Warrant”). Each Warrant entitles the holder to acquire one Common Share of the Company at $0.15 for a period of 36 months from the date of issuance.\n\nGanfeng Lithium Co. (“Ganfeng”; 1772.HK; OTCQX: GNENF) acquired 17,489,321 Units in the first tranche closing, and now holds approximately 9.9% of the Company’s issued and outstanding shares. Ganfeng will acquire an additional 22,036,279 Units in a second closing which is expected to take place in approximately two to three weeks. Following completion of the second closing, Ganfeng will have acquired 39,525,600 Units. Ganfeng has undertaken not to exercise any Warrants which would result in it holding 10% or more of the Common Shares until the TSXV has confirmed it has completed a routine personal information form review required in the case of new insiders, and has further undertaken not to exercise any Warrants which would result in it holding 20% or more of the Common Shares until receipt of shareholder approval for it becoming a control person of the Company, as such term is defined in the TSXV Corporate Finance Manual.\n\nThe Common Shares and Warrants issued in the first tranche closing and any shares issued upon the exercise of the Warrants are subject to a four month resale hold period which expires on June 26, 2021.\n\nThe proceeds from the placement will be used by Arena to develop its Antofalla lithium brine property in the puna region of Argentina, for potential acquisitions, and for general corporate purposes.\n\nStory continues\n\nAbout Arena Minerals Inc.\n\nArena owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation’s Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property, consisting of two projects covering approximately 7,000 hectares within the Antofagasta region of Chile. The projects are at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile’s premier copper mining district.\n\nTo view our website, please visit www.arenaminerals.com. In addition to featuring information regarding the Company, its management, and projects, the site also contains the latest corporate news, a long form text explaining the unique business model of the Company (under the tab “the Company Explained”) and an email registration allowing subscribers to receive news and updates directly.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or Simon Marcotte, Vice-President Corporate Development, at +1-647-801-7273 or smarcotte@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc.\n\nWilliam Randall, President and CEO","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-announces-first-tranche-131300796.html","symbols":["002460.SHE","AMRZF.US","AN.V","GNENF.US"],"tags":["ARENA","COMMON SHARE","COMPANY","THE COMPANY"],"sentiment":{"polarity":0.981,"neg":0.009,"neu":0.926,"pos":0.064}},{"date":"2021-03-01T13:13:00+00:00","title":"Arena Minerals Announces First Tranche Closing of $2.8 Million Private Placement Led by Leading Lithium Producer Ganfeng Lithium Co.","content":"THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES\r\nOR FOR DISSEMINATION IN THE UNITED STATES\n\nTORONTO, March 01, 2021 (GLOBE NEWSWIRE) -- Arena Minerals Inc. (“Arena” or the “Company”) (TSX-V: AN) announces that it has closed an initial tranche of its private placement announced on February 4, 2021. The Company has issued an aggregate of 30,763,720 units (the “Units”) at a price of $0.05 per Unit for gross proceeds of $1,538,186. Each Unit consists of one common share of the Company (a “Common Share”) and one-half of one common share purchase warrant (each whole warrant, a “Warrant”). Each Warrant entitles the holder to acquire one Common Share of the Company at $0.15 for a period of 36 months from the date of issuance.\n\nGanfeng Lithium Co. (“Ganfeng”; 1772.HK; OTCQX: GNENF) acquired 17,489,321 Units in the first tranche closing, and now holds approximately 9.9% of the Company’s issued and outstanding shares. Ganfeng will acquire an additional 22,036,279 Units in a second closing which is expected to take place in approximately two to three weeks. Following completion of the second closing, Ganfeng will have acquired 39,525,600 Units. Ganfeng has undertaken not to exercise any Warrants which would result in it holding 10% or more of the Common Shares until the TSXV has confirmed it has completed a routine personal information form review required in the case of new insiders, and has further undertaken not to exercise any Warrants which would result in it holding 20% or more of the Common Shares until receipt of shareholder approval for it becoming a control person of the Company, as such term is defined in the TSXV Corporate Finance Manual.\n\nThe Common Shares and Warrants issued in the first tranche closing and any shares issued upon the exercise of the Warrants are subject to a four month resale hold period which expires on June 26, 2021.\n\nThe proceeds from the placement will be used by Arena to develop its Antofalla lithium brine property in the puna region of Argentina, for potential acquisitions, and for general corporate purposes.\n\nStory continues\n\nAbout Arena Minerals Inc.\n\nArena owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation’s Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property, consisting of two projects covering approximately 7,000 hectares within the Antofagasta region of Chile. The projects are at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile’s premier copper mining district.\n\nTo view our website, please visit www.arenaminerals.com. In addition to featuring information regarding the Company, its management, and projects, the site also contains the latest corporate news, a long form text explaining the unique business model of the Company (under the tab “the Company Explained”) and an email registration allowing subscribers to receive news and updates directly.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or Simon Marcotte, Vice-President Corporate Development, at +1-647-801-7273 or smarcotte@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc.\n\nWilliam Randall, President and CEO","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-announces-first-tranche-131300796.html?.tsrc=rss","symbols":["002460.SHE","AMRZF.US","AN.V","GNENF.US"],"tags":["ARENA","COMMON SHARE","COMPANY","THE COMPANY"],"sentiment":{"polarity":0.981,"neg":0.009,"neu":0.926,"pos":0.064}},{"date":"2021-02-05T17:08:16+00:00","title":"7 Well-Positioned Battery Stocks to Buy on EV Demand","content":"Now that we’ve entered 2021, there seems to be a bit of a mindset shift in the markets. To be sure, not much has changed: we’re still in the midst of a pandemic and look to be for a good portion of 2021. However, one thing is shifting: the rumblings of EV pushback are clear. And battery stocks will be a benefactor of this pushback.\n\nIt is my belief that EV stocks are going to remain hot through 2021. However, markets and capital are going to move into EV suppliers with more force. That means battery manufacturers and suppliers to these companies should become more attractive this year.\n\n8 Biometric Stocks to Consider as We Eye a Return to Normal\n\nThis list is focused on exactly that: EV battery manufacturers and suppliers thereto. Any and all of these stocks are a buy in my eyes.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nSociedad Quimica y Minera de Chile (NYSE:SQM) Albemarle (NYSE:ALB) Ganfeng Lithium (OTCMKTS:GNENF) Panasonic (OTCMKTS:PCRFY) Romeo Power (NYSE:RMO) Vale (NYSE:VALE) Glencore (OTCMKTS:GLNCY)\n\nBattery Stocks: Sociedad Quimica y Minera de Chile (SQM) a lithium mine\n\nSource: Shutterstock\n\nInvestors who have interest in EVs are likely well aware of lithium as a mineral integral to the sector. Lithium-ion battery chemistry has become the leading battery type used in the industry. Therefore, lots of lithium is necessary until a better suited chemistry is commercialized. The leading candidates don’t look to be commercialized for some time yet. The upshot is lithium mining is a smart place to be for EV investment.\n\nAnd that’s why Sociedad Quimica y Minera de Chile and its SQM stock lead off this list. The Chilean company is a major producer of lithium. Lithium currently accounts for about 16% of Sociedad Quimica y Minera de Chile’s profit and the company is making a major investment in increasing its lithium capacity.\n\nIt is clear that the company sees lithium as important to its immediate future. The company has four scheduled expansions through 2023. It is investing $240 million toward lithium production expansion, which will increase production by 69.5% by the second half of 2021.\n\nStory continues\n\nThat means the company will go from the ability to produce 83.5 million tons of lithium to 141.5 million tons by the end of this year. The company is not stopping there. It intends to invest a further $150 million to bring total lithium capacity to 210 million tons by 2023. That 151.5% capacity increase is indicative of larger demand.\n\nThe company did experience a revenue decrease of 11% in the first nine months of 2020 compared to 2019. However, lithium sales volumes increased 40% between Q2 and Q3 making this a worthwhile play moving forward.\n\nAlbemarle (ALB) Albemarle (ALB) logo on a mobile phone screen\n\nSource: IgorGolovniov\/Shutterstock.com\n\nAlbemarle is another major name in lithium production. It also experienced a sales decline and is positioning itself to take advantage of opportunities in lithium. Despite the downturn, ALB stock is definitely a smart play that makes sense in the EV space.\n\nThe company explains its overarching strategy thusly: “Our long-term strategy and capital allocation priorities remain the same: to invest in lithium growth using cash flows from our entire enterprise, while maintaining our dividend and investment grade credit rating.”\n\nAlbemarle depends on lithium for 37% of its total revenue currently and anticipates 20% industry growth. Albemarle experienced a sales decline of 19.6% in its lithium segment and 15.1% across its entire business in Q3 of 2020. The company says that while lithium market growth was stunted in 2020 that it still anticipates the same overall future growth.\n\n8 Biometric Stocks to Consider as We Eye a Return to Normal\n\nMy thesis is that it makes sense to invest now while revenue is relatively weakened and Wall Street views ALB stock as a “hold.” Revenue may have slipped, but earnings well outpaced guidance for the quarter, and the company remains solidly entrenched in its lithium strategy.\n\nBattery Stocks: Ganfeng Lithium (GNENF) rows of lithium ion batteries\n\nSource: Lightboxx\/ShutterStock.com\n\nChina is a massive market for EVs. In fact, it’s the world’s largest by market share. But the country also has massive natural resources, which gives it another advantage when it comes to EVs. It has national champions including Nio (NYSE:NIO) and XPeng (NYSE:XPEV), and it has companies like Ganfeng Lithium which can supply them.\n\nThe company is headquartered in China and has operations in Australia, Argentina, Ireland and Mexico. Ganfeng Lithium is clearly well-diversified geographically. But it is also diversified in terms of its operations. It maintains lithium operations upstream, mid-stream and downstream, meaning it does everything from mining lithium to lithium battery manufacturing.\n\nNot only is the company massive, but it has also experienced robust growth. Ganfeng’s CAGR averaged 41% between 2015 and 2019. Profitability growth decreased in 2019 although still a very healthy 16%. But it has begun to rise again in 2020.\n\nPanasonic (PCRFY) A Panasonic (PCRFY) sign hanging in Beijing, China. generation z\n\nSource: testing\/Shutterstock.com\n\nThe previous three stocks were all lithium producers. It is time to move up the value chain into the actual battery manufacturers. Most readers will recognize that Panasonic does many things. It is not a dedicated EV battery manufacturer by any stretch of the imagination. However, it does produce batteries for Tesla (NASDAQ:TSLA). That alone makes it a name worth mentioning in this space. The simple fact is that to a degree, as Tesla goes, so goes the whole EV market.\n\nAnyway, the important consideration here for investors is the EV business between Panasonic and Tesla. Tesla has long been speculated to want to bring battery production in-house. But the long-time relationship it has had with Panasonic will continue through at least 2022.\n\n8 Biometric Stocks to Consider as We Eye a Return to Normal\n\nPanasonic is under pressure to increase energy storage capacity by Tesla. By 2025 its Model 3 battery is slated to have improved energy storage capacity by 20%. It is also under pressure to make similar leaps for the Tesla Model S and Model X.\n\nBattery Stocks: Romeo Power (RMO) A man holding two puzzle pieces surrounded by more, smaller puzzle pieces. SPAC IPOs\n\nSource: Pasuwan\/ShutterStock.com\n\nNow is the time to invest in Romeo Power. Prices have recently come down and now RMO stock’s price point makes sense in addition to its strategic positioning. For an excellent run down of why Romeo Power is a bargain on a purely quantitative, objective basis, check out this article by InvestorPlace’s Mark Hake. Numbers don’t lie, and these numbers indicate that there is lots of upside in RMO shares.\n\nFrom a more subjective perspective there’s also lots to like about Romeo Power. Most readers will know that many SPAC-funded EV companies came to market in 2020. Romeo Power is also a SPAC. But it is an EV supplier, not a manufacturer. The company makes battery packs for two segments: class 4-8 trucks and buses and high-performance vehicles, along with other commercial vehicles. EV battery manufacturing should continue to have many tailwinds as the decarbonization push shows little indication of slowing. EVs are here to stay.\n\nThe company has $544 million in contracted revenue, and another $2.2 billion possible under negotiation. So the $350 million it received at closing should be utilized to fulfill the sales it has booked. The company has an excellent chance to be the name behind truck electrification efforts underway at companies like Peterbilt (NASDAQ:PCAR) and Freightliner (OTCMKTS:DDAIF).\n\nRomeo Power has established relationships with 68% of the class 8 vehicle manufacturers in North America currently. They simply have to take SPAC funds and prove that their technology will effectively work for those companies. If they can, revenue will flow. That’s why this stock makes so much sense at current prices.\n\nVale (VALE) the Vale (VALE) logo displayed on a mobile phone with the company's webpage in the background\n\nSource: rafapress \/ Shutterstock.com\n\nLet’s switch gears again and go back to the far upstream of the battery industry. The first three stocks on this list were all related to lithium used in the manufacturing of the batteries themselves. There’s another mineral also very important in the battery manufacturing process: nickel. Nickel is set to receive high demand due to its utility in the EV battery manufacturing process. And on the supply side, there simply isn’t enough nickel to satisfy that demand. In fact, there may be a 10-fold increase in demand between 2018 and 2025.\n\n8 Biometric Stocks to Consider as We Eye a Return to Normal\n\nThe calculus is simple: produce and supply that nickel and make great profits. Vale increased its sales of nickel by 37.3% in Q3 of 2020. VALE stock is rated a “buy” and shares are currently less than $20, making it an attractive play in EV batteries. It is probably the strongest play in battery stocks as it relates to nickel in production.\n\nBattery Stocks: Glencore (GLNCY) a group of connected batteries\n\nSource: Shutterstock\n\nLast but not least on this list of battery stocks is Glencore. Like Vale, it is included because of its focus on nickel production. The company produces nickel in Asia, Australia, North America and Europe. In Q3 Glencore experienced a 9% decrease in nickel production as a result of operational restrictions due to Covid-19 at its Koniambo plant in New Caledonia. The company produced 81,800 tons of nickel in the period.\n\nPrices have remained basically steady in the past two years for nickel, according to the company, but Glencore will have plenty of opportunity to sell to EV battery manufacturers as long as it can produce the metal.\n\nGlencore is diversified across mineral and metals mining. It is also relatively cheap at less than $10 per share. The company is well funded and in position to serve EV battery manufacturers, as well as many other downstream companies across many industries. GLNCY stock is cheap with a lot of upside and worth a look.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nWhy Everyone Is Investing in 5G All WRONG  Top Stock Picker Reveals His Next Potential Winner  It doesn’t matter if you have $500 in savings or $5 million. Do this now.  #1 Stock for the Green Energy Boom\n\nThe post 7 Well-Positioned Battery Stocks to BuyÂ on EV Demand appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/7-well-positioned-battery-stocks-170816693.html","symbols":["002460.SHE","ALB.US","GNENF.US","NIO.US","PCAR.US","PCRFF.US","PCRFY.US","RMO.US","SQM.US","TSLA.US","VALE.US","XPEV.US"],"tags":["ALBEMARLE","BATTERY MANUFACTURER","BATTERY MANUFACTURERS","GANFENG LITHIUM","PANASONIC","ROMEO POWER","SOCIEDAD QUIMICA Y MINERA DE CHILE"],"sentiment":{"polarity":1,"neg":0.013,"neu":0.872,"pos":0.115}},{"date":"2021-02-05T17:08:16+00:00","title":"7 Well-Positioned Battery Stocks to Buy on EV Demand","content":"Now that we’ve entered 2021, there seems to be a bit of a mindset shift in the markets. To be sure, not much has changed: we’re still in the midst of a pandemic and look to be for a good portion of 2021. However, one thing is shifting: the rumblings of EV pushback are clear. And battery stocks will be a benefactor of this pushback.\n\nIt is my belief that EV stocks are going to remain hot through 2021. However, markets and capital are going to move into EV suppliers with more force. That means battery manufacturers and suppliers to these companies should become more attractive this year.\n\n8 Biometric Stocks to Consider as We Eye a Return to Normal\n\nThis list is focused on exactly that: EV battery manufacturers and suppliers thereto. Any and all of these stocks are a buy in my eyes.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nSociedad Quimica y Minera de Chile (NYSE:SQM) Albemarle (NYSE:ALB) Ganfeng Lithium (OTCMKTS:GNENF) Panasonic (OTCMKTS:PCRFY) Romeo Power (NYSE:RMO) Vale (NYSE:VALE) Glencore (OTCMKTS:GLNCY)\n\nBattery Stocks: Sociedad Quimica y Minera de Chile (SQM) a lithium mine\n\nSource: Shutterstock\n\nInvestors who have interest in EVs are likely well aware of lithium as a mineral integral to the sector. Lithium-ion battery chemistry has become the leading battery type used in the industry. Therefore, lots of lithium is necessary until a better suited chemistry is commercialized. The leading candidates don’t look to be commercialized for some time yet. The upshot is lithium mining is a smart place to be for EV investment.\n\nAnd that’s why Sociedad Quimica y Minera de Chile and its SQM stock lead off this list. The Chilean company is a major producer of lithium. Lithium currently accounts for about 16% of Sociedad Quimica y Minera de Chile’s profit and the company is making a major investment in increasing its lithium capacity.\n\nIt is clear that the company sees lithium as important to its immediate future. The company has four scheduled expansions through 2023. It is investing $240 million toward lithium production expansion, which will increase production by 69.5% by the second half of 2021.\n\nStory continues\n\nThat means the company will go from the ability to produce 83.5 million tons of lithium to 141.5 million tons by the end of this year. The company is not stopping there. It intends to invest a further $150 million to bring total lithium capacity to 210 million tons by 2023. That 151.5% capacity increase is indicative of larger demand.\n\nThe company did experience a revenue decrease of 11% in the first nine months of 2020 compared to 2019. However, lithium sales volumes increased 40% between Q2 and Q3 making this a worthwhile play moving forward.\n\nAlbemarle (ALB) Albemarle (ALB) logo on a mobile phone screen\n\nSource: IgorGolovniov\/Shutterstock.com\n\nAlbemarle is another major name in lithium production. It also experienced a sales decline and is positioning itself to take advantage of opportunities in lithium. Despite the downturn, ALB stock is definitely a smart play that makes sense in the EV space.\n\nThe company explains its overarching strategy thusly: “Our long-term strategy and capital allocation priorities remain the same: to invest in lithium growth using cash flows from our entire enterprise, while maintaining our dividend and investment grade credit rating.”\n\nAlbemarle depends on lithium for 37% of its total revenue currently and anticipates 20% industry growth. Albemarle experienced a sales decline of 19.6% in its lithium segment and 15.1% across its entire business in Q3 of 2020. The company says that while lithium market growth was stunted in 2020 that it still anticipates the same overall future growth.\n\n8 Biometric Stocks to Consider as We Eye a Return to Normal\n\nMy thesis is that it makes sense to invest now while revenue is relatively weakened and Wall Street views ALB stock as a “hold.” Revenue may have slipped, but earnings well outpaced guidance for the quarter, and the company remains solidly entrenched in its lithium strategy.\n\nBattery Stocks: Ganfeng Lithium (GNENF) rows of lithium ion batteries\n\nSource: Lightboxx\/ShutterStock.com\n\nChina is a massive market for EVs. In fact, it’s the world’s largest by market share. But the country also has massive natural resources, which gives it another advantage when it comes to EVs. It has national champions including Nio (NYSE:NIO) and XPeng (NYSE:XPEV), and it has companies like Ganfeng Lithium which can supply them.\n\nThe company is headquartered in China and has operations in Australia, Argentina, Ireland and Mexico. Ganfeng Lithium is clearly well-diversified geographically. But it is also diversified in terms of its operations. It maintains lithium operations upstream, mid-stream and downstream, meaning it does everything from mining lithium to lithium battery manufacturing.\n\nNot only is the company massive, but it has also experienced robust growth. Ganfeng’s CAGR averaged 41% between 2015 and 2019. Profitability growth decreased in 2019 although still a very healthy 16%. But it has begun to rise again in 2020.\n\nPanasonic (PCRFY) A Panasonic (PCRFY) sign hanging in Beijing, China. generation z\n\nSource: testing\/Shutterstock.com\n\nThe previous three stocks were all lithium producers. It is time to move up the value chain into the actual battery manufacturers. Most readers will recognize that Panasonic does many things. It is not a dedicated EV battery manufacturer by any stretch of the imagination. However, it does produce batteries for Tesla (NASDAQ:TSLA). That alone makes it a name worth mentioning in this space. The simple fact is that to a degree, as Tesla goes, so goes the whole EV market.\n\nAnyway, the important consideration here for investors is the EV business between Panasonic and Tesla. Tesla has long been speculated to want to bring battery production in-house. But the long-time relationship it has had with Panasonic will continue through at least 2022.\n\n8 Biometric Stocks to Consider as We Eye a Return to Normal\n\nPanasonic is under pressure to increase energy storage capacity by Tesla. By 2025 its Model 3 battery is slated to have improved energy storage capacity by 20%. It is also under pressure to make similar leaps for the Tesla Model S and Model X.\n\nBattery Stocks: Romeo Power (RMO) A man holding two puzzle pieces surrounded by more, smaller puzzle pieces. SPAC IPOs\n\nSource: Pasuwan\/ShutterStock.com\n\nNow is the time to invest in Romeo Power. Prices have recently come down and now RMO stock’s price point makes sense in addition to its strategic positioning. For an excellent run down of why Romeo Power is a bargain on a purely quantitative, objective basis, check out this article by InvestorPlace’s Mark Hake. Numbers don’t lie, and these numbers indicate that there is lots of upside in RMO shares.\n\nFrom a more subjective perspective there’s also lots to like about Romeo Power. Most readers will know that many SPAC-funded EV companies came to market in 2020. Romeo Power is also a SPAC. But it is an EV supplier, not a manufacturer. The company makes battery packs for two segments: class 4-8 trucks and buses and high-performance vehicles, along with other commercial vehicles. EV battery manufacturing should continue to have many tailwinds as the decarbonization push shows little indication of slowing. EVs are here to stay.\n\nThe company has $544 million in contracted revenue, and another $2.2 billion possible under negotiation. So the $350 million it received at closing should be utilized to fulfill the sales it has booked. The company has an excellent chance to be the name behind truck electrification efforts underway at companies like Peterbilt (NASDAQ:PCAR) and Freightliner (OTCMKTS:DDAIF).\n\nRomeo Power has established relationships with 68% of the class 8 vehicle manufacturers in North America currently. They simply have to take SPAC funds and prove that their technology will effectively work for those companies. If they can, revenue will flow. That’s why this stock makes so much sense at current prices.\n\nVale (VALE) the Vale (VALE) logo displayed on a mobile phone with the company's webpage in the background\n\nSource: rafapress \/ Shutterstock.com\n\nLet’s switch gears again and go back to the far upstream of the battery industry. The first three stocks on this list were all related to lithium used in the manufacturing of the batteries themselves. There’s another mineral also very important in the battery manufacturing process: nickel. Nickel is set to receive high demand due to its utility in the EV battery manufacturing process. And on the supply side, there simply isn’t enough nickel to satisfy that demand. In fact, there may be a 10-fold increase in demand between 2018 and 2025.\n\n8 Biometric Stocks to Consider as We Eye a Return to Normal\n\nThe calculus is simple: produce and supply that nickel and make great profits. Vale increased its sales of nickel by 37.3% in Q3 of 2020. VALE stock is rated a “buy” and shares are currently less than $20, making it an attractive play in EV batteries. It is probably the strongest play in battery stocks as it relates to nickel in production.\n\nBattery Stocks: Glencore (GLNCY) a group of connected batteries\n\nSource: Shutterstock\n\nLast but not least on this list of battery stocks is Glencore. Like Vale, it is included because of its focus on nickel production. The company produces nickel in Asia, Australia, North America and Europe. In Q3 Glencore experienced a 9% decrease in nickel production as a result of operational restrictions due to Covid-19 at its Koniambo plant in New Caledonia. The company produced 81,800 tons of nickel in the period.\n\nPrices have remained basically steady in the past two years for nickel, according to the company, but Glencore will have plenty of opportunity to sell to EV battery manufacturers as long as it can produce the metal.\n\nGlencore is diversified across mineral and metals mining. It is also relatively cheap at less than $10 per share. The company is well funded and in position to serve EV battery manufacturers, as well as many other downstream companies across many industries. GLNCY stock is cheap with a lot of upside and worth a look.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nWhy Everyone Is Investing in 5G All WRONG  Top Stock Picker Reveals His Next Potential Winner  It doesn’t matter if you have $500 in savings or $5 million. Do this now.  #1 Stock for the Green Energy Boom\n\nThe post 7 Well-Positioned Battery Stocks to BuyÂ on EV Demand appeared first on InvestorPlace.","link":"https:\/\/finance.yahoo.com\/news\/7-well-positioned-battery-stocks-170816693.html?.tsrc=rss","symbols":["ALB.US","GNENF.US","NIO.US","PCAR.US","PCRFF.US","PCRFY.US","QYM.F","RMO.US","SQM.US","TSLA.US","VALE.US","XPEV.US"],"tags":["ALBEMARLE","BATTERY MANUFACTURER","BATTERY MANUFACTURERS","GANFENG LITHIUM","PANASONIC","ROMEO POWER","SOCIEDAD QUIMICA Y MINERA DE CHILE"],"sentiment":{"polarity":1,"neg":0.013,"neu":0.872,"pos":0.115}},{"date":"2021-02-04T12:30:00+00:00","title":"Arena Minerals Announces $2.8M Financing Led by Leading Lithium Producer Ganfeng Lithium Co. and Divests Gold Asset to Astra Exploration Ltd.","content":"THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES\r\nOR FOR DISSEMINATION IN THE UNITED STATES\n\nTORONTO, Feb. 04, 2021 (GLOBE NEWSWIRE) -- Arena Minerals Inc. (\"Arena\" or the \"Company\") (TSX-V: AN) announces that it is undertaking a non-brokered private placement of units of the Company (the “Units”) at a price of $0.05 per Unit for gross proceeds of $2,800,000 (the “Offering”). Each Unit shall consist of one common share of the Company (a “Common Share”) and one-half of one common share purchase warrant (each whole warrant, a “Warrant”). Each Warrant entitles the holder to acquire one Common Share of the Company at $0.15 for a period of 36 months from the date of issuance. This price represents a 43% premium to the last trading price of Arena.\n\nGFL International Co., Ltd, a wholly owned subsidiary of Ganfeng Lithium Co. (“Ganfeng”; 1772.HK; OTCQX: GNENF), an established global lithium carbonate producer, will acquire 39,525,596 Units for gross proceeds of $1,976,280 pursuant to the terms of the offering. Ganfeng is one of the world’s leading lithium manufacturers and is listed on the Shenzhen Stock Exchange and on the Hong Kong Stock Exchange (Ticker 1772.HK) since 2018 when it raised US$ 440 million in an IPO. Ganfeng is a top three lithium compound producer, and the largest producer of lithium metal globally. Ganfeng has a strong presence in Argentina, including a 51% ownership in Minera Exar whom operates the Cauchari Lithium project in Jujuy province.\n\nThe proceeds from the Offering will be used by Arena to develop its Antofalla lithium brine property in the puna region of Argentina, for potential acquisitions, and for general corporate purposes. Arena’s Antofalla properties comprise a total of 6,000 hectares covering a portion of the Antofalla salar located in Catamarca, Argentina. The properties are immediately south and adjacent to Albemarle Corporation’s similarly names Antofalla project.\n\nStory continues\n\nMr. Eduardo Morales, Executive Chairman of Arena, commented: “We are thrilled to have Ganfeng Lithium, one of the world’s largest and most successful companies in the battery materials sector, participate in the Offering and join us as a major investor and strategic partner. The proceeds of the Offering will assist Arena in developing the Antofalla project as well evaluating further acquisitions in Argentina, where Arena’s team has world class expertise and competitive advantages. Our objective is to ultimately own and operate several high-quality assets and supply lithium chloride to a centralized chemical plant. We are convinced this is the future of the brine lithium industry, allowing assets to be developed without incurring excessive capital costs while reducing the technical risk of having to build and operate a chemical plant.” Mr. Morales is the former President of Rockwood Litio Ltda (Chile), where he oversaw the development of the world’s premier lithium brine asset in the Salar the Atacama, Chile. Rockwood was sold in 2014 for USD 6.2 Billion.\n\nUnder its subscription agreement with Arena, and provided it holds at least 7.5% of Arena's common shares, Ganfeng has been granted the right (i) to participate in future Arena financings to maintain its percentage ownership interest in Arena; (ii) to acquire up to 35% interest in any asset acquisition completed by Arena; and iii) a Right of First Offer on off-take agreements on a per project basis. Ganfeng has also been granted the right to appoint a nominee to the Arena board of directors as long as it holds at least 10% of Arena's common shares.\n\nThis summary is qualified in its entirety by reference to the full text of the Agreement, a copy of which will be filed by Arena on SEDAR (www.sedar.com). The Offering is subject to the approval of the TSX Venture Exchange.\n\nPampa Paciencia Sale to Astra Exploration Inc.\n\nThe Company also announces the sale of its Pampa Paciencia epithermal gold property, located in the Atacama region of northern Chile, to Astra Exploration Ltd (“Astra”), a private mineral exploration company.\n\nPursuant to the Agreement, Arena’s wholly owned subsidiary, Arena Minerals Chile SpA, will transfer to a newly incorporated Chilean subsidiary of Arena (“AM Newco”) all of the shares it owns in Sociedad Contractual Minera Paciencia (the “JV Company”), representing 80% of the outstanding shares of the JV Company. The JV Company holds 100% of the Paciencia Property, one of the two Chilean properties in which Arena holds an interest. Astra will then purchase all of the shares of AM Newco in consideration for the issuance to Arena of shares representing 40% of Astra’s issued and outstanding shares after Astra completes a proposed financing to raise a minimum of $600,000, which financing is to close prior to the sale to Astra of AM Newco.\n\nUnder the Agreement, until the earlier of an Astra Going Public Transaction (which includes the listing of Arena’s shares on the TSX Venture Exchange or other recognized Canadian or U.S. stock exchange) and a change of control of Arena, Arena has the right to participate in future financings of Astra to maintain its percentage shareholding in Astra while it holds 5% to 25% of Astra’s outstanding shares, and has the right to nominate a director to the Astra board as long as it maintains at least a 5% shareholding in Astra. Prior to the earlier of completion by Astra of a Going Public Transaction and 12 months from closing, Arena may not sell its Astra shares without Astra’s consent, and provided it holds at least 5% of Astra’s shares, following completion of an Astra Going Public Transaction, Arena must provide Astra with an opportunity to identify purchasers for any Astra shares that it proposes to sell before it may sell them to third parties. Arena has also agreed to vote all Astra shares it holds in favour of Astra management’s proposals at any meeting of the shareholders of Astra held within 24 months of closing.\n\nAbout Arena Minerals Inc.\n\nArena owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation's Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property, consisting of two projects covering approximately 7,000 hectares within the Antofagasta region of Chile. The projects are at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile's premier copper mining district.\n\nThe technical and scientific aspects of this news release have been reviewed and approved by Mr. William Randall, P.Geo, who is a qualified person pursuant to NI 43-101. As the President & CEO of the Company, Mr. Randall is not considered independent.\n\nTo view our website, please visit www.arenaminerals.com. In addition to featuring information regarding the Company, its management, and projects, the site also contains the latest corporate news, a long form text explaining the unique business model of the Company (under the tab “the Company Explained”) and an email registration allowing subscribers to receive news and updates directly.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or Simon Marcotte, Vice-President Corporate Development, at +1-647-801-7273 or smarcotte@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc.\n\nWilliam Randall, President and CEO\n\nCautionary Note Regarding Accuracy and Forward-Looking Information\n\nThis news release may contain forward-looking information within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements, projections and estimates relating to the future development of any of the Company's properties, the anticipating timing with respect to private placement financings, the ability of the Company to complete private placement financings, results of the exploration program, future financial or operating performance of the Company, its subsidiaries and its projects, the development of and the anticipated timing with respect to the Atacama project in Chile, the Antofalla, Hombre Muerto or Pocitos Projects in Argentina , and the Company's ability to obtain financing. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The statements made herein are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors discussed in the management discussion and analysis section of the Company's interim and most recent annual financial statement or other reports and filings with the TSX Venture Exchange and applicable Canadian securities regulations. Estimates underlying the results set out in this news release arise from work conducted by the previous owners and the Company. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, including but not limited to: general business, economic, competitive, geopolitical and social uncertainties; the actual results of current exploration activities; other risks of the mining industry and the risks described in the annual information form of the Company. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. Arena Minerals does not undertake to update any forward-looking information, except in accordance with applicable securities laws.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-announces-2-8m-123000149.html","symbols":["002460.SHE","AMRZF.US","AN.V","GNENF.US"],"tags":["ARENA","ASTRA","COMPANY","GANFENG LITHIUM","LITHIUM CARBONATE","THE COMPANY","TSX VENTURE EXCHANGE"],"sentiment":{"polarity":0.997,"neg":0.018,"neu":0.901,"pos":0.081}},{"date":"2021-02-04T12:30:00+00:00","title":"Arena Minerals Announces $2.8M Financing Led by Leading Lithium Producer Ganfeng Lithium Co. and Divests Gold Asset to Astra Exploration Ltd.","content":"THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES\r\nOR FOR DISSEMINATION IN THE UNITED STATES\n\nTORONTO, Feb. 04, 2021 (GLOBE NEWSWIRE) -- Arena Minerals Inc. (\"Arena\" or the \"Company\") (TSX-V: AN) announces that it is undertaking a non-brokered private placement of units of the Company (the “Units”) at a price of $0.05 per Unit for gross proceeds of $2,800,000 (the “Offering”). Each Unit shall consist of one common share of the Company (a “Common Share”) and one-half of one common share purchase warrant (each whole warrant, a “Warrant”). Each Warrant entitles the holder to acquire one Common Share of the Company at $0.15 for a period of 36 months from the date of issuance. This price represents a 43% premium to the last trading price of Arena.\n\nGFL International Co., Ltd, a wholly owned subsidiary of Ganfeng Lithium Co. (“Ganfeng”; 1772.HK; OTCQX: GNENF), an established global lithium carbonate producer, will acquire 39,525,596 Units for gross proceeds of $1,976,280 pursuant to the terms of the offering. Ganfeng is one of the world’s leading lithium manufacturers and is listed on the Shenzhen Stock Exchange and on the Hong Kong Stock Exchange (Ticker 1772.HK) since 2018 when it raised US$ 440 million in an IPO. Ganfeng is a top three lithium compound producer, and the largest producer of lithium metal globally. Ganfeng has a strong presence in Argentina, including a 51% ownership in Minera Exar whom operates the Cauchari Lithium project in Jujuy province.\n\nThe proceeds from the Offering will be used by Arena to develop its Antofalla lithium brine property in the puna region of Argentina, for potential acquisitions, and for general corporate purposes. Arena’s Antofalla properties comprise a total of 6,000 hectares covering a portion of the Antofalla salar located in Catamarca, Argentina. The properties are immediately south and adjacent to Albemarle Corporation’s similarly names Antofalla project.\n\nStory continues\n\nMr. Eduardo Morales, Executive Chairman of Arena, commented: “We are thrilled to have Ganfeng Lithium, one of the world’s largest and most successful companies in the battery materials sector, participate in the Offering and join us as a major investor and strategic partner. The proceeds of the Offering will assist Arena in developing the Antofalla project as well evaluating further acquisitions in Argentina, where Arena’s team has world class expertise and competitive advantages. Our objective is to ultimately own and operate several high-quality assets and supply lithium chloride to a centralized chemical plant. We are convinced this is the future of the brine lithium industry, allowing assets to be developed without incurring excessive capital costs while reducing the technical risk of having to build and operate a chemical plant.” Mr. Morales is the former President of Rockwood Litio Ltda (Chile), where he oversaw the development of the world’s premier lithium brine asset in the Salar the Atacama, Chile. Rockwood was sold in 2014 for USD 6.2 Billion.\n\nUnder its subscription agreement with Arena, and provided it holds at least 7.5% of Arena's common shares, Ganfeng has been granted the right (i) to participate in future Arena financings to maintain its percentage ownership interest in Arena; (ii) to acquire up to 35% interest in any asset acquisition completed by Arena; and iii) a Right of First Offer on off-take agreements on a per project basis. Ganfeng has also been granted the right to appoint a nominee to the Arena board of directors as long as it holds at least 10% of Arena's common shares.\n\nThis summary is qualified in its entirety by reference to the full text of the Agreement, a copy of which will be filed by Arena on SEDAR (www.sedar.com). The Offering is subject to the approval of the TSX Venture Exchange.\n\nPampa Paciencia Sale to Astra Exploration Inc.\n\nThe Company also announces the sale of its Pampa Paciencia epithermal gold property, located in the Atacama region of northern Chile, to Astra Exploration Ltd (“Astra”), a private mineral exploration company.\n\nPursuant to the Agreement, Arena’s wholly owned subsidiary, Arena Minerals Chile SpA, will transfer to a newly incorporated Chilean subsidiary of Arena (“AM Newco”) all of the shares it owns in Sociedad Contractual Minera Paciencia (the “JV Company”), representing 80% of the outstanding shares of the JV Company. The JV Company holds 100% of the Paciencia Property, one of the two Chilean properties in which Arena holds an interest. Astra will then purchase all of the shares of AM Newco in consideration for the issuance to Arena of shares representing 40% of Astra’s issued and outstanding shares after Astra completes a proposed financing to raise a minimum of $600,000, which financing is to close prior to the sale to Astra of AM Newco.\n\nUnder the Agreement, until the earlier of an Astra Going Public Transaction (which includes the listing of Arena’s shares on the TSX Venture Exchange or other recognized Canadian or U.S. stock exchange) and a change of control of Arena, Arena has the right to participate in future financings of Astra to maintain its percentage shareholding in Astra while it holds 5% to 25% of Astra’s outstanding shares, and has the right to nominate a director to the Astra board as long as it maintains at least a 5% shareholding in Astra. Prior to the earlier of completion by Astra of a Going Public Transaction and 12 months from closing, Arena may not sell its Astra shares without Astra’s consent, and provided it holds at least 5% of Astra’s shares, following completion of an Astra Going Public Transaction, Arena must provide Astra with an opportunity to identify purchasers for any Astra shares that it proposes to sell before it may sell them to third parties. Arena has also agreed to vote all Astra shares it holds in favour of Astra management’s proposals at any meeting of the shareholders of Astra held within 24 months of closing.\n\nAbout Arena Minerals Inc.\n\nArena owns the Antofalla lithium brine project in Argentina, consisting of four claims covering a total of 6,000 hectares of the central portion of Salar de Antofalla, located immediately south of Albemarle Corporation's Antofalla project. Arena has developed a proprietary brine processing technology using brine type reagents derived from the Antofalla project with the objective of producing more competitive battery grade lithium products.\n\nArena also owns 80 percent of the Atacama Copper property, consisting of two projects covering approximately 7,000 hectares within the Antofagasta region of Chile. The projects are at low altitudes, within producing mining camps in infrastructure-rich areas, located in the heart of Chile's premier copper mining district.\n\nThe technical and scientific aspects of this news release have been reviewed and approved by Mr. William Randall, P.Geo, who is a qualified person pursuant to NI 43-101. As the President & CEO of the Company, Mr. Randall is not considered independent.\n\nTo view our website, please visit www.arenaminerals.com. In addition to featuring information regarding the Company, its management, and projects, the site also contains the latest corporate news, a long form text explaining the unique business model of the Company (under the tab “the Company Explained”) and an email registration allowing subscribers to receive news and updates directly.\n\nFor more information, contact William Randall, President and CEO, at +1-416-818-8711 or Simon Marcotte, Vice-President Corporate Development, at +1-647-801-7273 or smarcotte@arenaminerals.com.\n\nOn behalf of the Board of Directors of: Arena Minerals Inc.\n\nWilliam Randall, President and CEO\n\nCautionary Note Regarding Accuracy and Forward-Looking Information\n\nThis news release may contain forward-looking information within the meaning of applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements, projections and estimates relating to the future development of any of the Company's properties, the anticipating timing with respect to private placement financings, the ability of the Company to complete private placement financings, results of the exploration program, future financial or operating performance of the Company, its subsidiaries and its projects, the development of and the anticipated timing with respect to the Atacama project in Chile, the Antofalla, Hombre Muerto or Pocitos Projects in Argentina , and the Company's ability to obtain financing. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The statements made herein are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors discussed in the management discussion and analysis section of the Company's interim and most recent annual financial statement or other reports and filings with the TSX Venture Exchange and applicable Canadian securities regulations. Estimates underlying the results set out in this news release arise from work conducted by the previous owners and the Company. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking information, including but not limited to: general business, economic, competitive, geopolitical and social uncertainties; the actual results of current exploration activities; other risks of the mining industry and the risks described in the annual information form of the Company. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. Arena Minerals does not undertake to update any forward-looking information, except in accordance with applicable securities laws.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.","link":"https:\/\/finance.yahoo.com\/news\/arena-minerals-announces-2-8m-123000149.html?.tsrc=rss","symbols":["002460.SHE","AMRZF.US","AN.V","GNENF.US"],"tags":["ARENA","ASTRA","COMPANY","GANFENG LITHIUM","LITHIUM CARBONATE","THE COMPANY","TSX VENTURE EXCHANGE"],"sentiment":{"polarity":0.997,"neg":0.018,"neu":0.901,"pos":0.081}},{"date":"2020-08-25T12:27:12+00:00","title":"China's Ganfeng sees first-half profit halve amid lithium price slump","content":"BEIJING, Aug 25 (Reuters) - Ganfeng Lithium , one of the world's top lithium producers, said on Tuesday its net profit almost halved in the first six months of 2020 as prices for the commodity used in electric vehicle batteries continued to slump.\n\nThe Chinese company's net income reached 156.49 million yuan ($22.6 million) in January through June, down 47.1% from the same period a year earlier, it said in a filing to the Shenzhen Stock Exchange, adding that the coronavirus had affected its performance and the whole lithium industry.\n\n\"Except for the temporary suspension of (some) production lines in February 2020 due to the epidemic, the company has tried its best to meet the order needs of customers,\" it said.\n\nGanfeng, which makes battery-grade chemicals such as lithium carbonate and hydroxide and counts automaker Tesla Inc among its clients, said half-year revenue was down 15.4% at 2.39 billion yuan, saying this was mainly due to the downward trend of the lithium salt market and the drop in prices.\n\nLithium carbonate prices in China <AM-995C-LTCB>, as assessed by Asian Metal, are down around 20% this year to near their lowest in seven years, having been in freefall since 2018 amid oversupply.\n\nGanfeng, whose rival Tianqi Lithium Corp is due to report half-year results on Wednesday, said last week it would take over operation of lithium production lines belonging to smaller companies from October this year until March 2023 in return for paying a management fee.\n\nThe lines can produce a total of 25,000 tonnes of lithium carbonate per year, as well as 5,000 tonnes of hydroxide, Ganfeng said.\n\n($1 = 6.9120 Chinese yuan renminbi) (Reporting by Tom Daly and Min Zhang Editing by David Holmes)","link":"https:\/\/finance.yahoo.com\/news\/chinas-ganfeng-sees-first-half-122712826.html","symbols":["002466.SHE","GNENF.US","TSLA.US"],"tags":["ELECTRIC VEHICLE BATTERIES","GANFENG LITHIUM","LITHIUM CARBONATE","LITHIUM INDUSTRY","LITHIUM PRODUCERS","LITHIUM SALT","NET PROFIT"],"sentiment":{"polarity":0.727,"neg":0.022,"neu":0.935,"pos":0.043}},{"date":"2020-08-25T12:27:12+00:00","title":"China's Ganfeng sees first-half profit halve amid lithium price slump","content":"BEIJING, Aug 25 (Reuters) - Ganfeng Lithium , one of the world's top lithium producers, said on Tuesday its net profit almost halved in the first six months of 2020 as prices for the commodity used in electric vehicle batteries continued to slump.\n\nThe Chinese company's net income reached 156.49 million yuan ($22.6 million) in January through June, down 47.1% from the same period a year earlier, it said in a filing to the Shenzhen Stock Exchange, adding that the coronavirus had affected its performance and the whole lithium industry.\n\n\"Except for the temporary suspension of (some) production lines in February 2020 due to the epidemic, the company has tried its best to meet the order needs of customers,\" it said.\n\nGanfeng, which makes battery-grade chemicals such as lithium carbonate and hydroxide and counts automaker Tesla Inc among its clients, said half-year revenue was down 15.4% at 2.39 billion yuan, saying this was mainly due to the downward trend of the lithium salt market and the drop in prices.\n\nLithium carbonate prices in China <AM-995C-LTCB>, as assessed by Asian Metal, are down around 20% this year to near their lowest in seven years, having been in freefall since 2018 amid oversupply.\n\nGanfeng, whose rival Tianqi Lithium Corp is due to report half-year results on Wednesday, said last week it would take over operation of lithium production lines belonging to smaller companies from October this year until March 2023 in return for paying a management fee.\n\nThe lines can produce a total of 25,000 tonnes of lithium carbonate per year, as well as 5,000 tonnes of hydroxide, Ganfeng said.\n\n($1 = 6.9120 Chinese yuan renminbi) (Reporting by Tom Daly and Min Zhang Editing by David Holmes)","link":"https:\/\/finance.yahoo.com\/news\/chinas-ganfeng-sees-first-half-122712826.html?.tsrc=rss","symbols":["002460.SHE","002466.SHE","GNENF.US","TSLA.US"],"tags":["ELECTRIC VEHICLE BATTERIES","GANFENG LITHIUM","LITHIUM CARBONATE","LITHIUM INDUSTRY","LITHIUM PRODUCERS","LITHIUM SALT","NET PROFIT"],"sentiment":{"polarity":0.727,"neg":0.022,"neu":0.935,"pos":0.043}},{"date":"2020-08-21T04:35:04+00:00","title":"Stymied at home, Korea's mom and pop investors charge into China tech stocks","content":"* Record $240 mln spent buying mainland China stocks in July, 7-fold jump on year\n\n* China tech rally, tough investment curbs at home drive rush\n\n* Shennan Circuits, ZTE, Inspur among top picks\n\n* China tech stocks popular with Korean investors up 32% this year\n\nBy Joori Roh and Luoyan Liu\n\nSEOUL\/SHANGHAI, Aug 21 (Reuters) - South Korean retail investors are stampeding into Chinese stocks in record numbers, ploughing hundreds of millions of dollars into a tech sector rush far removed from punishing taxes and regulations on investment at home.\n\nIn July alone, South Korean investors spent $240 million buying shares in mainland China, data from the Korea Securities Depository (KSD) showed - their largest investment in mainland markets on record.\n\nThat's a seven-fold jump from $32.9 million in July last year, and accounts for a third of the total $719 million net investment in China stocks for the January-July period.\n\nWhile South Korean mom and pop investors have historically been big risk-takers, they have stepped up the hunt for assets overseas as the Korean government imposes stringent mortgage rules and proposals to impose capital gains tax on local stocks.\n\nAmong them is the Kim, a 40-year-old Seoul chef with more invested than 500 million won - nearly half a million dollars - in Chinese stocks. Like others, Kim, who declined to given his forename, is betting on Beijing's push for tech self-sufficiency to counter U.S. trade sanctions and bans.\n\n\"It is true that interest in Chinese stocks has increased more than ever, driven by tightened regulations on domestic stocks and a boom in the China market unseen since 2015,\" said Kim.\n\nThe United States remains a top destination for investors like Kim, with Korean investments there a net $2.27 billion in July, followed by $475 million in Hong Kong, out of a total $3.19 billion of overseas stock buying.\n\nBut they are also being lured by the promise of China' speedy economy recovery from the coronavirus pandemic and its rising stock market - China's tech-heavy start-up board ChiNext and its STAR Market are up about 40% each this year.\n\nStory continues\n\nOverseas stocks make up about 80% of Kim's equity holdings, with 90% of that chunk allotted to China and the rest to U.S. equities. Kim plans to park all his equity investments overseas, and is particularly bullish on the Chinese economy and mainland companies with high growth potential.\n\nKSD data showed six of the 10 top Chinese companies that Korean investors bought between January and July were tech companies, with Shennan Circuits Co Ltd, a supplier to giant tech firm Huawei supplier, taking the lead with $55.36 million net.\n\nZTE Corp was also high on Korean investment list, along with Inspur Electronic Information Technology Co Ltd , Will Semiconductor Co Ltd and Luxshare Precision Industry.\n\nThe average year-to-date performance of those six shares shows a spurt of 32%, compared with declines of 0.7% and 23.7% respectively for Korean tech heavyweights Samsung Electronics Co Ltd and SK Hynix Inc.\n\nWhat's more, the broader Shanghai Composite index is up 10.3%, while Seoul's KOSPI benchmark has gained only 3.8%.\n\n($1 = 1,187.3300 won)\n\n(Reporting by Joori Roh in Seoul and Luoyan Liu in Shanghai; Editing by Vidya Ranganathan and Kenneth Maxwell)","link":"https:\/\/finance.yahoo.com\/news\/stymied-home-koreas-mom-pop-043504553.html?.tsrc=rss","symbols":["000660.KO","000977.SHE","002281.SHE","002475.SHE","600276.SHG","GNENF.US","SSNLF.US","TCEHY.US","TCTZF.US","ZTCOF.US","ZTCOY.US"],"tags":["CHINA","CHINESE STOCKS","INVESTORS","MAINLAND CHINA","SHENNAN CIRCUITS"],"sentiment":{"polarity":0.986,"neg":0.019,"neu":0.893,"pos":0.087}},{"date":"2020-08-21T04:35:04+00:00","title":"Stymied at home, Korea's mom and pop investors charge into China tech stocks","content":"* Record $240 mln spent buying mainland China stocks in July, 7-fold jump on year\n\n* China tech rally, tough investment curbs at home drive rush\n\n* Shennan Circuits, ZTE, Inspur among top picks\n\n* China tech stocks popular with Korean investors up 32% this year\n\nBy Joori Roh and Luoyan Liu\n\nSEOUL\/SHANGHAI, Aug 21 (Reuters) - South Korean retail investors are stampeding into Chinese stocks in record numbers, ploughing hundreds of millions of dollars into a tech sector rush far removed from punishing taxes and regulations on investment at home.\n\nIn July alone, South Korean investors spent $240 million buying shares in mainland China, data from the Korea Securities Depository (KSD) showed - their largest investment in mainland markets on record.\n\nThat's a seven-fold jump from $32.9 million in July last year, and accounts for a third of the total $719 million net investment in China stocks for the January-July period.\n\nWhile South Korean mom and pop investors have historically been big risk-takers, they have stepped up the hunt for assets overseas as the Korean government imposes stringent mortgage rules and proposals to impose capital gains tax on local stocks.\n\nAmong them is the Kim, a 40-year-old Seoul chef with more invested than 500 million won - nearly half a million dollars - in Chinese stocks. Like others, Kim, who declined to given his forename, is betting on Beijing's push for tech self-sufficiency to counter U.S. trade sanctions and bans.\n\n\"It is true that interest in Chinese stocks has increased more than ever, driven by tightened regulations on domestic stocks and a boom in the China market unseen since 2015,\" said Kim.\n\nThe United States remains a top destination for investors like Kim, with Korean investments there a net $2.27 billion in July, followed by $475 million in Hong Kong, out of a total $3.19 billion of overseas stock buying.\n\nBut they are also being lured by the promise of China' speedy economy recovery from the coronavirus pandemic and its rising stock market - China's tech-heavy start-up board ChiNext and its STAR Market are up about 40% each this year.\n\nStory continues\n\nOverseas stocks make up about 80% of Kim's equity holdings, with 90% of that chunk allotted to China and the rest to U.S. equities. Kim plans to park all his equity investments overseas, and is particularly bullish on the Chinese economy and mainland companies with high growth potential.\n\nKSD data showed six of the 10 top Chinese companies that Korean investors bought between January and July were tech companies, with Shennan Circuits Co Ltd, a supplier to giant tech firm Huawei supplier, taking the lead with $55.36 million net.\n\nZTE Corp was also high on Korean investment list, along with Inspur Electronic Information Technology Co Ltd , Will Semiconductor Co Ltd and Luxshare Precision Industry.\n\nThe average year-to-date performance of those six shares shows a spurt of 32%, compared with declines of 0.7% and 23.7% respectively for Korean tech heavyweights Samsung Electronics Co Ltd and SK Hynix Inc.\n\nWhat's more, the broader Shanghai Composite index is up 10.3%, while Seoul's KOSPI benchmark has gained only 3.8%.\n\n($1 = 1,187.3300 won)\n\n(Reporting by Joori Roh in Seoul and Luoyan Liu in Shanghai; Editing by Vidya Ranganathan and Kenneth Maxwell)","link":"https:\/\/finance.yahoo.com\/news\/stymied-home-koreas-mom-pop-043504553.html","symbols":["000660.KO","000977.SHE","002281.SHE","002475.SHE","600276.SHG","GNENF.US","SSNLF.US","TCEHY.US","TCTZF.US","ZTCOF.US","ZTCOY.US"],"tags":["CHINA","CHINESE STOCKS","INVESTORS","MAINLAND CHINA","SHENNAN CIRCUITS"],"sentiment":{"polarity":0.986,"neg":0.019,"neu":0.893,"pos":0.087}},{"date":"2020-05-26T14:05:37+00:00","title":"Lithium producers must wait as pandemic slows electric vehicle revolution","content":"By Helen Reid and Ernest Scheyder\n\nJOHANNESBURG\/HOUSTON, May 26 (Reuters) - The coronavirus pandemic has paused the electric vehicle revolution, forcing producers of battery metal lithium into survival mode with output cuts, expansion delays and sales of major assets.\n\nLithium industry shares have dropped sharply since January as the economic downturn from the pandemic slammed the brakes yet again on the electrification revolution that for years has seemed just around the corner. Investors are giving the cold shoulder to mine developers seeking funding for lithium projects.\n\n\"This pandemic further kicks the EV can down the road,\" said Seth Goldstein, a lithium industry analyst with Morningstar.\n\nThe holdup will result in a shortage of the white metal available for EV batteries when markets rebound, warned industry analysts, executives and consultants.\n\n\"We don't want to spend a great deal on lithium at the moment,\" said Vincent Mascolo, chief executive of Ironridge Resources Ltd, which has put its Ghana lithium project up for sale. \"Investor appetite is not there.\"\n\nThis year began with expectations that global demand for the white metal would jump 15%, according to Morningstar. The advisory group now expects a 5% drop in demand in 2020.\n\nAlbemarle Corp has slowed expansion projects in Chile and Australia. Tianqi Lithium Corp, saddled by debt, is selling its controlling stake in the world's largest lithium mine. SQM said it may shelve lithium expansion plans for the year.\n\nAnalysts point to Ganfeng Lithium Co's move this year to take control of an Argentina lithium project from smaller, indebted miner Lithium Americas Corp as the type of opportunistic deals likely during the pandemic.\n\nLithium executives, investors and analysts expect the downturn to roil their industry for at least a year. Some warned it could crimp operations through the middle of the decade depending on how COVID-19 affects EV deployment plans from Ford Motor Co, Volkswagen AG and other automakers.\n\nStory continues\n\nConventional wisdom holds that low oil prices should encourage consumers to buy internal combustion engine (ICE) vehicles. Still, electric vehicle sales should ultimately rise as environmental concerns have prompted EV subsidies and regulations in China and the European Union.\n\n\"If you make EVs the only vehicles available on the lot, consumer buying patterns change very fast,\" said Devin Lindsay, an automotive analyst at IHS Markit Ltd.\n\nAnd because China and the EU are the world's biggest EV producers, their regulations are seen as ultimately forcing greater EV adoption in the United States, where fuel prices might usually influence car buying.\n\n\"For good or bad, this EV thematic is driven by regulations and government incentives, rather than economics,\" Paul Graves, chief executive of lithium producers Livent Corp, told Reuters.\n\nEVs are expected to become the most-popular vehicles, globally, though the pandemic makes the timing uncertain.\n\n\"The long-term story is a structural trend toward EV adoption. It's very well on its way,\" said Pedro Palandrani of the Global X Lithium & Battery Technology ETF.\n\n(Reporting by Helen Reid and Ernest Scheyder; Editing by David Gregorio)","link":"https:\/\/finance.yahoo.com\/news\/lithium-producers-must-wait-pandemic-140537463.html?.tsrc=rss","symbols":["002460.SHE","002466.SHE","ALB.US","F.US","GNENF.US","LAC.US","VLKAF.US","VLKPF.US","VWAGY.US","VWAPY.US"],"tags":["ALBEMARLE CORP","EXPANSION PROJECTS","LITHIUM INDUSTRY","LITHIUM PRODUCERS"],"sentiment":{"polarity":0.777,"neg":0.054,"neu":0.889,"pos":0.057}}]