[{"date":"2022-07-06T00:33:01+00:00","title":"Tepco shares tumble 7% on reported interest in bid for Toshiba","content":"TOKYO (Reuters) -Shares of Tokyo Electric Power Co (Tepco) fell more than 7% on Wednesday after a news report that the Japanese power utility is considering joining a state-backed fund to buy Toshiba Corp.\n\nTepco is considering joining a partnership between state-backed Japan Investment Corp and Japan Industrial Partners to bid for Toshiba, and is eyeing the conglomerate's nuclear business, Bloomberg News reported.\n\nTepco spokesperson Ryo Terada told Reuters it was not true. Toshiba said it would not comment on details of the bidders and their proposals.\n\nSuch a move by Tepco would mark a major development in the contest for Toshiba, which last month said it had received eight buyout proposals and two offers for capital alliances. Weakened by a series of scandals, the conglomerate has promised to consider all options, including private equity buyouts, as part of a far-reaching review process.\n\nShares of Tepco fell 7.2% to 606 yen, on track for their biggest one-day drop since September as the market appeared to worry about the impact of a potential acquisition on Tepco's finances.\n\nThe participation of local funds is seen as critical to winning government approval for a Toshiba buyout as some of the conglomerate's key businesses - including defence equipment and nuclear power - are seen as strategically important to Japan.\n\nTepco, Toshiba, utility Chubu Electric Power and Hitachi Ltd in 2019 said they agreed to consider cooperating on their nuclear plant businesses, a move seen as opening the door to closer collaboration in the Japanese industry.\n\nTepco, one Japan's 30 largest firms by revenue, is 2.7% owned by the Tokyo Metropolitan Government, its third-largest shareholder, according to Refinitiv. The utility owns the Fukushima Daiichi nuclear plant crippled by an earthquake and massive tsunami in 2011 that touched off the world's worst nuclear disaster since Chernobyl.\n\nJapan's Supreme Court in March upheld an order that Tepco pay damages of around $12 million to about 3,700 people whose lives were devastated by the nuclear crisis, covering the first three of some 30 class-action suits the utility faces.\n\nStory continues\n\nThe court ruled it negligent in taking preventive measures against a tsunami of that size.\n\nJapan idled most of its nuclear plants in the aftermath of the Fukushima disaster but rising energy prices now have sparked expectations it could begin to restart them.\n\n(Reporting by Makiko Yamazaki and David Dolan; Editing by Muralikumar Anantharaman and Christopher Cushing)","link":"https:\/\/finance.yahoo.com\/news\/tepco-shares-down-more-5-003301405.html","symbols":["TKECF.US","TKECY.US","TOSBF.US","TOSYY.US","TPO.F","TSE1.F"],"tags":["CONGLOMERATE","JAPAN","TOKYO ELECTRIC POWER CO","TOSHIBA CORP"],"sentiment":{"polarity":-0.773,"neg":0.064,"neu":0.891,"pos":0.045}},{"date":"2022-07-05T10:40:43+00:00","title":"Utility Giant Tokyo Electric Mulls Joining Toshiba Bid","content":"(Bloomberg) -- Japan’s top utility company Tokyo Electric Power Co. is mulling joining a partnership between state-backed investment fund Japan Investment Corp. and a local private equity firm in bidding to take over Toshiba Corp., according to people familiar with the matter.\n\nMost Read from Bloomberg\n\nPerson of Interest in July 4 Parade Shooting That Killed Six in Police Custody Bezos Slams Biden Over Call for Lowering of Gas Prices Tesla Pauses Plants After Ending Shaky Quarter With a Production Milestone Biden Close to Rollback of Chinese Tariffs to Fight Inflation Ukraine Latest: Kyiv’s Immediate Funding Needs Hit $65 Billion\n\nThe largest power utility in Japan, known as Tepco, is looking to secure Toshiba’s nuclear business, the people said. Foreign funds have approached JIC to join the bid, according to people familiar with the matter.\n\nJIC and Japan Industrial Partners Inc. are partnering up because they don’t have enough funds on their own, they said. While foreign funds have approached JIC for potential joint offers, it’s too early to tell who JIC-JIP group will partner with or whether they will proceed with their own bid, the people said.\n\nJIC and JIP declined to comment. Tepco spokesman said it wasn’t among companies that have submitted proposals to Toshiba, without elaborating on the potential JIC and JIP partnership. Toshiba spokeswoman Midori Hara declined to provide details of proposals and potential partners for the company. Toshiba said last month it received eight offers to buy out the conglomerate and two proposals for capital and business alliances.\n\nBain Capital, CVC Capital Partners and JIC are among potential bidders for Toshiba, Bloomberg News has reported. Foreign investors have been watching developments at Toshiba to gauge shareholder influence and regulators’ acceptance of foreign private equity firms in Japan.\n\nAny sale of Toshiba, which owns key nuclear technologies, would require approval from the Japanese government. Toshiba is categorized as a company of interest to national security under the Foreign Exchange and Foreign Trade Act for is nuclear expertise.\n\nStory continues\n\nMost Read from Bloomberg Businessweek\n\nThe Lottery Lawyer Won Their Trust, Then Lost Their Mega Millions Did Razzlekhan and Dutch Pull Off History’s Biggest Crypto Heist? Gangs Are Fake-Killing People in India for Insurance Payouts Google Is Going to Let Politicians Spam Your Inbox How Generations of Black Americans Lost Their Land to Tax Liens\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/utility-giant-tokyo-electric-mulls-104043089.html","symbols":["TKECF.US","TKECY.US","TOSBF.US","TOSYY.US","TPO.F","TSE1.F"],"tags":["BLOOMBERG","JAPAN","JAPAN INDUSTRIAL PARTNERS INC","JIC","PRIVATE EQUITY FIRM"],"sentiment":{"polarity":0.875,"neg":0.044,"neu":0.884,"pos":0.072}},{"date":"2022-06-30T06:45:34+00:00","title":"Over 20% of Toshiba investors against activist fund execs, dissident director","content":"TOKYO (Reuters) - More than 20% of Toshiba Corp shareholders voted against a dissident external director and two board directors from activist hedge fund investors, final voting results showed on Thursday.\n\nSuch a level of opposition to company-backed candidates remains rare in Japan, although cases of rejection are on the rise as shareholder activism has begun to take root. Last year, Toshiba shareholders voted out the then-board chairman in a rebuke of the company after it was found to have colluded with the government in suppressing foreign investor interests.\n\nExternal director Mariko Watahiki, who opposed the candidacy of directors from Elliott Management and Farallon Capital Management, saw 23% of shareholders vote against her. She had the lowest support rate, of 64%, among 13 director nominees.\n\nWatahiki tendered her resignation soon after the vote at the annual shareholders meeting on Tuesday. The former high court judge had argued the appointments of the two could skew the board too much towards the input of activist investors.\n\nNabeel Bhanji, a senior portfolio manager at Elliott, and Eijiro Imai, managing director at Farallon, both had opposition rates of about 22%, while about 78% supported them.\n\nChief Executive Taro Shimada got 86% of votes, with more than 12% abstaining.\n\nSeven new board directors were appointed and six including Watahiki were re-appointed on Tuesday.\n\n(Reporting by Makiko Yamazaki; Editing by Tomasz Janowski)","link":"https:\/\/finance.yahoo.com\/news\/over-20-toshiba-investors-against-064534645.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ELLIOTT MANAGEMENT","FARALLON CAPITAL MANAGEMENT","MARIKO WATAHIKI","TOSHIBA CORP"],"sentiment":{"polarity":-0.511,"neg":0.046,"neu":0.917,"pos":0.037}},{"date":"2022-06-28T14:47:18+00:00","title":"CVS caps Plan B pill purchases, Envoy Air offers pay boost amid pilot shortage, KKR ends bid for Toshiba","content":"Yahoo Finance's Julie Hyman breaks down leading business headlines on emergency contraceptive sales following the Supreme Court's Roe v. Wade decision, the pilot shortage, and bidding for Toshiba.","link":"https:\/\/finance.yahoo.com\/video\/cvs-caps-plan-b-pill-144718632.html","symbols":["0P1A.F","CVS.F","CVS.MX","CVS.US","CVSH34.SA","KKR-PC.US","KKR.US","KR51.F","TOSBF.US","TOSYY.US","TSE1.F","W8A.F","WBA.US"],"tags":[],"sentiment":{"polarity":0,"neg":0.139,"neu":0.753,"pos":0.108}},{"date":"2022-06-28T12:53:00+00:00","title":"At Toshiba, Activist Investors Finally Get a Seat at the Table","content":"Toshiba said it has received 10 nonbinding proposals from different suitors. With two activist investors now on the board, the company and its shareholders must work together to remake the industrial conglomerate.","link":"https:\/\/finance.yahoo.com\/m\/5f16d62c-eb3b-3bfd-b0c1-6005c267c47f\/at-toshiba%2C-activist.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST INVESTORS","FARALLON CAPITAL","FOREIGN INVESTORS","INDEPENDENT DIRECTOR","INSTITUTIONAL SHAREHOLDER SERVICES","SHAREHOLDERS","TOSHIBA"],"sentiment":{"polarity":0,"neg":0,"neu":1,"pos":0}},{"date":"2022-06-28T10:55:56+00:00","title":"The Number of Netflix Bulls Is Dwindling","content":"(Bloomberg) -- In a year that has seen widespread selling of technology stocks and long-time market leaders fall into bear territory, the woes of Netflix Inc. stand alone.\n\nMost Read from Bloomberg\n\nRussia Slips Into Historic Default as Sanctions Muddy Next Steps Michael Burry of ‘The Big Short’ Fame Warns Fed May Alter Course Anti-Abortion Centers Find Pregnant Teens Online, Then Save Their Data A $2 Trillion Free-Fall Rattles Crypto to the Core Hyundai Quietly Climbs the EV Sales Charts and Elon Musk Notices\n\nThe video-streaming company has plummeted 69% this year, abandoned by both investors and analysts as back-to-back disappointing quarterly reports raised concerns about user trends in an industry that’s becoming more competitive and losing its pandemic-related tailwinds. The drop is the most of any Nasdaq 100 or S&P 500 component, and much worse than the former index’s 26% decline.\n\nThe growth outlook has weakened to the point that Netflix has cut hundreds of jobs and changed its tune on two longstanding principles: it is cracking down on password sharing, and will introduce an ad-based subscriber tier to the platform. That’s on top of a backdrop where high inflation has pushed the Federal Reserve to hike rates sharply, sparking recession fuels and fueling a rotation out of tech.\n\nThe scale of the challenges suggest it will be tough for Netflix to regain a valuation that exceeded that of Walt Disney Co.’s as recently as December. Now, “The Lion King” parent is worth more than twice the home of “Tiger King.”\n\n“We’ve seen a lot more competition, and the cost for Netflix to continue competing has gone up, which hurts the expectation that earnings were going to grow at aggressive rates for a long time,” said Jeremiah Buckley, who oversees nearly $48 billion as a portfolio manager at Janus Henderson Investors.\n\nEstimates for Netflix are moving in the wrong direction. The consensus for this year’s revenue now stands at $32.4 billion, which although representing year-on-year growth of 9.2%, is down from the $34.1 billion that was expected at the beginning of the year, according to data compiled by Bloomberg. The consensus for adjusted earnings has declined about 16% over the same period.\n\nStory continues\n\nThe weakening growth outlook has led Wall Street to turn sour. At the start of the year, more than 70% of analysts had Netflix as a buy. Now, just about 30% do, with Goldman Sachs Group Inc. and Benchmark Co. among the firms downgrading their opinions this month. The consensus rating -- a proxy for the ratio of buy, hold, and sell recommendations -- is at 3.35 out of 5, the lowest since 2014.\n\nYet the stock is getting ever cheaper. Netflix now trades at around 16 times estimated earnings, near the lowest since 2008, and a fraction of a 10-year average exceeding 80. Its drop this year has been steep enough that the shares have joined the Russell 1000 Value Index following a re-balancing.\n\nDavid Katz, chief investment officer at Matrix Asset Advisors, said investors “can at least make a case for Netflix” at current levels, although he remains skeptical about its prospects, given the competitive backdrop.\n\n“That’s why we’re not prepared to buy Netflix yet, even though that’s also considered a value name now,” Katz said. “It is statistically cheap, but we have more questions than answers.”\n\nTech Chart of the Day\n\nThe Philadelphia Stock Exchange Semiconductor Index has fallen 31% this year, with every component down at least 14%. Some of the worst-performing stocks in the gauge include Marvell Technology Inc., Nvidia Inc. and Advanced Micro Devices Inc. While demand has remained strong for chipmakers, the industry has been plagued by constant supply constraints.\n\nTop Tech Stories\n\nNetflix is looking to Asia after its shock first-quarter slowdown, seeking to both maintain growth in the one region where it’s still adding subscribers and replicate its success there in other parts of the world. Chinese technology stocks fell as a plan by Tencent Holdings Ltd.’s major backer to further cut its stake in the company fueled concerns more investors may look to take profits following a strong rally. Toshiba Corp. shareholders elected representatives of two vocal activist hedge funds to the board in a contentious meeting, bringing the scandal-tainted industrial giant a step closer to possible privatization. Online education provider Byju’s, India’s most valuable startup, is pushing back payments for an approximately $1 billion acquisition struck last year, according to people familiar with the matter. GlobalWafers Co. plans to build a $5 billion semiconductor silicon-wafer facility that will be the biggest of its kind on American soil, as the country contends with the fallout from a global shortage of chips. Siemens AG will buy US firm Brightly Software for $1.58 billion to add digital services for buildings and infrastructure as the German company continues its transformation into a software provider.\n\nMost Read from Bloomberg Businessweek\n\nWhy You Should Quit Your Job After 10 Years Moving to Ban Juul, the FDA Delivers a Blow to Big Nicotine A Sci-Fi Novel’s Eerily Accurate Predictions About Today’s Tech Can Crypto’s Richest Man Stand the Cold? If You’re Too Old for an Internship, Try a Returnship Instead\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/number-netflix-bulls-dwindling-105556156.html","symbols":["0700.HK","A1MD34.SA","AMD.F","AMD.MX","AMD.US","AMD.XETRA","DIS.MX","DIS.US","DISB34.SA","GOS.F","GOS.XETRA","GS-PA.US","GS-PC.US","GS-PD.US","GS-PJ.US","GS-PK.US","GS.MX","GS.US"],"tags":["BLOOMBERG","GROWTH OUTLOOK","NETFLIX","TECHNOLOGY STOCKS"],"sentiment":{"polarity":0.927,"neg":0.063,"neu":0.864,"pos":0.073}},{"date":"2022-06-28T10:27:57+00:00","title":"Toshiba Adds Activist Directors in Move Toward Privatization","content":"(Bloomberg) -- Toshiba Corp. shareholders elected representatives of two vocal activist hedge funds to the board in a contentious meeting, bringing the scandal-tainted industrial giant a step closer to possible privatization.\n\nMost Read from Bloomberg\n\nRussia Slips Into Historic Default as Sanctions Muddy Next Steps A $2 Trillion Free-Fall Rattles Crypto to the Core Michael Burry of ‘The Big Short’ Fame Warns Fed May Alter Course Anti-Abortion Centers Find Pregnant Teens Online, Then Save Their Data Hyundai Quietly Climbs the EV Sales Charts and Elon Musk Notices\n\nShareholders of the Tokyo-based company voted their support for all 13 director appointees, including Eijiro Imai of Farallon Capital and Nabeel Bhanji of Elliott Management Corp., at an annual meeting of shareholders on Tuesday. Angry investors shouted at management from the start of the meeting, disrupting executives’ presentations.\n\nThe election paves the way for a major deal that will determine Toshiba’s future. The company has said it received eight bids to privatize the company and two offers to form business alliances. The board’s first task is to narrow the list of suitors, and conduct due diligence with each, before deciding the next step for the 147-year company. Toshiba shares have gained 20% this year, partly on its plans to review privatization bids.\n\nShares were little changed in Tokyo after the shareholders’ meeting.\n\nThe presence of the new directors on the board may help quiet the company’s bitter and longstanding fracas with shareholders, who have accused management of ignoring their interests. Following years of scandals and mismanagement, investors rejected key nominations at last year’s meeting and in March put the company in a state of limbo by voting against both proposals presented after months of wrangling -- splitting the company or selling it off.\n\n“We believe management and shareholders can share the same footing by welcoming Imai and Bhanji to the board,” Chief Operating Officer Goro Yanase said.\n\nStory continues\n\nBain Capital and CVC Capital Partners are among the candidates considering bids, along with state-backed investment fund Japan Investment Corp., Bloomberg News has reported. Foreign investors have watched developments at Toshiba to gauge shareholder influence and regulators’ acceptance of foreign private equity firms in Japan. Any sale of Toshiba, which owns key nuclear technologies, would require approval from the Japanese government.\n\nPrivate Equity Giants Called Vultures Eye Breakthrough in Japan\n\nHow well the board can unite will also be critical. Toshiba external board member Mariko Watahiki earlier this month spoke out publicly against the appointments of Imai and Bhanji, saying that if they were appointed, activists would take up too much of the board. Watahiki resigned from the board after the shareholders’ meeting, Toshiba said.\n\nRetail investors at the meeting questioned the appointments of both Imai and Bhanji as well as the need for privatization. Shareholders asked whether the activist funds’ interests were aligned with what was good for the company over the long-term.\n\n“Toshiba has accumulated amazing technology precisely because it is listed,” another said. “Please do not go private.”\n\nExternal board member George Zage, who chairs the appointment committee that nominated Imai and Bhanji, said that the company consulted multiple law firms to review conflicts of interest, and that the appointments were designed to address lack of trust between large shareholders and management. Chief Executive Officer Taro Shimada responded to shareholders opposing privatization by saying the company would thoroughly study all options.\n\nThe board’s first order of business, however, is finding a clear direction, said Chieko Matsuda, a professor at Tokyo Metropolitan University who specializes in corporate governance. Even after spinning out its memory chips, home appliances, PCs and TVs, the sprawling industrial conglomerate’s remaining products still span the gamut from nuclear turbines and high-speed trains to batteries, elevators, cloud computing and semiconductors.\n\n“It is completely unclear where Toshiba is headed, what its business will be, or how it sees its future,” she said.\n\n(Updates with board member resigning in the eighth paragraph)\n\nMost Read from Bloomberg Businessweek\n\nWhy You Should Quit Your Job After 10 Years Moving to Ban Juul, the FDA Delivers a Blow to Big Nicotine A Sci-Fi Novel’s Eerily Accurate Predictions About Today’s Tech Can Crypto’s Richest Man Stand the Cold? If You’re Too Old for an Internship, Try a Returnship Instead\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/toshiba-adds-activist-directors-move-055117676.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["BLOOMBERG","EIJIRO IMAI","FARALLON CAPITAL","NABEEL BHANJI","PRIVATIZATION","TOSHIBA CORP"],"sentiment":{"polarity":0.945,"neg":0.055,"neu":0.87,"pos":0.075}},{"date":"2022-06-28T10:03:11+00:00","title":"KKR Backs Out of Bidding for Toshiba, FT Says","content":"(Bloomberg) -- KKR & Co. is backing away from a potential $22 billion bidding war for Toshiba Corp., the Financial Times reported, citing people familiar with the discussions.\n\nMost Read from Bloomberg\n\nRussia Slips Into Historic Default as Sanctions Muddy Next Steps A $2 Trillion Free-Fall Rattles Crypto to the Core Michael Burry of ‘The Big Short’ Fame Warns Fed May Alter Course Anti-Abortion Centers Find Pregnant Teens Online, Then Save Their Data Hyundai Quietly Climbs the EV Sales Charts and Elon Musk Notices\n\nThe private equity giant has lost enthusiasm for a takeover of the Japanese industrial icon, opting instead to acquire businesses that will get spun off during a privatization process, the newspaper said.\n\nKKR’s retreat could pave the way for rivals like Bain Capital to acquire the company, which is trying to leave behind years of scandal and mismanagement. Toshiba has said it’s received eight bids to privatize the company and two offers to form business alliances. KKR and Blackstone Inc. had held exploratory discussions about teaming up on a joint bid for the Japanese conglomerate, Bloomberg News reported in May.\n\nRead more: Toshiba Adds Activist Directors in Move Toward Privatization\n\nMost Read from Bloomberg Businessweek\n\nWhy You Should Quit Your Job After 10 Years Moving to Ban Juul, the FDA Delivers a Blow to Big Nicotine A Sci-Fi Novel’s Eerily Accurate Predictions About Today’s Tech Can Crypto’s Richest Man Stand the Cold? If You’re Too Old for an Internship, Try a Returnship Instead\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/kkr-backs-bidding-toshiba-ft-100311623.html","symbols":["BBN1.F","BX.US","KKR-PC.US","KKR.US","KR51.F","TOSBF.US","TOSYY.US","TSE1.F"],"tags":["BLOOMBERG","BLOOMBERG NEWS","KKR","TOSHIBA"],"sentiment":{"polarity":0.361,"neg":0.059,"neu":0.873,"pos":0.068}},{"date":"2022-06-28T09:07:43+00:00","title":"Japan's state-backed JIC hires SMBC Nikko for potential Toshiba deal -sources","content":"By Makiko Yamazaki and Kane Wu\n\nTOKYO\/HONG KONG (Reuters) - State-backed Japan Investment Corp (JIC) has hired SMBC Nikko Securities as its financial adviser for its pursuit of a potential equity investment in conglomerate Toshiba Corp, two people familiar with the matter told Reuters.\n\nToshiba said this month it had received eight initial buyout proposals as well as two proposals for capital alliances that would see it remain listed. It plans to shortlist bidders soon so that selected suitors can start due diligence from July.\n\nThe company's shareholders on Tuesday voted in two board directors from activist hedge fund investors at its annual general meeting - an inclusion that is expected to add momentum to its exploration of potential buyout deals.\n\nJapanese funds, including JIC, and a number of strategic players are looking to see how they can participate in the deal, Reuters reported last week, citing people familiar with the matter.\n\nIt was not immediately clear whether JIC is planning to join hands with a global private equity fund or form its own consortium, but the two sources said that the fund is currently seeking financing for a potential deal.\n\nJIC declined to comment, while an SMBC Nikko spokesperson said the company would not comment on individual deals. Toshiba said it would not comment on details of the bidders and their proposals.\n\nSources told Reuters last week that at least one bidder is considering offering up to 7,000 yen per share to take Toshiba private, valuing a potential deal at up to $22 billion.\n\nThis year SMBC Nikko and six former executives were indicted on market manipulation charges concerning the purchase of 10 individual stocks, accused of seeking to push up stock prices and ensure block trade deals in them did not fall through.\n\nAccording to one of the two sources and a separate source familiar with the situation, SMBC Nikko was not chosen by Toshiba as a financial adviser due to the scandal. The SMBC spokesperson and Toshiba also declined to comment on the conglomerate's choice of financial advisers.\n\nIn response to the scandal, SMBC Nikko said last week it would take seriously an investigation report conducted by outside lawyers that found there was inappropriate and unfair conduct.\n\n(Reporting by Makiko Yamazaki in Tokyo and Kane Wu in Hong Kong; Editing by Edwina Gibbs)","link":"https:\/\/finance.yahoo.com\/news\/japans-state-backed-jic-hires-090743534.html","symbols":["SMBC.US","TOSBF.US","TOSYY.US","TSE1.F"],"tags":["EQUITY INVESTMENT","FINANCIAL ADVISER","JAPAN INVESTMENT CORP","JIC","PRIVATE EQUITY FUND","SMBC NIKKO SECURITIES","TOSHIBA CORP"],"sentiment":{"polarity":-0.926,"neg":0.067,"neu":0.886,"pos":0.046}},{"date":"2022-06-28T04:19:00+00:00","title":"Toshiba Shareholders Vote to Add Activist Investors to Board","content":"Toshiba shareholders approved the company’s proposal to invite representatives from two foreign activist funds onto its board, a move which may help speed the transition of the troubled industrial conglomerate.","link":"https:\/\/finance.yahoo.com\/m\/be4b1195-f793-3d61-9020-3edf3df0d7cf\/toshiba-shareholders-vote-to.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["APPOINTMENTS","FARALLON CAPITAL MANAGEMENT","SHAREHOLDERS","TOSHIBA"],"sentiment":{"polarity":0.477,"neg":0.085,"neu":0.712,"pos":0.202}},{"date":"2022-06-28T03:29:54+00:00","title":"UPDATE 4-Toshiba board gains two directors from activist funds in historic shift","content":"(Adds JIC hiring financial adviser and analyst comment)\n\nBy Makiko Yamazaki\n\nTOKYO, June 28 (Reuters) - Toshiba Corp shareholders voted in two board directors from activist hedge fund investors at its annual general meeting on Tuesday - an inclusion expected to add momentum to its exploration of potential buyout deals.\n\nNabeel Bhanji, a senior portfolio manager at Elliott Management, and Eijiro Imai, managing director at Farallon Capital Management were elected, as was Akihiro Watanabe, an executive from boutique U.S. investment bank Houlihan Lokey, who becomes board chairman.\n\nThe appointment of Bhanji and Imai was not without controversy and external director Mariko Watahiki tendered her resignation right after the vote, TV Tokyo reported. Toshiba declined comment.\n\nWatahiki, a former high court judge, had argued their appointments could make the board too skewed towards the input of activist investors.\n\nTo date only a few large Japanese companies have brought activist shareholders onto their boards. The inclusion by Toshiba is particularly significant given its history of accounting and governance crises since 2015 and tensions with its large activist investor base.\n\n\"One of the major issues that we've had as a company is a lack of trust between our large shareholders and management, and this was an attempt to address that,\" Raymond Zage, who chairs Toshiba's nomination committee, told the meeting before the vote.\n\nFarallon and Elliott together hold about 10% of Toshiba and activist shareholders are estimated to own roughly a quarter of the company.\n\nBUYOUT TALKS IN FOCUS\n\nTensions with activist investors were especially fraught last year when a shareholder-commissioned investigation concluded Toshiba had colluded with Japan's trade ministry - which sees the company's nuclear and defence technology as a strategic asset - to block overseas investors from gaining influence at its 2020 shareholder meeting.\n\nThis year, shareholders rejected management-backed plans to split the company in half, prompting Toshiba to restart a strategic review.\n\nStory continues\n\n\"Since the shareholders voted down the board's strategy to split, the board has had no choice but to try to produce the outcome preferred by the large shareholders - privatisation,\" said Travis Lundy, an analyst at Quiddity Advisors who publishes on the Smartkarma platform.\n\n\"It may not be successful but they don't have the choice to do nothing.\"\n\nSeven new board directors were appointed and six including Watahiki were reappointed on Tuesday.\n\nToshiba said this month it had received eight initial buyout proposals to go private as well as two proposals for capital alliances that would see it remain listed.\n\nIt plans to shortlist bidders soon so selected suitors can start due diligence from July.\n\nJerry Black, who chairs the board's committee in charge of the strategic review, told the AGM that going private \"could possibly help\" with a radical and speedy transformation of Toshiba, while stressing that the committee has no predetermined points of view.\n\nSources have told Reuters at least one bidder is considering offering up to 7,000 yen per share to take the company private, valuing a potential deal at up to $22 billion.\n\nKKR & Co Inc, Baring Private Equity Asia, Blackstone Inc, Bain Capital, Brookfield Asset Management, MBK Partners, Apollo Global Management and CVC Capital Partners have submitted initial bids, according to sources with knowledge of the matter.\n\nSome of them may form consortia for a bid, they added.\n\nJapanese funds are also looking to see how they can participate in any deal. State-backed Japan Investment Corp has hired SMBC Nikko Securities as its financial adviser for a potential equity investment, two people familiar with the matter said.\n\nToshiba shares turned positive on the news of the board director appointments and finished 0.7% higher at 5,745 yen. That's up 21% since the end of the year, giving it a market value of $18 billion.\n\n(Reporting by Makiko Yamazaki; Additional reporting by Dave Dolan in Tokyo and Kane Wu in Hong Kong; Editing by Edwina Gibbs)","link":"https:\/\/finance.yahoo.com\/news\/1-toshiba-board-gains-two-032954421.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST INVESTORS","BOARD DIRECTORS","ELLIOTT MANAGEMENT","FARALLON CAPITAL MANAGEMENT","FINANCIAL ADVISER","SHAREHOLDERS","TOSHIBA CORP"],"sentiment":{"polarity":0.968,"neg":0.034,"neu":0.897,"pos":0.069}},{"date":"2022-06-28T03:19:16+00:00","title":"Toshiba board gains two directors from activist funds in historic shift","content":"By Makiko Yamazaki\n\nTOKYO (Reuters) -Toshiba Corp shareholders voted in two board directors from activist hedge fund investors at its annual general meeting on Tuesday - an inclusion expected to add momentum to its exploration of potential buyout deals.\n\nNabeel Bhanji, a senior portfolio manager at Elliott Management, and Eijiro Imai, managing director at Farallon Capital Management were elected, as was Akihiro Watanabe, an executive from boutique U.S. investment bank Houlihan Lokey, who becomes board chairman.\n\nThe appointment of Bhanji and Imai was not without controversy and external director Mariko Watahiki tendered her resignation right after the vote, TV Tokyo reported. Toshiba declined comment.\n\nWatahiki, a former high court judge, had argued their appointments could make the board too skewed towards the input of activist investors.\n\nTo date only a few large Japanese companies have brought activist shareholders onto their boards. The inclusion by Toshiba is particularly significant given its history of accounting and governance crises since 2015 and tensions with its large activist investor base.\n\n\"One of the major issues that we've had as a company is a lack of trust between our large shareholders and management, and this was an attempt to address that,\" Raymond Zage, who chairs Toshiba's nomination committee, told the meeting before the vote.\n\nFarallon and Elliott together hold about 10% of Toshiba and activist shareholders are estimated to own roughly a quarter of the company.\n\nBUYOUT TALKS IN FOCUS\n\nTensions with activist investors were especially fraught last year when a shareholder-commissioned investigation concluded Toshiba had colluded with Japan's trade ministry - which sees the company's nuclear and defence technology as a strategic asset - to block overseas investors from gaining influence at its 2020 shareholder meeting.\n\nThis year, shareholders rejected management-backed plans to split the company in half, prompting Toshiba to restart a strategic review.\n\nStory continues\n\n\"Since the shareholders voted down the board's strategy to split, the board has had no choice but to try to produce the outcome preferred by the large shareholders - privatisation,\" said Travis Lundy, an analyst at Quiddity Advisors who publishes on the Smartkarma platform.\n\n\"It may not be successful but they don't have the choice to do nothing.\"\n\nSeven new board directors were appointed and six including Watahiki were reappointed on Tuesday.\n\nToshiba said this month it had received eight initial buyout proposals to go private as well as two proposals for capital alliances that would see it remain listed.\n\nIt plans to shortlist bidders soon so selected suitors can start due diligence from July.\n\nJerry Black, who chairs the board's committee in charge of the strategic review, told the AGM that going private \"could possibly help\" with a radical and speedy transformation of Toshiba, while stressing that the committee has no predetermined points of view.\n\nSources have told Reuters at least one bidder is considering offering up to 7,000 yen per share to take the company private, valuing a potential deal at up to $22 billion.\n\nKKR & Co Inc, Baring Private Equity Asia, Blackstone Inc, Bain Capital, Brookfield Asset Management, MBK Partners, Apollo Global Management and CVC Capital Partners have submitted initial bids, according to sources with knowledge of the matter.\n\nSome of them may form consortia for a bid, they added.\n\nJapanese funds are also looking to see how they can participate in any deal. State-backed Japan Investment Corp has hired SMBC Nikko Securities as its financial adviser for a potential equity investment, two people familiar with the matter said.\n\nToshiba shares turned positive on the news of the board director appointments and finished 0.7% higher at 5,745 yen. That's up 21% since the end of the year, giving it a market value of $18 billion.\n\n(Reporting by Makiko Yamazaki; Additional reporting by Dave Dolan in Tokyo and Kane Wu in Hong Kong; Editing by Edwina Gibbs)","link":"https:\/\/finance.yahoo.com\/news\/toshiba-board-gains-two-directors-031916075.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST INVESTORS","ANNUAL GENERAL MEETING","BOARD DIRECTORS","BROOKFIELD ASSET MANAGEMENT","ELLIOTT MANAGEMENT","FARALLON CAPITAL MANAGEMENT","NABEEL BHANJI","SHAREHOLDERS","TOSHIBA CORP"],"sentiment":{"polarity":0.968,"neg":0.035,"neu":0.895,"pos":0.07}},{"date":"2022-06-27T11:35:41+00:00","title":"Meta Plunge Lures Value Buyers as Growth Funds Flee","content":"(Bloomberg) -- For years, investors valued Facebook’s parent company as if its growth would never falter. Now that it has, fund managers who buy cheap, out-of-favor stocks are finally getting a chance to own shares of Meta Platforms Inc.\n\nMost Read from Bloomberg\n\nRussia Defaults on Foreign Debt for First Time Since 1918 Hyundai Quietly Climbs the EV Sales Charts and Elon Musk Notices Rep. Mary Miller Calls Roe Decision ‘Victory for White Life’ Russia Is Hours Away From Its First Foreign Default in a Century Germany Pushes for G-7 Reversal on Fossil Fuels in Climate Blow\n\nStock pickers at value firms Dodge & Cox, First Eagle Investment Management and Artisan Partners bought millions of Meta shares this year. Index-tracking investors now will be buying too: After FTSE Russell’s annual overhaul of its equity benchmarks, Meta on Monday joined other former growth darlings Netflix Inc. and PayPal Holdings Inc. in the firm’s value indexes, which serve as the basis for billions of dollars of passive portfolios.\n\nMeta began to attract bargain hunters after the company announced in February that Facebook’s user growth had stalled, sending the shares plunging. The stock last week reached its cheapest level ever, relative to earnings. For investors who believe the problems at Facebook are temporary, that’s a buying opportunity.\n\n“We own Meta and are very upbeat about it here,” said David Katz, chief investment officer at value firm Matrix Asset Advisors. “You want to find dynamic growth companies at value prices. Meta has a good outlook, but it is being priced as though it’s in a secular decline.”\n\nValue funds look for stocks that are cheap relative to earnings or book value, often because of business setbacks that at least temporarily derail sales growth or profitability. Until recently Meta didn’t fit the bill: The stock traded for an averaqe of 38 times estimated earnings in the first five years after its 2012 initial public offering as more people flocked to Facebook, Instagram and WhatsApp.\n\nStory continues\n\nShare of the company, which changed its name from Facebook to Meta in October, surged more than 780% from the IPO through the end of last year, handily beating the S&P 500 and the Nasdaq 100. Revenue rose 23-fold in that time.\n\nHowever, with user growth stalling, the company has lost half its value this year, trading now at 12 times earnings versus a multiple of 20 for the Nasdaq 100 and 16 for the S&P 500.\n\nMeta “is a deep value stock,” said Alex Umansky, a global equities portfolio manager at growth investor Baron Capital.\n\nThe company is getting hit on many fronts, including a “massive brain drain,” regulatory crackdowns and, most crucially, slowing user growth, because everyone who wants to be on Facebook, WhatsApp or Instagram already is, said Umansky, whose fund owned the stock from its 2012 debut until the end of last year.\n\nBrokerages estimate that the social media giant, which makes nearly all of its revenue from digital ads, will increase its revenue by 6.8% this year, the slowest pace ever, in part because of a slowing economy. They see growth picking up to around 15% in each of the next two years.\n\nTo be sure, the Facebook parent still has the best gross profit margin among megacap peers Apple Inc., Amazon.com Inc., Netflix and Alphabet Inc. If investors become more confident that growth will pick up again, and award the company the same valuation as the Nasdaq 100 based on estimated earnings for the next four quarters, the stock would trade at about $276, or 62% above Friday’s closing price of about $170.\n\n“We’re with the market in being cautious in the short term but are extremely optimistic in the long run,” said Global X Research analyst Tejas Dessai.\n\nTech Chart of the Day\n\nTelecommunications companies T-Mobile US Inc., AT&T Inc. and Verizon Communications Inc. have waded through multiple selloffs this year that have pounded the stock price sof technology companies big and small alike. Shares of T-Mobile are up 18%, AT&T has gained 13% and Verizon is down 2% this year. Meanwhile, the tech-heavy Nasdaq 100 Index is down 26% in the same period.\n\nTop Tech Stories\n\nProsus NV is planning to sell more of its $134 billion stake in Chinese internet giant Tencent Holdings Ltd. to finance a buyback program, reversing a pledge to hold onto the full shareholding. Toshiba Corp. is expected to appoint representatives of its two most vocal activist shareholders to the board Tuesday, taking a step forward in corporate governance but potentially widening rifts between directors. Apple Inc. is about to embark on one of the most ambitious periods of new products in its history—with the deluge coming between the fall of 2022 and first half of 2023. The new products will include four iPhone 14 models, three Apple Watch variations, several Macs with M2 and M3 chips, the company’s first mixed-reality headset, low-end and high-end iPads, updated AirPods Pro earbuds, a fresh HomePod and an upgraded Apple TV. Taiwan’s industrial sector, including the world’s largest contract chipmaker, will be hit with the island’s first power price increase in four years as the state-owned utility grapples with soaring fuel costs. Pakistani ride-sharing and delivery startup Bykea raised $10 million from its existing backers to tap rising demand for online services in the South Asian country.\n\n(Updates second paragraph to show change in style indexes has taken effect)\n\nMost Read from Bloomberg Businessweek\n\nSpotify’s Billion-Dollar Bet on Podcasting Has Yet to Pay Off Why You Should Quit Your Job After 10 Years Can Crypto’s Richest Man Stand the Cold? A Sci-Fi Novel’s Eerily Accurate Predictions About Today’s Tech Moving to Ban Juul, the FDA Delivers a Blow to Big Nicotine\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/meta-plunge-lures-value-buyers-113541786.html","symbols":["05M.F","0700.HK","2PP.F","2PP.XETRA","AAPL.US","ABEA.F","ABEA.XETRA","ABEC.F","ABEC.XETRA","AMZ.F","AMZ.XETRA","AMZN.MX","AMZN.US","AMZO34.SA","BAC.F","BAC.XETRA","D05.SG","GOGL34.SA","GOGL35.SA"],"tags":["ARTISAN PARTNERS","BLOOMBERG","FACEBOOK","FIRST EAGLE INVESTMENT MANAGEMENT","META PLATFORMS INC","PARENT COMPANY","PAYPAL HOLDINGS INC"],"sentiment":{"polarity":0.998,"neg":0.03,"neu":0.843,"pos":0.127}},{"date":"2022-06-27T06:50:04+00:00","title":"Toshiba shareholders to endorse director nominees as buyout expectations grow","content":"By Makiko Yamazaki\n\nTOKYO (Reuters) - Toshiba Corp's shareholders are expected to endorse all proposed directors, including two from its hedge fund investors, on Tuesday in a move that could mark a crossroads for the 146-year-old Japanese conglomerate and hasten a potential buyout.\n\nThe company has nominated executives from Elliott Management and Farallon Capital Management for approval as outside directors at its annual general meeting, a move designed to end a long-running battle between the company and activist investors.\n\nInfluential proxy advisers Institutional Shareholder Services Inc (ISS) and Glass Lewis have both recommended voting for their appointments.\n\nBut the proposal has not been without hitches - and critics. External director Mariko Watahiki, a former high court judge, has objected to the candidates put forward by Elliott and Farallon, saying the pair's presence on the board would skew it toward activist investors.\n\nSeveral domestic asset managers who own Toshiba shares told Reuters they agree with Watahiki's view. \"The scope of those shareholders (Elliott and Farallon) is probably much narrower than ours,\" said one, referring to the funds' interest in supporting a buyout over a longer-term strategic approach.\n\nHowever, Watahiki's objection is unlikely to amass support to reject the nominations, a person familiar with the matter said, speaking - like the asset managers - on condition of anonymity because the matter was private.\n\nThe board nominations are among signs that Toshiba, which has been exploring strategic options after shareholders voted down a restructuring plan, has become more receptive to the idea of being taken private, say hedge fund shareholders.\n\nThe shareholder representatives are expected to join the board's special committee in charge of an ongoing strategic review, Toshiba has said. If they are voted in, attention would then turn to whether director Watahiki, who serves on the committee, would retain that role.\n\nStory continues\n\nToshiba said this month it had received eight initial buyout proposals as well as two proposals for capital alliances that would see it remain listed.\n\nReuters reported that the bidders are considering offering up to 7,000 yen ($51.84) per share to take the company private, valuing the deal at up to $22 billion, although the pricing range was wide and various conditions have been attached.\n\nToshiba's shares closed at 5,707 yen on Monday, giving it a market value of $18 billion, having risen 21% since the start of the year.\n\n($1 = 135.0400 yen)\n\n(Reporting by Makiko Yamazaki; Editing by Kenneth Maxwell)","link":"https:\/\/finance.yahoo.com\/news\/toshiba-shareholders-endorse-director-nominees-065004934.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST INVESTORS","ELLIOTT MANAGEMENT","FARALLON CAPITAL MANAGEMENT","HEDGE FUND INVESTORS","INSTITUTIONAL SHAREHOLDER SERVICES INC","MARIKO WATAHIKI","SHAREHOLDERS","TOSHIBA CORP"],"sentiment":{"polarity":0.99,"neg":0.013,"neu":0.862,"pos":0.126}},{"date":"2022-06-23T13:42:43+00:00","title":"MicroStrategy Bulls Unfazed by Double Dose of Pain","content":"(Bloomberg) -- Shares of MicroStrategy Inc. have been hit hard this year as its once-winning approach of being a tech company that also holds billions of dollars in Bitcoin sends investors rushing for the exit. Analysts are holding fast in their bullishness.\n\nMost Read from Bloomberg\n\nThe World’s Bubbliest Housing Markets Are Flashing Warning Signs Elon Musk Says New Tesla Plants Are ‘Money Furnaces’ Losing Billions Juul Soon to Be Ordered Off the Market by FDA, WSJ Reports Powell Says Soft Landing ‘Very Challenging;’ Recession Possible Stocks Snap Rally as Recession Fears Mount: Markets Wrap\n\nThree of the four brokerages that follow the software company recommend buying the shares, with an average price target that’s more than triple where the stock closed Wednesday, according to data compiled by Bloomberg.\n\nUnder Chief Executive Officer Michael Saylor, MicroStrategy has spent about $4 billion on tokens as of March 31. While that was a hot strategy in the pandemic-fueled market boom -- when tech stocks and Bitcoin surged to record heights -- MicroStrategy is now mired in the historic selloff that’s hitting both areas, slumping 69% this year. That’s deeper than the Nasdaq 100 Index’s 29% decline and Bitcoin’s 55% drop.\n\n“MicroStrategy provides equity investors in particular with not only exposure to Bitcoin, which currently they don’t have many efficient ways to access,” said Mark Palmer, an analyst at BTIG with a buy rating. The company also offers an operating business that generates cash with which to buy more Bitcoin, he said.\n\nThis isn’t MicroStrategy’s first rollercoaster ride. Its shares soared more than 3,400% during the dotcom bubble and subsequently wiped out all those gains during the collapse. The Covid-19 pandemic, which saw the rise of the retail trader, evoked memories of a similar rally thanks to Bitcoin’s surge: At one point, its shares were up more than 1,200%.\n\nNow, they are on pace for their worst year since 2000, fueled by the crypto rout and bear-market plunge in tech. The Federal Reserve triggered the decline in both by aggressively raising interest rates to cool inflation, fueling concern that the economy is headed for a recession. Just last week, the world’s largest cryptocurrency plunged below $20,000 for the first time since late 2020.\n\nStory continues\n\nThe crypto crash generated losses for Saylor of about $3.5 billion, according to the Bloomberg Billionaires Index. His 2.36 million MicroStrategy shares and options peaked in February 2021, when they were worth nearly $3 billion. They’ve since plunged 86% to $355 million. Meanwhile, the Bitcoins he said in October 2020 that he owned are worth $350 million, down 71% from their $1.22 billion peak.\n\nPalmer’s share-price target of $950 is the highest among analysts covering the stock, more than five times MicroStrategy’s closing price of $170.91. He also estimates that Bitcoin will more than quadruple from its current level to hit $95,000 by 2023.\n\nBrent Thill of Jefferies is the only non-bull on MicroStrategy, rating the stock hold with a $180 price target. Management needs to focus on the core software business, which declined 3% in the first quarter, Thill wrote in a June 16 note.\n\nStill, it’s hard to ignore the potential multibillion-dollar writedowns that the company could be facing. Total impairment charges on MicroStrategy’s Bitcoin holdings already reached roughly $1 billion at the end of the last quarter. The company has also come under scrutiny due to the possibility that it could face a margin call on a $205 million loan it took out this year to buy more Bitcoin.\n\nSaylor, however, told investors this month not to worry about a potential margin call, saying the company has ample collateral to pledge if necessary.\n\nTech Chart of the Day\n\nApple Inc. and Saudi Aramco have been tightly contesting the title of the world’s most valuable company as major forces shake up the global economy. In May, the crude producer overtook the iPhone maker, helped by the surge in oil prices while concerns around rising inflation triggered multiple routs in technology stocks. Apple shares were trading higher on Thursday, putting the stock on course for its best week in June.\n\nTop Tech Stories\n\nUber Technologies Inc. explored options for its Indian ride-hailing business, including a sale, but suspended discussions after tech startup valuations cratered, people familiar with the matter said. Elon Musk said Tesla Inc.’s new plants in Germany and Texas are losing “billions of dollars” as the electric-vehicle maker tries to ramp up production. SumUp has achieved an 8 billion euro ($8.4 billion) valuation in its latest funding round, raising 590 million euros in a deal split between debt and equity in a bid to develop new products and gain clients. Toshiba Corp. shares jumped Thursday after Reuters reported bidders are considering offering up to 7,000 yen per share to take the company private, which would value the deal at about $22 billion. JPMorgan Asset Management is doubling down on China tech stocks after enduring a tumultuous selloff, betting that an easing of regulatory crackdowns and attractive valuations will pay off well. Meta Platforms Inc. Chief Executive Officer Mark Zuckerberg said he expects people will eventually spend “hundreds of dollars” each buying digital goods in the metaverse, including things like clothes for their virtual avatars. SoftBank Group Corp. founder Masayoshi Son is used to praise and encouragement from shareholders. But the company’s loss of $34 billion in market value over the last year is a test for even his most faithful admirers when they gather for the annual shareholders’ meeting on Friday.\n\n(Adds stock move in last paragragh.)\n\nMost Read from Bloomberg Businessweek\n\nCan Crypto’s Richest Man Stand the Cold? China’s Property Slump Is a Bigger Threat Than Its Lockdowns LVMH Has a Younger Arnault Working on Its Makeover of Tiffany’s The Global Currency Wars Have Begun Because, Well, Inflation Wall Street Gets Ready to Rumble Over Stock-Trading Rules\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/microstrategy-bulls-unfazed-double-dose-103852231.html","symbols":["300371.SHE","AAPL.MX","AAPL.US","AAPL34.SA","AIAFX.US","APC.F","APC.XETRA","CMC.F","CMC.XETRA","FB.MX","FB.US","FB2A.F","FB2A.XETRA","JPM-PC.US","JPM-PD.US","JPM-PK.US","JPM-PL.US","JPM-PM.US","JPM.MX"],"tags":["BLOOMBERG","BLOOMBERG BILLIONAIRES INDEX","MICHAEL SAYLOR","MICROSTRATEGY","SOFTWARE COMPANY","TECH STOCKS"],"sentiment":{"polarity":0.987,"neg":0.054,"neu":0.857,"pos":0.088}},{"date":"2022-06-23T11:26:36+00:00","title":"Bidders Offers Value Toshiba Up To $22B: Reuters","content":"Potential buyers for Japanese conglomerate Toshiba Corp (OTC: TOSYY) are mulling offering up to 7,000 yen ($51.41) per share, Reuters reported. The offer price, if realized, will value the company at about $22 billion, representing a 27% premium to Toshiba's share price of 5,501 yen as of Wednesday's close. Related: Toshiba Gets Privatization Proposals - Guess How Many Are Interested KKR & Co. Inc (NYSE: KKR), Baring Private Equity Asia, Blackstone Inc. (NYSE: BX), Bain Capital, Brookfield Asset Management Inc (NYSE: BAM), MBK Partners, Apollo Global Management, and CVC Capital Partners are some of the bidders, according to Reuters. Toshiba has been facing an operational crisis since 2015 when it disclosed accounting malpractice. Price Action: TOSYY shares closed higher by 9.90% at $22.42 on Wednesday. Photo Via Wikimedia Commons\n\nSee more from Benzinga\n\nRed Robin Gourmet Burgers CEO To Retire At 2022-End Read Why Cowen Downgraded This Fast-Food Restaurant Chain\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\n© 2022 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.","link":"https:\/\/finance.yahoo.com\/news\/bidders-offers-value-toshiba-22b-112636597.html","symbols":["BAM.US","BX.US","KKR.US","TOSBF.US","TOSYY.US","TSE1.F"],"tags":["APOLLO GLOBAL MANAGEMENT","BAIN CAPITAL","BROOKFIELD ASSET MANAGEMENT INC","CVC CAPITAL PARTNERS","KKR","NYSE","SHARE PRICE","TOSHIBA CORP"],"sentiment":{"polarity":0.967,"neg":0.02,"neu":0.833,"pos":0.147}},{"date":"2022-06-23T06:32:51+00:00","title":"Japan to End Financing of Key Coal Projects Under Climate Pledge","content":"(Bloomberg) -- Japan will withdraw financing for key coal-fired power plant projects in Bangladesh and Indonesia under efforts aimed at accelerating a global phase-out of the dirtiest fossil fuel.\n\nMost Read from Bloomberg\n\nThe World’s Bubbliest Housing Markets Are Flashing Warning Signs Juul Soon to Be Ordered Off the Market by FDA, WSJ Reports Elon Musk Says New Tesla Plants Are ‘Money Furnaces’ Losing Billions Stocks Snap Rally as Recession Fears Mount: Markets Wrap Powell Says Soft Landing ‘Very Challenging;’ Recession Possible\n\nAsia’s second-largest economy will stop providing government-backed yen loans to the Matarbari 2 coal expansion project in Bangladesh and the Indramayu plant in Indonesia, the country’s Foreign Ministry said in a statement.\n\nThe move comes days ahead of a meeting of Group of Seven nations, which agreed last year to stop international financing of coal projects. Japan initially opposed that move, and while it subsequently tightened conditions for overseas coal projects, it has faced sharp criticism over its support for new developments under certain condition.\n\nJapan accounted for more than half of the $6.6 billion of coal support from G-7 countries in 2019, according to Bloomberg NEF.\n\nRead more: Coal’s Stigma Imperils Japan Projects as Contractors Bow Out\n\nBangladesh said it won’t go forward with the coal-based plan for Matarbari 2, instead building a liquefied natural gas-based plant as the country shifts to alternative energy sources. The country “is moving away from coal power,” Nasrul Hamid, state minister for power and energy, said in a phone interview. “In 2021, the government canceled plans to build 10 coal power plants that were expected to pull in about $10 billion in investments.”\n\nThe Indramayu project is already on hold and could be halted completely in line with Indonesia’s net zero target, according to Wanhar, director of electricity program supervision at the country’s energy and mineral resources ministry.\n\nStory continues\n\nJapanese companies are also withdrawing from the coal sector amid scrutiny from activist investors. Sumitomo Corp. and Toshiba Corp. have both indicated they won’t take new orders for coal-fired projects, while commercial banks have also made similar pledges.\n\nClimate activists are wary of plans to simply replace coal-sector projects with LNG-fired plants, which risks locking in the use of fossil fuels for decades. “This would be a lunge towards runaway global warming in the same vein as new coal power,” said Julien Vincent, executive director of Market Forces, an Australia-based campaign group.\n\n(Updates with Indonesia official comment in sixth paragraph; climate group comment in final paragraph.)\n\nMost Read from Bloomberg Businessweek\n\nLVMH Has a Younger Arnault Working on Its Makeover of Tiffany’s China’s Property Slump Is a Bigger Threat Than Its Lockdowns Can Crypto’s Richest Man Stand the Cold? Ethereum Mining Is Going Away, and Miners Are Not Happy The NBA Turns to Africa to Fuel Basketball’s Next Era of Growth\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/japan-end-financing-key-coal-033624661.html","symbols":["AIAFX.US","CL.COMM","NG.COMM","SSUMF.US","SSUMY.US","SUMA.F","TOSBF.US","TOSYY.US","TSE1.F"],"tags":["BANGLADESH","BLOOMBERG","COAL POWER PLANTS","COAL PROJECTS","COAL-FIRED POWER PLANT","INDONESIA","JAPAN"],"sentiment":{"polarity":-0.75,"neg":0.063,"neu":0.885,"pos":0.052}},{"date":"2022-06-23T03:03:00+00:00","title":"Toshiba shares rise on potential offer to take company private","content":"Toshiba Corp. shares gained on a report that bidders may offer up to 7,000 yen ($51.38) a share to take the Japanese conglomerate private.","link":"https:\/\/finance.yahoo.com\/m\/a61a3c99-33f1-39fa-824e-35ebd29706a0\/toshiba-shares-rise-on.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["DOW JONES NEWSWIRES","TOSHIBA CORP"],"sentiment":{"polarity":0.718,"neg":0,"neu":0.731,"pos":0.269}},{"date":"2022-06-23T00:24:19+00:00","title":"Toshiba Surges on Report of Bids at $22 Billion Valuation","content":"(Bloomberg) -- Toshiba Corp. shares jumped as much as 6.5% on Thursday after Reuters reported bidders are considering offering up to 7,000 yen per share to take the company private, which would value the deal at about $22 billion.\n\nMost Read from Bloomberg\n\nThe World’s Bubbliest Housing Markets Are Flashing Warning Signs Juul Soon to Be Ordered Off the Market by FDA, WSJ Reports Switzerland Imports Russian Gold for First Time Since War Stocks Snap Rally as Recession Fears Mount: Markets Wrap Liz Cheney Is Paying the Price in Her Home State for Crossing Trump\n\nToshiba has been soliciting acquisition offers -- and other restructuring proposals -- as it seeks to end years of mismanagement and mollify activist investors. Ten offers are on the table, including eight to take the company private. The range of pricing and conditions for privatization was widespread, the report said, citing people familiar with the situation.\n\n“That suggests that some assets would need to be carved out, or spun out - like Kioxia - and if spun out, that would mean a lower price for the rest of the basket,” analyst Travis Lundy wrote in a note on Smartkarma. There is still a long way to go and the price could well be lowered in the second round of bidding, he added.\n\nThe tech conglomerate’s Tokyo-listed stock closed at 5,501 yen the day prior.\n\nBain Capital, Blackstone Inc. and CVC Capital Partners are among the funds considering bids, Bloomberg News has reported. A successful deal, which may be private equity’s largest ever in the country, would signal that the once-criticized class of investors is becoming more accepted in Japan.\n\nPrivate Equity Giants Called Vultures Eye Breakthrough in Japan\n\nMost Read from Bloomberg Businessweek\n\nLVMH Has a Younger Arnault Working on Its Makeover of Tiffany’s Ethereum Mining Is Going Away, and Miners Are Not Happy The NBA Turns to Africa to Fuel Basketball’s Next Era of Growth China’s Property Slump Is a Bigger Threat Than Its Lockdowns Emmanuel Macron Wants to Pay Workers a Dividend\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/toshiba-surges-report-bids-22-002419119.html","symbols":["AIAFX.US","BBN1.F","BX.US","TOSBF.US","TOSYY.US","TSE1.F"],"tags":["BLOOMBERG","BLOOMBERG NEWS","PRIVATE EQUITY","TOSHIBA CORP"],"sentiment":{"polarity":-0.387,"neg":0.068,"neu":0.871,"pos":0.061}},{"date":"2022-06-22T11:46:28+00:00","title":"Exclusive-Bidders weigh offers valuing Toshiba at up to $22 billion-sources","content":"By Makiko Yamazaki, Kane Wu and Scott Murdoch\n\nTOKYO\/HONG KONG (Reuters) -Bidders for Toshiba Corp are considering offering up to 7,000 yen ($51.41) per share to take the troubled Japanese conglomerate private, three people familiar with the situation told Reuters, valuing the deal at about $22 billion.\n\nToshiba, which is exploring strategic options, said this month it had received eight initial buyout proposals and two proposals for capital alliances that would see it remain listed.\n\nThe bidders are now discussing an offer price range of up to 7,000 yen a share with Toshiba's shareholders, the people said, representing up to a 27% premium to Toshiba's share price as of Wednesday's close.\n\nA separate source said the range of offers was wide and various conditions have been attached.\n\nThe offer price, if finalised, would value the chips to nuclear reactors conglomerate at 3 trillion yen ($22 billion) at top end of the range.\n\nToshiba told Reuters it would not disclose details of the proposals.\n\nKKR & Co Inc, Baring Private Equity Asia, Blackstone Inc, Bain Capital, Brookfield Asset Management, MBK Partners, Apollo Global Management and CVC Capital Partners have submitted initial bids, according to the people.\n\nSome of them may form consortia for a bid, they added.\n\nBain, Blackstone, Brookfield, Baring, CVC, KKR and MBK declined to comment. Apollo did not immediately respond to a request for comment.\n\nDomestic funds, including Japan Investment Corp (JIC), and a number of strategic players are looking to see how they can participate in the deal, the people said, declining to be named as they were not authorised to speak to the media.\n\nJIC declined to comment.\n\nWEAK YEN\n\nIf successful, the Toshiba deal would be largest buyout transaction in Japan since a consortium led by Bain took private the conglomerate's memory chip unit, Kioxia, for $18 billion in 2018.\n\nThe discussions are taking place at a time when a weak yen continues to haunt the Japanese economy, threatening to disrupt Japanese firms' business plans and turn them into attractive acquisition targets for foreign buyers.\n\nStory continues\n\nThe yen plunged to a new 24-year low of 136.71 per dollar early on Wednesday.\n\nOf all the potential bidders, Bain has been \"very aggressive\" in pushing for a buyout, said two of the people.\n\nA Japanese investment banker with knowledge of the deal separately said even at 6,500 yen per share the valuation for Toshiba seemed \"too stretched\".\n\nUltimately, he said, the price would have to take into account how investors value Toshiba's 40% stake in unlisted chipmaker Kioxia.\n\nThat gave Bain an advantage over other bidders, he said, because the private equity firm owned the bulk of Kioxia, meaning it would decide the fate of the chipmaker, which in turn would impact the valuation of Toshiba.\n\nBedevilled by accounting and governance crises since 2015, Toshiba set up a special committee in April to solicit proposals after shareholders voted down a management-backed restructuring plan.\n\nThe company said earlier it would shortlist bidders for due diligence after its annual shareholders' meeting on June 28.\n\n($1 = 136.1500 yen)\n\n(Reporting by Makiko Yamazaki in Tokyo, Kane Wu and Scott Murdoch in Hong Kong; Editing by Sumeet Chatterjee, Jason Neely and Tomasz Janowski)","link":"https:\/\/finance.yahoo.com\/news\/exclusive-bidders-weigh-7-000-114628415.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["APOLLO GLOBAL MANAGEMENT","BAIN CAPITAL","BROOKFIELD ASSET MANAGEMENT","CVC CAPITAL PARTNERS","JAPANESE CONGLOMERATE","TOSHIBA CORP"],"sentiment":{"polarity":0.856,"neg":0.036,"neu":0.904,"pos":0.06}},{"date":"2022-06-21T20:00:00+00:00","title":"Private Equity Giants Called Vultures Eye Breakthrough in Japan","content":"(Bloomberg) -- For years, private equity giants have worked to change a damaging public perception in Japan: that they’re “vultures,” hacking companies apart and gorging on their remains.\n\nMost Read from Bloomberg\n\nSwitzerland Imports Russian Gold for First Time Since War Liz Cheney Is Paying the Price in Her Home State for Crossing Trump Stocks Surge After $2 Trillion Wipeout; Bonds Fall: Markets Wrap Elon Musk Sounds Off on Recession Risk, Twitter Deal and Trump Mortgage Lenders Timed the Market Perfectly\n\nNow, Toshiba Corp. is giving the buyout industry an $18 billion opportunity to see whether those efforts have paid off.\n\nThe troubled Japanese conglomerate is soliciting acquisition offers -- and other proposals -- as it seeks to end years of mismanagement. Bain Capital, Blackstone Inc. and CVC Capital Partners are among the funds considering bids, Bloomberg News has reported. A successful deal, which may be private equity’s largest ever in the country, would signal the once-criticized investors have become more accepted in Japan.\n\nBut that remains far from certain. Toshiba directors have been disagreeing publicly over the company’s future, and the Japanese government, which deems the firm’s nuclear power business critical to national security, would have to sign off. What’s less in doubt is private equity has made progress in improving its reputation in Japan.\n\n“Things are starting to change,” said Kazuhiro Yamada, head of the Japan buyout advisory team at Carlyle Group Inc., the US investment house that manages $325 billion in assets. “Before, it was hard for private equity firms to even make an appointment,” he said. “Now, companies are increasingly approaching private equity.”\n\nThe number of deals involving private equity funds hit an all-time high of 134 in Japan last year, according to the consulting firm Bain & Co. The value of transactions more than doubled from the previous year to about 2.7 trillion yen ($20 billion), close to the record from 2017. Shiseido Co. and Hitachi Ltd., both founded more than a century ago, sold parts of their business to private equity last year.\n\nStory continues\n\nEven the government says private equity has changed in Japan. In the first half of the 2000s, many private equity firms “sought to increase the value of companies over the short term through debt workouts,” a representative of the Ministry of Economy, Trade and Industry’s Industrial Finance Division said in emailed comments. These days, they try to raise the value of companies over the medium to long term, mainly through overseas expansion, business diversification or acquiring other companies in the same industry, the official said.\n\nThat’s a far cry from the early years of the century, when one buyout, in particular, shaped the image of private equity firms in Japan. In 2000, a consortium led by Ripplewood Holdings bought the collapsed Long-Term Credit Bank of Japan (now Shinsei Bank Ltd.) from the government for a price that was considered low. Ripplewood made a big profit when Shinsei listed in 2004. The deal angered the Japanese public, especially as the state cleaned up the bank’s bad debts.\n\nForeign investment funds became labeled as “hagetaka,” or vultures. A wave of overseas activist funds didn’t help perceptions in the years before the global financial crisis as they pushed Japan Inc. for higher dividends and buybacks. In 2007, the public broadcaster NHK aired a popular TV drama series called “Hagetaka” about a western investment firm taking over ailing Japanese companies and forcing them to swallow painful restructuring.\n\n“Even my parents asked me if I’d become a vulture,” Carlyle’s Yamada recalled.\n\nWhen Carlyle bought one Japanese manufacturer, its staff looked at him, wondering “Who is this guy? Is he a foreigner?” he said.\n\nAround that time, Japanese companies would only talk to PE firms after they’d been spurned by peers in their industry, said Tetsuro Onitsuka, head of Japan private equity for Stockholm-based buyout firm EQT AB.\n\nBut in the years after the financial crisis, the situation started to change.\n\nAfter Prime Minister Shinzo Abe came to power at the end of 2012, he started to push companies to overhaul themselves, helping to sow the seeds for an increase in mergers and acquisitions.\n\n“People began to understand that there are many different kinds of investment funds and not all of them are hagetaka,” Onitsuka said.\n\nA key deal that helped change perceptions was KKR & Co.’s $1.7 billion purchase of Panasonic Corp.’s health-care unit, which was announced in 2013.\n\n“Panasonic is a very iconic company,” said Kunihiro Takahashi, head of corporate finance at Barclays Plc in Japan. “The fact that an American PE was able to buy a business from such a well-known company in Japan was very surprising.”\n\nIn 2017 came an even bigger milestone, when a consortium led by Bain Capital agreed to buy Toshiba’s crown-jewel memory-chip business for $18 billion. It was -- and remains -- private equity’s largest deal in Japan.\n\nThe buyout sent a “positive signal” that industries or assets deemed nationally important weren’t “off limits” to foreign investors, said Jim Verbeeten, a partner at Bain & Co. in Tokyo.\n\nTo be sure, not everyone is positive about private equity. The investors have been criticized for their tactic of leveraged buyouts, saddling companies with large debts, which can give them less room to maneuver when things go wrong. The LBO was immortalized in the book “Barbarians at the Gate” more than three decades ago about the takeover of tobacco and food conglomerate RJR Nabisco in the US.\n\nStill, “private equity investors provide the strategic capital which is needed for aging Japanese companies in an aging society,” said Nga Pham, a research fellow at Monash Centre for Financial Studies in Melbourne. As well as injecting funds, private equity firms offer the expertise needed to help transform companies, she said.\n\nDespite its recent successes in Japan, a buyout of Toshiba would be the true litmus test of whether private equity has arrived. The company, which has a market value of about $17.8 billion, has received eight privatization offers and two alliance proposals as part of its process to solicit strategic options. A sharply weakening yen is helping make Japanese companies more attractive for foreign investors. But nothing is decided, Chief Executive Officer Taro Shimada told Bloomberg in an interview this month, saying staying public is still a possibility.\n\nThat’s partly because Japan’s government could nix any deal. Toshiba’s nuclear business is involved in decommissioning the wrecked Fukushima Dai-Ichi nuclear power plant, a critical operation for the country.\n\nThe METI division said in its emailed comments that the key for private equity funds isn’t whether they’re Japanese or foreign, but whether they’re contributing to revitalizing the country’s economy. But Koichi Hagiuda, the trade minister, was more cautious about overseas ownership of Toshiba.\n\n“If foreign investors seek a stake above certain levels, we will strictly review whether that could undermine our country’s security,” he told reporters at a press conference earlier this month.\n\nMonash’s Pham said she doubts an international private equity firm will succeed in buying Toshiba without partnering with a domestic PE fund. State-backed investment fund Japan Investment Corp. is considering making a bid, Bloomberg reported in May.\n\nThe next step for Toshiba is to appoint a new board. One of the company’s directors publicly disagreed with its inclusion of representatives from activist investors among the nominees. Shareholders will vote on the new director slate at the annual meeting scheduled for June 28.\n\nOnce the board is in place, the company will narrow down the list of investment proposals. In July or later, it give those selected the opportunity to do due diligence and ask them to submit binding bids.\n\n“If a PE succeeds in buying all of Toshiba, it will arguably be one of the most significant transactions in the country,” with other similar large deals likely to follow, Takahashi of Barclays said. “A global PE taking over such an iconic company will be very significant.”\n\nMost Read from Bloomberg Businessweek\n\nEthereum Mining Is Going Away, and Miners Are Not Happy Emmanuel Macron Wants to Pay Workers a Dividend Adults Who Love Toys? The Toy Industry Loves Them, Too Hell Is a Cruise Ship at the Beginning of the Pandemic\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/private-equity-giants-called-vultures-200000997.html","symbols":["3VU.F","8301.TSE","AIAFX.US","BARC.LSE","BBN1.F","BCLYF.US","BCS.US","BCSN.MX","BCY.F","BCY.STU","BCY.XETRA","BCY2.F","BX.US","CG.US","EQBBF.US","EQT.ST"],"tags":["BAIN CAPITAL","BLOOMBERG","BLOOMBERG NEWS","JAPAN","JAPANESE COMPANIES","PRIVATE EQUITY","PRIVATE EQUITY FIRMS","PRIVATE EQUITY FUNDS"],"sentiment":{"polarity":0.912,"neg":0.049,"neu":0.892,"pos":0.059}},{"date":"2022-06-14T07:23:22+00:00","title":"Proxy advisers ISS, Glass Lewis back all Toshiba director nominees","content":"By Makiko Yamazaki\n\nTOKYO (Reuters) -Two influential proxy advisers have both recommended voting for the appointment of all Toshiba Corp director nominees including two from activist shareholders, despite objection to the move from within the board.\n\nProxy advisers Institutional Shareholder Services Inc (ISS) and Glass Lewis backed all 13 candidates including those from Elliott Management and Farallon Capital Management, according to their reports issued by Tuesday.\n\nThe recommendations come despite objection by external director Mariko Watahiki, who has said having the two shareholder representatives would skew the board toward activist investors.\n\nShareholders will vote at Toshiba's annual meeting scheduled for June 28 and many non-Japanese institutional investors generally follow the proxy advisers' recommendations.\n\nISS said in its report that the concerns raised by Watahiki \"are not considered to rise to a level that would justify voting against\" the executives from Farallon and Elliott. The two funds own about 10% of Toshiba.\n\nIt also said the board is majority independent and the affiliated outsiders' presence on the board \"cannot be regarded as detrimental\".\n\nGlass Lewis said it viewed the shareholder nominees very favourably. They are \"expected to reflect a negotiated turning point for Toshiba\" as the company embraces external, shareholder-centric perspectives at a time when it is evaluating strategic alternatives, it said.\n\nIt also said that a lack of board-level unanimity \"is not, on its own, inherently problematic\" and would suggest there was a healthy exchange of views.\n\n(Reporting by Makiko Yamazaki, Editing by Louise Heavens and Muralikumar Anantharaman)","link":"https:\/\/finance.yahoo.com\/news\/proxy-advisers-iss-glass-lewis-072322048.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ADVISERS","ELLIOTT MANAGEMENT","FARALLON CAPITAL MANAGEMENT","GLASS LEWIS","INSTITUTIONAL SHAREHOLDER SERVICES INC","ISS","MARIKO WATAHIKI","TOSHIBA CORP"],"sentiment":{"polarity":0.612,"neg":0.021,"neu":0.935,"pos":0.044}},{"date":"2022-06-14T06:26:11+00:00","title":"Proxy Advisers Back Toshiba Board Slate, Including Activists","content":"(Bloomberg) -- Two influential proxy advisers recommended that stock owners vote to elect all director candidates proposed by Toshiba Corp.’s board at the upcoming annual meeting, including two representatives of the company’s activist investors.\n\nMost Read from Bloomberg\n\nChina Alarms US With Private Warnings to Avoid Taiwan Strait Stocks’ Pandemic Bull Run Ends With Recession Fear: Markets Wrap Crypto Market Sinks Below $1 Trillion After Latest DeFi Blowup Bond Yields, Dollar Surge With Fed Bets as Recession Risk Grows Five Things Google’s AI Bot Wrote That Convinced Engineer It Was Sentient\n\nInvestors should vote in favor of the election of Eijiro Imai and Nabeel Bhanji, who hail from activist shareholders Farallon Capital Management and Elliott Management Corp., Institutional Shareholder Services Inc. and Glass Lewis & Co. said in separate reports. Neither person’s presence on the board can be considered detrimental, ISS said.\n\nThe recommendations come after Toshiba external board member Mariko Watahiki spoke out publicly against appointing representatives of activist investors as directors, saying that if they were appointed, activists would take up too much of the board.\n\nThe reports increase the chances that the director candidates from activist shareholders will be appointed. That, in turn, may also raise the likelihood of a sale and privatization of the Japanese industrial giant. Toshiba has received eight buyout offers and two proposals for capital and business alliances as it carries out a process to seek strategic options for its future.\n\nToshiba’s annual general shareholder meeting is scheduled for June 28.\n\n(Updates throughout with Glass Lewis report)\n\nMost Read from Bloomberg Businessweek\n\nA Billion-Dollar Crypto Gaming Startup Promised Riches and Delivered Disaster A Parisian General Store’s Radical Message for Its Customers? Buy Less Wall Street Executives Can’t Stop Talking About a Recession The IRS Is Coming for Your Venmo Income Soaring Oil Prices Force Biden to Engage With Saudis He’d Spurned\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/proxy-advisers-back-toshiba-board-062611945.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST INVESTORS","BLOOMBERG","DIRECTOR CANDIDATES","ELLIOTT MANAGEMENT CORP","FARALLON CAPITAL MANAGEMENT","INSTITUTIONAL SHAREHOLDER SERVICES INC","NABEEL BHANJI","TOSHIBA"],"sentiment":{"polarity":-0.572,"neg":0.079,"neu":0.85,"pos":0.071}},{"date":"2022-06-09T20:55:58+00:00","title":"Toshiba Fails Governance Litmus Test Again with Opposition to Own Director Slate","content":"Toshiba director Mariko Watahiki staging public campaign against Farallon, Elliott Company formally recommended Farallon and Elliott reps on own director slate Watahiki used Toshiba staff to organize press conference to voice views Toshiba has indicative bids from major private equity firms KKR, Blackstone, others Watahiki is a career judge who owns no stock while Farallon, Elliot own $2 billion Leading activism lawyer says firms in Toshiba’s position should use best efforts to support their nominees Lawyer also says minority dissenters should voice concerns on their “own dime”\n\nBy Jarrett Banks and John Jannarone\n\nJust when it seemed Toshiba Corp. (6502.T) was on its way out of corporate governance hell and finally listening to shareholders, an outside director is pulling the company back in.\n\nMariko Watahiki, 67, a former Nagoya High Court chief, is opposing the election of two directors representing activist investors in an upcoming shareholder vote, launching a public campaign with company assistance to discredit them for lacking fairness and balance—and saying they would only pursue short-term profit.\n\nMs. Watahiki, who became an external board member last year and owns no Toshiba stock according to the company’s website, has spoken out against Eijiro Imai, a managing director at Farallon Capital Management, and Nabeel Bhanji of Elliott Management Corp. both in press interviews and a Toshiba-organized press conference. The ploy is bizarre because it comes after Toshiba itself announced a slate of 13 proposed directors last month including Messrs. Imai and Bhanji ahead of its shareholder meeting scheduled for June 28. The two activist funds collectively hold about $2 billion of Toshiba stock.\n\nUntil Ms. Watahiki’s attempt to subvert Toshiba’s own agreement with Farallon and Elliott emerged, it appeared the company was finally on a path to creating real shareholder value after years of scandal and flagrantly-poor share price performance. Toshiba has said it received eight offers to buy out the conglomerate, as well as two proposals for capital and business alliances. The company said in a filing it will evaluate the non-binding bids and choose one or more to pursue after the shareholder meeting.\n\nStory continues\n\nThe company hasn’t disclosed names, but the suitors are as serious as they come. Mainstream media reports indicate private equity investors including CVC Capital Partners, Blackstone Inc., KKR and Bain Capital were considering making bids, as well as state-backed investment fund Japan Investment Corp. Private equity fund MBK Partners also submitted a bid and may form a consortium for Toshiba.\n\nIt’s understandable why senior management at Toshiba might be backing Ms. Watahiki behind the scenes. In Japanese conglomerates, employment is usually for life and many executives still cling to the security and prestige of a big corporate name. Cross-shareholdings with insurers and other large corporations also add to their clout.\n\nBut Ms. Watahiki’s argument that activist investors don’t know enough about Toshiba’s business is curious coming from someone who was a judge for 40 years with little corporate management experience. Of note, she’s also on the governance committee at LIXIL Group Corp., which manufactures housing equipment. This only makes her use of corporate money to oppose the directors more concerning.\n\nNeither Toshiba, Farallon nor Elliott responded to requests for comment from CorpGov. Despite organizing a press conference with Ms. Watahiki, the company said this week that Ms. Watahiki’s opinions are her personal views and don’t represent the company’s position. Ms. Watahiki, who couldn’t be reached for comment, recently told Bloomberg, “If we take people from just one specific group, it’s impossible to avoid conflicts of interest.”\n\nCorpGov has extensively reported on Toshiba’s previous struggles with governance and securities lawyers say several elements about the current situation raise fresh concerns. First, the company inserted a footnote in the so-called convocation notice announcing the annual meeting to indicate that Ms. Watahiki opposed the nomination of Messrs. Imai and Bhanji even though the company had reached a deal to place them on the board including standard nomination agreements.\n\n“It is very unusual to see objections of a vocal minority of a board to the candidates recommended by the majority of the directors, particularly after a company has entered into a nomination agreement supporting the election of these candidates,” said Lawrence Elbaum, Partner at Vinson & Elkins LLP in New York and co-head of his firm’s Shareholder Activism practice.\n\nMs. Mariko Watahiki\n\nHe said that the nomination agreements for Farallon and Elliot looked to be well within the market for shareholders who strike friendly deals for board seats. “I have read hundreds of nomination agreements, and the Toshiba agreements include many of the typical terms a company and nominating shareholders would expect to see surrounding the board’s efforts to elect shareholder-approved directors and the concessions from activist shareholders in return.”\n\nIt is also concerning that Ms. Watahiki’s press conference was hosted by Toshiba itself. “Usually, when less than a majority of a board disagrees with the directors endorsed by the majority, should the minority wish to voice their dissent, they will do it on their own dime through their own PR channels,” Mr. Elbaum said. “If a company reaches a deal to support certain directors, and is required to use best efforts to get them elected, then any activist may claim with force that best efforts are not met where company permits a dissenting director to air dirty laundry about directors subject to a nomination agreement.  The activist may argue the company needs to go much further to provide that best efforts are being used to get the new director nominees elected.”\n\nToshiba’s leaders have long fought against the idea of privatization, with former Chief Executive Officer Satoshi Tsunakawa laying out five reasons why it would be the wrong decision earlier this year. Taro Shimada, the new chief executive, recently told The Wall Street Journal that he wanted any buyer to keep the company in one piece to promote innovation. Mr. Shimada pointed out that Toshiba’s business model has worked in the past, yielding such fruits as the first laptop computer in the 1980s.\n\nLike early laptops, business models that thrived in the 80s have evolved with the times. If Ms. Watahiki and the old guard she represents continue to resist change, stakeholders in Toshiba and Japan Inc. will risk being left behind.\n\nContact:\n\nCorpGov\n\nwww.CorpGov.com\n\nJarrett Banks\n\nEditor-at-Large\n\njb@capmarketsmedia.com","link":"https:\/\/finance.yahoo.com\/news\/toshiba-fails-governance-litmus-test-205558289.html","symbols":["BBN1.F","BX.US","KKR-PC.US","KKR.US","KR51.F","TOSBF.US","TOSYY.US","TSE1.F"],"tags":["BEST EFFORTS","FARALLON CAPITAL MANAGEMENT","MARIKO WATAHIKI","PRESS CONFERENCE","PRIVATE EQUITY FIRMS","TOSHIBA"],"sentiment":{"polarity":0.995,"neg":0.041,"neu":0.864,"pos":0.095}},{"date":"2022-06-07T12:01:30+00:00","title":"Toshiba director defends board nominees from hedge fund shareholders","content":"By Makiko Yamazaki and Yuki Nitta\n\nTOKYO (Reuters) - A Toshiba Corp external director on Tuesday rejected criticism that having two shareholder representatives would skew the board, as boardroom tensions at the troubled conglomerate erupted into a public row over a slate of director candidates.\n\n\"I disagree that the board is skewed,\" Jerry Black, an external director on Toshiba's five-member nomination committee, told Reuters in an interview on Tuesday.\n\nBlack's comment was in reference to objection by another nomination committee member, Mariko Watahiki, to two board director candidates from hedge fund shareholders Elliott Management and Farallon Capital Management.\n\nWatahiki, a former high court judge, has said the slate lacks diversity, fairness and balance on the board.\n\n\"When it comes to the two directors, I think that they are going to be great contributors to the board,\" Black said.\n\n\"They were evaluated based upon the individual capabilities. Both of those firms have spent thousands and thousands of hours on researching Toshiba.\"\n\nIn the same interview, CEO Taro Shimada declined to comment on the nominees saying he is \"not in a position to judge the nomination committee's decisions\".\n\nBut he said that the execution of a great business plan \"can only solve the problem\".\n\nSeparately on Tuesday, Toshiba issued a statement reiterating its support for the slate of all 13 board director candidates.\n\n\"Watahiki's opinions represent her personal view and do not affect the company's position of support\" for the two candidates, Toshiba board chair Satoshi Tsunakawa said in a statement.\n\n(Reporting by Makiko Yamazaki and Yuki Nitta)","link":"https:\/\/finance.yahoo.com\/news\/toshiba-director-defends-board-nominees-120130402.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["DIRECTOR CANDIDATES","JERRY BLACK","MARIKO WATAHIKI","NOMINATION COMMITTEE","THE BOARD","TOSHIBA CORP"],"sentiment":{"polarity":0.226,"neg":0.055,"neu":0.888,"pos":0.058}},{"date":"2022-06-07T12:00:00+00:00","title":"Toshiba’s CEO Says Staying Public Is Still an Option as PE Firms Circle","content":"(Bloomberg) -- Toshiba Corp.’s chief executive officer said nothing is decided on going private and staying public remains a possibility, after the Japanese industrial giant received eight buyout offers as part of a process to decide its future.\n\nMost Read from Bloomberg\n\nAmazon’s Stock Split Delivers More Than Bargained For Apple Products Set to Use Common Charging Point After EU Deal Top Economist Urges China to Seize TSMC If US Ramps Up Sanctions Target Tries to Save Itself by Putting Everything on Sale Inflation Is Poised to Ease According to These Three Key Indicators\n\n“If there’s greater value in not taking the company private, that’s still an option,” Taro Shimada said in an interview with Bloomberg News in Tokyo. “What’s important is that value is maximized for all of the company’s stakeholders.”\n\nIt’s a reminder that the next step is far from certain for the famous Japanese firm, where shareholders and management have been at loggerheads for years over strategy and corporate governance. It comes after an outside director spoke out against about Toshiba’s plan to put representatives of activist investors on its board, an unusually public display of dissent that highlights the tensions that exist within the conglomerate.\n\nToshiba said last week it got eight buyout offers and two proposals for capital and business alliances as part of its process to solicit strategic options. While it didn’t disclose the bidders, Bain Capital, Blackstone Inc. and CVC Capital Partners are among the private equity firms that were weighing bids, Bloomberg has reported.\n\nToshiba’s leaders had long fought against the idea of privatization, with former CEO Satoshi Tsunakawa laying out five reasons why it would be the wrong decision just this February. His management team instead argued the company should be split in two, but investors voted down that approach.\n\nToshiba will closely review the buyout offers and alliance proposals and narrow the list down to a “realistic” number, Shimada said.\n\nStory continues\n\nThe company has to consider a wide pool of stakeholders including customers, shareholders, employees and the government, Jerry Black, an outside director who chairs Toshiba’s special committee for the review process, said in the interview.\n\nAnalysts have warned that getting government approval for any buyout wouldn’t be easy. Toshiba’s nuclear power business, which is deemed important to Japan’s national security, could be a major obstacle.\n\nRead more: Private Equity Firms Eyeing Toshiba Buyout Face Nuclear Dilemma\n\nBlack said Toshiba would look at the ability to win government approval as one of the criteria for selecting bids.\n\nWe’ve asked each of the bidders “for their ideas and solutions,” he said. “It will be the sponsors’ responsibility to get approval,” he said. “And from that perspective, we want to understand the probability.”\n\nToshiba has lurched from one disaster to another over the past seven years, starting with an accounting scandal in 2015 that devastated profits and led to a company-wide restructuring. The subsequent unraveling of a costly foray into nuclear power business in the U.S. led to a $6.3 billion writedown and saw it teeter on the edge of delisting. It was forced to sell its crown jewel memory-chip unit and offer stock that was snapped up by activist investors, giving them an outsized presence on the shareholder register.\n\nSince then, stock owners and management have clashed over the company’s future.\n\n“We’ve lost a significant amount of shareholder trust,” Black said. “We have to execute,” he said. “And we have to communicate better.”\n\nMost Read from Bloomberg Businessweek\n\nUkraine’s Tactics Are Showing Smaller Countries How to Fight Back Sheryl Sandberg’s Legacy Is an Internet of Targeted, Automated Ads We’re All Bargain Hunters Now That the Market’s Growth Spurt Is Over Oz Won by Ditching the Oprahverse for Trump and Planet Hannity An Industrial Stalwart Goes All-In on Specialty Software\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/toshiba-ceo-says-staying-public-120000447.html","symbols":["BBN1.F","BX.US","TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST INVESTORS","BLOOMBERG","BLOOMBERG NEWS","GOVERNMENT APPROVAL","JERRY BLACK","OUTSIDE DIRECTOR","PRIVATE EQUITY FIRMS","TARO SHIMADA","TOSHIBA"],"sentiment":{"polarity":0.971,"neg":0.061,"neu":0.838,"pos":0.101}},{"date":"2022-06-07T12:00:00+00:00","title":"Toshiba’s CEO Says Staying Public Is Still an Option as PE Firms Circle","content":"(Bloomberg) -- Toshiba Corp.’s chief executive officer said nothing is decided on going private and staying public remains a possibility, after the Japanese industrial giant received eight buyout offers as part of a process to decide its future.\n\nMost Read from Bloomberg\n\nAmazon’s Stock Split Delivers More Than Bargained For Apple Products Set to Use Common Charging Point After EU Deal Top Economist Urges China to Seize TSMC If US Ramps Up Sanctions Inflation Is Poised to Ease According to These Three Key Indicators Apple Unveils Biggest MacBook Air Redesign in Over a Decade\n\n“If there’s greater value in not taking the company private, that’s still an option,” Taro Shimada said in an interview with Bloomberg News in Tokyo. “What’s important is that value is maximized for all of the company’s stakeholders.”\n\nIt’s a reminder that the next step is far from certain for the famous Japanese firm, where shareholders and management have been at loggerheads for years over strategy and corporate governance. It comes after an outside director spoke out against about Toshiba’s plan to put representatives of activist investors on its board, an unusually public display of dissent that highlights the tensions that exist within the conglomerate.\n\nToshiba said last week it got eight buyout offers and two proposals for capital and business alliances as part of its process to solicit strategic options. While it didn’t disclose the bidders, Bain Capital, Blackstone Inc. and CVC Capital Partners are among the private equity firms that were weighing bids, Bloomberg has reported.\n\nToshiba’s leaders had long fought against the idea of privatization, with former CEO Satoshi Tsunakawa laying out five reasons why it would be the wrong decision just this February. His management team instead argued the company should be split in two, but investors voted down that approach.\n\nToshiba will closely review the buyout offers and alliance proposals and narrow the list down to a “realistic” number, Shimada said.\n\nStory continues\n\nThe company has to consider a wide pool of stakeholders including customers, shareholders, employees and the government, Jerry Black, an outside director who chairs Toshiba’s special committee for the review process, said in the interview.\n\nAnalysts have warned that getting government approval for any buyout wouldn’t be easy. Toshiba’s nuclear power business, which is deemed important to Japan’s national security, could be a major obstacle.\n\nRead more: Private Equity Firms Eyeing Toshiba Buyout Face Nuclear Dilemma\n\nBlack said Toshiba would look at the ability to win government approval as one of the criteria for selecting bids.\n\nWe’ve asked each of the bidders “for their ideas and solutions,” he said. “It will be the sponsors’ responsibility to get approval,” he said. “And from that perspective, we want to understand the probability.”\n\nToshiba has lurched from one disaster to another over the past seven years, starting with an accounting scandal in 2015 that devastated profits and led to a company-wide restructuring. The subsequent unraveling of a costly foray into nuclear power business in the U.S. led to a $6.3 billion writedown and saw it teeter on the edge of delisting. It was forced to sell its crown jewel memory-chip unit and offer stock that was snapped up by activist investors, giving them an outsized presence on the shareholder register.\n\nSince then, stock owners and management have clashed over the company’s future.\n\n“We’ve lost a significant amount of shareholder trust,” Black said. “We have to execute,” he said. “And we have to communicate better.”\n\nMost Read from Bloomberg Businessweek\n\nUkraine’s Tactics Are Showing Smaller Countries How to Fight Back Sheryl Sandberg’s Legacy Is an Internet of Targeted, Automated Ads Oz Won by Ditching the Oprahverse for Trump and Planet Hannity We’re All Bargain Hunters Now That the Market’s Growth Spurt Is Over An Industrial Stalwart Goes All-In on Specialty Software\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/toshiba-ceo-says-staying-public-120000594.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST INVESTORS","BLOOMBERG","BLOOMBERG NEWS","GOVERNMENT APPROVAL","JERRY BLACK","OUTSIDE DIRECTOR","PRIVATE EQUITY FIRMS","TARO SHIMADA","TOSHIBA"],"sentiment":{"polarity":0.967,"neg":0.061,"neu":0.841,"pos":0.098}},{"date":"2022-06-06T13:41:39+00:00","title":"Amazon’s Stock Split Delivers More Than Bargained For","content":"(Bloomberg) -- Stock splits were all the rage early this year as indexes hovered near record highs, with companies from Amazon.com Inc. to Alphabet Inc. announcing them to make their share prices more alluring to individual investors. A few months on, the market has taken care of the problem.\n\nMost Read from Bloomberg\n\nAmazon’s Stock Split Delivers More Than Bargained For Elon Musk Says Twitter’s Lack of Info on Bots Breaches Merger Deal Stocks Rise as Higher Yields Keep Check on Rally: Markets Wrap Why Peak Inflation Is Near, According to Experts Who Bet on Short-Lived Price Rises Fed Delivers Fuzzier Rate Message as It Gauges Impact of Hikes\n\nAmazon, whose 20-for-1 split took effect Monday, is among companies whose stocks have tumbled since the moves were announced amid a broad market selloff that’s been especially painful for the technology sector. Shares of the e-commerce giant rose 2% in New York after the split, but shares are still down about 10% since reporting the plan in March. Alphabet, which announced a similar proposal in February, is down 17% since then.\n\nThe selloff means the stocks will be trading at a discount to the sticker price originally envisioned by executives. That will make it easier for the behemoths to gain entry to the Dow Jones Industrial Average, whose weighting is based on share price, but it could have the effect of making them look less princely than their massive market values and history of big gains would imply.\n\n“Stock splits are usually a sign of optimism,” said Mark Lehmann, chief executive officer of JMP Group. “Very few companies split their stock in anticipation of things going poorly. It’s an example of what’s reflected in the entire market.”\n\nSplits, of course, have no fundamental effect on share value -- they’re the stock market equivalent of exchanging a $20 bill for two $10s. But in the buoyant market of early 2022, they were met with bidding wars by giddy traders.\n\nFor companies like Shopify Inc. that have fared even worse than Amazon and Alphabet amid an exodus from stocks with the highest valuations, the splits could make them look downright pedestrian. If the 10-for-1 exchange plann by the Canadian e-commerce company was done today, it would result in a US share price of about $35 following a 79% crash from a November high when the stock closed at a record $1,690.60. The median stock price in the S&P 500 Index, by contrast, is around $113, according to data compiled by Bloomberg. Shopify’s split is set to take effect on June 29.\n\nStory continues\n\nOf course, the sour market sentiment could cause companies like Tesla Inc. to rethink their plans. The electric-car maker said in late March it would ask investors this year to approve the creation of additional shares for the purposes of another split. The stock was trading above $1,000 at the time. Since then, the shares have lost nearly a third of their value, closing Friday at $703.55, amid manufacturing problems in China and concerns about slowing growth.\n\nTech Chart of the Day\n\nDidi Global Inc. shares surged 65% on Monday after the Wall Street Journal reported that Chinese regulators are preparing to wrap up their investigation into the ride-hailing giant. Shares were trading at around $3, still about 81% below its $16.40 peak close in July last year. Through Friday’s close, Didi shares had sunk nearly 90% from their peak, wiping off more than $70 billion in market value, after its blockbuster US listing drew the wrath of Beijing and made it the face of the nation’s tech crackdown.\n\nTop Tech Stories\n\nChinese regulators are preparing to wrap up their investigation into Didi Global Inc. and restore the ride-hailing giant’s main apps to mobile stores as soon as this week, the Wall Street Journal reported. Didi shares soared in US premarket trading\n\nThe news added to a more upbeat tone around Chinese assets Tesla Chief Executive Officer Elon Musk sent staff, investors and electric-car watchers on a three-day rollercoaster with conflicting messages about potential job cuts, underlining the sometimes erratic nature of his leadership and muddying the automaker’s outlook A Toshiba Corp. external board member said the company’s plan to appoint two directors representing activist investors lacks fairness and balance, opposing their election in a shareholder vote this month Carro, one of Southeast Asia’s biggest online marketplaces for used cars, has agreed to buy a 50% stake in Indonesian automotive financing and rental company MPM Rent for S$75 million ($54.5 million) to expand in the world’s fourth most populous country\n\nRead this next: The Tech Rout Isn’t Just Cyclical—It’s Well-Earned, and Overdue\n\n(Updates share move in last paragraph.)\n\nMost Read from Bloomberg Businessweek\n\nUkraine’s Tactics Are Showing Smaller Countries How to Fight Back Oz Won by Ditching the Oprahverse for Trump and Planet Hannity Sheryl Sandberg’s ‘Lean In’ Missed What Most Women Needed An Industrial Stalwart Goes All-In on Specialty Software In Seattle’s Burning Hot Real Estate Market, It’s A.I. or Bust\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/amazon-stock-split-delivers-more-134139106.html","symbols":["307.F","AMZN.US","GOOG.US","GOOGL.US","SHOP.TO","SHOP.US","TOSBF.US","TOSYY.US","TSE1.F","TSLA.US"],"tags":["AMAZON.COM INC","BLOOMBERG","COMPANIES","INDIVIDUAL INVESTORS","SHARE PRICE","STOCK SPLITS"],"sentiment":{"polarity":0.995,"neg":0.048,"neu":0.839,"pos":0.113}},{"date":"2022-06-06T12:31:12+00:00","title":"UPDATE 2-Tension at Toshiba erupts into public row as directors trade barbs","content":"(Adds detail about Watahiki)\n\nBy Makiko Yamazaki\n\nTOKYO, June 6 (Reuters) - Boardroom tensions at Japan's Toshiba Corp erupted into a public row on Monday as two of its external directors traded criticism over governance and the nomination of hedge fund executives to the conglomerate's board.\n\nThe rift is the latest in a long-running crisis that has seen management and shareholders locked in a dispute over the future of the company, once one of Japan Inc's prized assets. It could undermine investor confidence in the board, just ahead of an annual general meeting.\n\nExternal director Mariko Watahiki on Monday took aim at her colleague Raymond Zage saying he raised concerns about governance at Toshiba when he broke with the board's stance in March and came out in favour of a shareholder proposal that the company solicit buyout offers from private equity.\n\nWatahiki's comments were initially made in an annual business report released on Monday, and echoed by another external director, Katsunori Hashimoto.\n\nZage's move \"damaged shareholder confidence in the board and caused concerns about corporate governance\", they were quoted as saying in the report.\n\nZage defended his actions in a statement to Reuters, saying the criticisms were misleading and that his actions had received a positive shareholder response.\n\nSeparate company documents also confirmed that Watahiki, a former high court judge, had objected to two director nominations supported by the board. That came after Reuters on Friday reported she had objected and that the company, in a rare move, would make her objections public.\n\nZage said in the statement to Reuters: \"(It is) inaccurate, incomplete and misleading representing a failure on the part of the authors to consider the substantial positive shareholder feedback as well as the content of substantial discussions at the board on this matter both before and after the public statement.\"\n\nToshiba declined to comment on the matter.\n\nStory continues\n\nZage also chairs the nomination committee, which proposed the two board candidates - from U.S. activist hedge funds Elliott Management and Farallon Capital Management - formally opposed by Watahiki.\n\nZage was previously a managing director at Farallon and remains an adviser.\n\n\"Having two directors linked to Farallon makes the board appear skewed to an activist shareholder, a specific shareholder,\" Watahiki told reporters on Monday.\n\nShe also said she believed that contracts with Elliott, Farallon failed to ensure an avoidance of conflicts of interest while fully securing independence and confidentiality.\n\nCaught up in accounting and governance crises since 2015, Toshiba has had tussles with its activist shareholder base, some of whom want it taken private.\n\nToshiba said last week that it had received eight initial proposals to take it private and two proposals for capital alliances that would leave it publicly listed. (Reporting by Makiko Yamazaki; Editing by Edmund Klamann, David Dolan, Emelia Sithole-Matarise and Jane Merriman)","link":"https:\/\/finance.yahoo.com\/news\/1-tension-toshiba-erupts-public-123112290.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["CORPORATE GOVERNANCE","FARALLON CAPITAL MANAGEMENT","JAPAN INC","MARIKO WATAHIKI","RAYMOND ZAGE","SHAREHOLDERS","TOSHIBA CORP"],"sentiment":{"polarity":-0.326,"neg":0.081,"neu":0.839,"pos":0.08}},{"date":"2022-06-06T08:53:21+00:00","title":"Toshiba directors exchange criticism over public statements","content":"By Makiko Yamazaki\n\nTOKYO (Reuters) - External directors at Toshiba Corp exchanged criticism on Monday over statements on board decisions, signalling a public rift as the embattled conglomerate reviews strategic options including going private.\n\nIn an annual business report released on Monday, Toshiba external directors Mariko Watahiki and Katsunori Hashimoto, both members of Toshiba's three-member audit committee, were quoted as saying that external director Raymond Zage raised concern about Toshiba's governance by breaking ranks with the board's official stance after a March meeting.\n\nZage defended his actions in a statement to Reuters, saying the criticisms were misleading and that his actions had received a positive shareholder response.\n\nCompany documents also confirmed that Watahiki had objected to two nominations supported by the board. Reuters reported on Friday, citing people familiar with the matter, that Watahiki had objected and that the company, in a rare move, would make her objections public.\n\nIn March, Zage came out in public support of a proposal from Singapore-based 3D Investment Partners that the company solicit buyout offers from private equity firms. It had been rejected by the board but was later taken up, and voted down, at an extraordinary shareholders' meeting.\n\n\"(Zage's comments) damaged shareholder confidence in the board and caused concerns about corporate governance,\" Watahiki and Hashimoto were quoted as saying. \"Even if the above act cannot be said to constitute a breach of the duty of care.\"\n\nZage said in the statement to Reuters: \"(It is) inaccurate, incomplete and misleading representing a failure on the part of the authors to consider the substantial positive shareholder feedback as well as the content of substantial discussions at the board on this matter both before and after the public statement.\"\n\nToshiba declined to comment on the matter.\n\nZage also chairs the nomination committee, which proposed the two board candidates - from U.S. activist hedge funds Elliott Management and Farallon Capital Management - formally opposed by Watahiki.\n\nStory continues\n\nCaught up in accounting and governance crises since 2015, Toshiba has had tussles with its activist shareholder base, some of whom want it taken private.\n\nToshiba said last week that it had received eight initial proposals to take it private and two proposals for capital alliances that would leave it publicly listed.\n\n(Reporting by Makiko Yamazaki; Editing by Edmund Klamann)","link":"https:\/\/finance.yahoo.com\/news\/toshiba-directors-exchange-criticism-over-085321552.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST SHAREHOLDER","BOARD DECISIONS","FARALLON CAPITAL MANAGEMENT","KATSUNORI HASHIMOTO","MARIKO WATAHIKI","RAYMOND ZAGE","TOSHIBA CORP"],"sentiment":{"polarity":0.511,"neg":0.052,"neu":0.883,"pos":0.065}},{"date":"2022-06-06T08:48:36+00:00","title":"Toshiba directors exchange criticism over public statements","content":"By Makiko Yamazaki\n\nTOKYO, June 6 (Reuters) - External directors at Toshiba Corp exchanged criticism on Monday over statements on board decisions, signalling a public rift as the embattled conglomerate reviews strategic options including going private.\n\nIn an annual business report released on Monday, Toshiba external directors Mariko Watahiki and Katsunori Hashimoto, both members of Toshiba's three-member audit committee, were quoted as saying that external director Raymond Zage raised concern about Toshiba's governance by breaking ranks with the board's official stance after a March meeting.\n\nZage defended his actions in a statement to Reuters, saying the criticisms were misleading and that his actions had received a positive shareholder response.\n\nCompany documents also confirmed that Watahiki had objected to two nominations supported by the board. Reuters reported on Friday, citing people familiar with the matter, that Watahiki had objected and that the company, in a rare move, would make her objections public.\n\nIn March, Zage came out in public support of a proposal from Singapore-based 3D Investment Partners that the company solicit buyout offers from private equity firms. It had been rejected by the board but was later taken up, and voted down, at an extraordinary shareholders' meeting.\n\n\"(Zage's comments) damaged shareholder confidence in the board and caused concerns about corporate governance,\" Watahiki and Hashimoto were quoted as saying. \"Even if the above act cannot be said to constitute a breach of the duty of care.\"\n\nZage said in the statement to Reuters: \"(It is) inaccurate, incomplete and misleading representing a failure on the part of the authors to consider the substantial positive shareholder feedback as well as the content of substantial discussions at the board on this matter both before and after the public statement.\"\n\nToshiba declined to comment on the matter.\n\nStory continues\n\nZage also chairs the nomination committee, which proposed the two board candidates - from U.S. activist hedge funds Elliott Management and Farallon Capital Management - formally opposed by Watahiki.\n\nCaught up in accounting and governance crises since 2015, Toshiba has had tussles with its activist shareholder base, some of whom want it taken private.\n\nToshiba said last week that it had received eight initial proposals to take it private and two proposals for capital alliances that would leave it publicly listed. (Reporting by Makiko Yamazaki; Editing by Edmund Klamann)","link":"https:\/\/finance.yahoo.com\/news\/toshiba-directors-exchange-criticism-over-084836123.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST SHAREHOLDER","BOARD DECISIONS","FARALLON CAPITAL MANAGEMENT","KATSUNORI HASHIMOTO","MARIKO WATAHIKI","RAYMOND ZAGE","TOSHIBA CORP"],"sentiment":{"polarity":0.511,"neg":0.052,"neu":0.884,"pos":0.065}},{"date":"2022-06-06T07:00:00+00:00","title":"Toshiba’s Dissenting Director Speaks Out on Activists on Board","content":"(Bloomberg) -- A Toshiba Corp. external board member said the company’s plan to appoint two directors representing activist investors lacks fairness and balance, opposing their election in a shareholder vote this month.\n\nMost Read from Bloomberg\n\nWhy Peak Inflation Is Near, According to Experts Who Bet on Short-Lived Price Rises Russia Hits Kyiv With Missiles; Putin Warns West on Arms Saudis Raise Oil Prices More Than Expected Amid Asia Rebound Stocks, Futures Rise as Mood Improves; Dollar Dips: Markets Wrap US May Allow More Iran Oil to Flow Even Without Deal, Says Vitol\n\nMariko Watahiki, a former judge who became a Toshiba board member last year, spoke out against the proposed election of two director candidates from Elliott Management Corp. and Farallon Capital Management, saying that if they were appointed, activists would take up too much of the board. Toshiba announced a slate of 13 proposed directors last month ahead of its shareholder meeting scheduled for June 28.\n\n“Toshiba has many types of shareholders, such as hedge funds, institutional investors and individual investors, who would seek profits from their investment in different ways,” Watahiki said in an interview with Bloomberg News. “If we take people from just one specific group, it’s impossible to avoid conflicts of interest.”\n\nIt’s an unusual show of public opposition to a board decision by an outside director at one of Japan’s most famous companies. It highlights the tensions that exist within Toshiba as the conglomerate considers its future, including whether to sell itself to private equity and go private.\n\nWatahiki said she wanted to let people know the board isn’t unanimously recommending the candidates. Directors linked to activists would pursue short-term profit, she said.\n\nWatahiki pointed out that Raymond Zage, another Toshiba director who is nominated to continue in the role, also previously worked for Farallon.\n\nFarallon didn’t immediately respond to a request for comment. A representative for Elliott didn’t immediately comment.\n\nStory continues\n\nZage said Toshiba’s nomination committee, which he chairs, went through an extensive review of candidates over a long period. He said he was specifically asked by the committee and the board to identify shareholder representatives to serve as directors. The objective of the process was to help rebuild trust with stock holders, he said.\n\nToshiba said last week it received eight offers to buy out the conglomerate and two proposals for capital and business alliances as part of its process to solicit strategic options for its future. While it didn’t disclose the bidders, Bain Capital, Blackstone Inc. and CVC Capital Partners are among buyout firms that were weighing bids, Bloomberg has reported.\n\nToshiba named Eijiro Imai, a managing director at Farallon Capital Japan, as one of its proposed director candidates, while Nabeel Bhanji, who hails from Elliott, is another.\n\nRead more: Toshiba Taps Activists for Board, Boosting Odds of Buyout\n\nToshiba’s leaders had long fought against the idea of privatization, with former Chief Executive Officer Satoshi Tsunakawa laying out five reasons why it would be the wrong decision just in February of this year. His management team instead argued the company should be split in two, but investors voted down that approach.\n\nWatahiki said it’s reasonable for Toshiba to have some board representation from its activist shareholders, but the balance isn’t right with the current candidate slate. Toshiba should give more board seats to people who have a deeper understanding of its businesses, she said.\n\nMost Read from Bloomberg Businessweek\n\nUkraine’s Tactics Are Showing Smaller Countries How to Fight Back Oz Won by Ditching the Oprahverse for Trump and Planet Hannity Sheryl Sandberg’s ‘Lean In’ Missed What Most Women Needed In Seattle’s Burning Hot Real Estate Market, It’s A.I. or Bust Seven Ways to Beat Burnout and Get Your Career Back on Track\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/toshiba-dissenting-director-speaks-activists-070000081.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["BLOOMBERG","BLOOMBERG NEWS","DIRECTOR CANDIDATES","FARALLON CAPITAL MANAGEMENT","MARIKO WATAHIKI","TOSHIBA"],"sentiment":{"polarity":0.226,"neg":0.029,"neu":0.943,"pos":0.028}},{"date":"2022-06-03T07:19:35+00:00","title":"Toshiba Director Opposes Board Nominees From Elliott, Farallon","content":"(Bloomberg) -- A Toshiba Corp. outside director opposed the nominations of two directors representing the company’s activist investors, suggesting possible conflict ahead in what has become a litmus test for corporate governance in Japan.\n\nMost Read from Bloomberg\n\nOne-Third of Americans Making $250,000 Live Paycheck-to-Paycheck, Survey Finds Elon Musk’s Ultimatum to Tesla Execs: Return to the Office or Get Out Apple Plans to Make the iPad More Like a Laptop and Less Like a Phone Stocks Decline as Data Show a Still-Hot Economy: Markets Wrap Jamie Dimon Says JPMorgan Is Bracing Itself for Economic ‘Hurricane’\n\nMariko Watahiki, a former Nagoya High Court chief justice, opposed the nomination of directors from Elliott Capital Advisors LP and Farallon Capital Management LLC, fellow Toshiba outside director Jerry Black said at a media roundtable Friday. Black declined to comment further on why Watahiki was against the appointments. Hedge funds are sometimes seen to prioritize their own short-term investment gains over companies’ long-term growth.\n\nUnder crticism that it was ignoring the wishes of shareholders, Toshiba last month nominated to its board Eijiro Imai and Nabeel Bhanji to represent activist investors Farallon and Elliott.\n\nToshiba said the previous day it received eight offers to buy out the conglomerate, as well as two proposals for capital and business alliances. The company said in a filing it will evaluate the non-binding bids and choose one or more to pursue after its annual shareholder meeting scheduled for June 28.\n\nThe likelihood of any bid to pass clearance with Japan’s Foreign Exchange and Foreign Trade Act will be one of the criteria when narrowing down the bids, Black said. The country’s Ministry of Economy, Trade and Industry will play an important role, he added.\n\nPrivate equity investors including CVC Capital Partners, Blackstone Inc. and Bain Capital were considering making bids, Bloomberg News has reported. State-backed investment fund Japan Investment Corp. was also mulling an offer, Bloomberg reported last month. Private equity fund MBK Partners also submitted a bid and may form a consortium for Toshiba, Maeil Business Newspaper reported, citing unidentified people in investment banking industry. Toshiba has not disclosed the bidders.\n\nStory continues\n\nMost Read from Bloomberg Businessweek\n\nFor Finland, a Border With Russia Is Bad. But It’s Better Than No Border at All In Seattle’s Burning Hot Real Estate Market, It’s A.I. or Bust Seven Ways to Beat Burnout and Get Your Career Back on Track China Youth Unemployment Crisis Leaves Tens of Millions Jobless Crypto Goes Shopping for a Regulator It Can Push Around\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/toshiba-director-opposes-board-nominees-071935179.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST INVESTORS","BLOOMBERG","BLOOMBERG NEWS","ELLIOTT CAPITAL ADVISORS","FARALLON CAPITAL MANAGEMENT","JERRY BLACK","MARIKO WATAHIKI","TOSHIBA"],"sentiment":{"polarity":0.542,"neg":0.041,"neu":0.903,"pos":0.056}},{"date":"2022-06-03T01:33:18+00:00","title":"UPDATE 3-Toshiba to flag that activist board nominees not approved unanimously -sources","content":"* One director opposed nominations of Elliott, Farallon execs\n\n* Toshiba to disclose the matter in booklet for June 28 AGM -sources (Adds board director's confirmation on opposition)\n\nBy Makiko Yamazaki\n\nTOKYO, June 3 (Reuters) - Toshiba Corp plans to notify shareholders that two board director nominees from activist hedge funds were not approved unanimously by its nomination committee, people familiar with the matter said on Friday.\n\nWhile divided votes on director nominations are not particularly rare, taking the step to formally disclose the matter is unusual, highlighting how contentious the issue has been for Toshiba's board.\n\nThe embattled conglomerate plans to include a note on the divided vote in a booklet for its June 28 annual shareholders' meeting, the two sources said, declining to be identified because the matter is private.\n\nJerry Black, an external director on the five-member nomination committee, confirmed to reporters that director Mariko Watahiki had objected to the nominations of Nabeel Bhanji, a senior portfolio manager at Elliott Management, and Eijiro Imai, managing director at Farallon Capital Management.\n\nBlack also said that Watahiki, a former high court judge, wanted to be on the record in opposing the two candidates. He declined to comment why she opposed the nominations.\n\nOne of the sources said that Watahiki had argued that the nominees' backgrounds could distort the balance on the board.\n\nWatahiki was not available for comment.\n\nCaught up in accounting and governance crises since 2015, Toshiba has long been at loggerheads with its activist shareholder base. Some of those shareholders, including Farallon, have called for the conglomerate to be taken private - arguing it is the best route to maximising shareholder value and resolving its governance issues.\n\nThe board director nominations are among signs that Toshiba, which has been exploring its strategic options after shareholders voted down a restructuring plan, has become more receptive to the idea of a take-private deal.\n\nStory continues\n\nToshiba said on Thursday it had received eight initial proposals to take it private as well as two proposals for capital alliances that would see it remain listed.\n\nBringing activist shareholders onto a board is relatively rare in Japan, though there have been a few cases including Olympus Corp's 2019 decision to invite a ValueAct Capital partner onto its board.\n\nIn addition to the nominations of Bhanji and Imai, Toshiba has also nominated Akihiro Watanabe, an executive from boutique U.S. investment bank Houlihan Lokey, as chairman of its board.\n\nToshiba's board has eight members but the company plans to increase that to 13. (Reporting by Makiko Yamazaki; Editing by Edwina Gibbs, Robert Birsel)","link":"https:\/\/finance.yahoo.com\/news\/1-toshiba-flag-activist-board-013318889.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST SHAREHOLDER","BOARD DIRECTOR","ELLIOTT MANAGEMENT","FARALLON CAPITAL MANAGEMENT","JERRY BLACK","MARIKO WATAHIKI","SHAREHOLDERS","TOSHIBA"],"sentiment":{"polarity":0.591,"neg":0.019,"neu":0.943,"pos":0.038}},{"date":"2022-06-03T01:16:00+00:00","title":"Toshiba to flag that activist board nominees not approved unanimously -sources","content":"By Makiko Yamazaki\n\nTOKYO (Reuters) -Toshiba Corp plans to notify shareholders that two board director nominees from activist hedge funds were not approved unanimously by its nomination committee, people familiar with the matter said on Friday.\n\nWhile divided votes on director nominations are not particularly rare, taking the step to formally disclose the matter is unusual, highlighting how contentious the issue has been for Toshiba's board.\n\nThe embattled conglomerate plans to include a note on the divided vote in a booklet for its June 28 annual shareholders' meeting, the two sources said, declining to be identified because the matter is private.\n\nJerry Black, an external director on the five-member nomination committee, confirmed to reporters that director Mariko Watahiki had objected to the nominations of Nabeel Bhanji, a senior portfolio manager at Elliott Management, and Eijiro Imai, managing director at Farallon Capital Management.\n\nBlack also said that Watahiki, a former high court judge, wanted to be on the record in opposing the two candidates. He declined to comment why she opposed the nominations.\n\nOne of the sources said that Watahiki had argued that the nominees' backgrounds could distort the balance on the board.\n\nWatahiki was not available for comment.\n\nCaught up in accounting and governance crises since 2015, Toshiba has long been at loggerheads with its activist shareholder base. Some of those shareholders, including Farallon, have called for the conglomerate to be taken private - arguing it is the best route to maximising shareholder value and resolving its governance issues.\n\nThe board director nominations are among signs that Toshiba, which has been exploring its strategic options after shareholders voted down a restructuring plan, has become more receptive to the idea of a take-private deal.\n\nToshiba said on Thursday it had received eight initial proposals to take it private as well as two proposals for capital alliances that would see it remain listed.\n\nStory continues\n\nBringing activist shareholders onto a board is relatively rare in Japan, though there have been a few cases including Olympus Corp's 2019 decision to invite a ValueAct Capital partner onto its board.\n\nIn addition to the nominations of Bhanji and Imai, Toshiba has also nominated Akihiro Watanabe, an executive from boutique U.S. investment bank Houlihan Lokey, as chairman of its board.\n\nToshiba's board has eight members but the company plans to increase that to 13.\n\n(Reporting by Makiko Yamazaki; Editing by Edwina Gibbs, Robert Birsel)","link":"https:\/\/finance.yahoo.com\/news\/toshiba-tell-shareholders-activist-nominees-011600665.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST SHAREHOLDER","BOARD DIRECTOR","EIJIRO IMAI","FARALLON CAPITAL MANAGEMENT","JERRY BLACK","MARIKO WATAHIKI","NABEEL BHANJI","NOMINATION COMMITTEE","SHAREHOLDERS","TOSHIBA CORP"],"sentiment":{"polarity":0.584,"neg":0.021,"neu":0.941,"pos":0.038}},{"date":"2022-06-03T01:13:42+00:00","title":"Toshiba to tell shareholders that activist nominees not approved unanimously -sources","content":"TOKYO, June 3 (Reuters) - Toshiba Corp plans to notify its shareholders that board director nominees from two of its major hedge fund shareholders were not approved unanimously by the nomination committee, people familiar with the matter said on Friday.\n\nThe embattled conglomerate plans to include the note on the divided vote in its notice of the annual shareholders meeting on June 28, to be published next week, the two sources said, declining to be identified because the matter is still private. (Reporting by Makiko Yamazaki Editing by Chang-Ran Kim)","link":"https:\/\/finance.yahoo.com\/news\/toshiba-tell-shareholders-activist-nominees-011342665.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ANNUAL SHAREHOLDERS MEETING","SHAREHOLDERS","TOSHIBA CORP"],"sentiment":{"polarity":-0.084,"neg":0.017,"neu":0.958,"pos":0.025}},{"date":"2022-06-02T11:09:10+00:00","title":"Toshiba Gets Privatization Proposals - Guess How Many Are Interested","content":"Japanese multinational Toshiba Corp (OTC: TOSYY) has received eight proposals for privatization and two to form capital alliances that would make it remain listed. The company’s board of directors and a special committee have previously sought proposals for strategic alternatives after the shareholders voted against a proposed restructuring plan. The proposals received are not legally binding ones. Toshiba said it would evaluate the proposals and call the selected ones for a final process after its annual shareholders meeting on June 28, 2022. KKR & Co. Inc (NYSE: KKR), Blackstone Inc (NYSE: BX), Bain Capital, Brookfield Asset Management Inc (NYSE: BAM), MBK Partners, Apollo Global Management, and CVC Capital Partners were considering bids, Reuters reported. Price Action: PVH shares closed higher by 0.74% at $71.40 on Wednesday. Photo Via Wikimedia Commons\n\nSee more from Benzinga\n\nCalvin Klein Parent PVH's Q1 Earnings Top Estimates Medifast Adopts $100M Accelerated Share Repurchase Program\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\n© 2022 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.","link":"https:\/\/finance.yahoo.com\/news\/toshiba-gets-privatization-proposals-guess-110910800.html","symbols":["BAM.US","BX.US","KKR.US","TOSBF.US","TOSYY.US","TSE1.F"],"tags":["CVC CAPITAL PARTNERS","KKR","NYSE","SPECIAL COMMITTEE","TOSHIBA CORP"],"sentiment":{"polarity":0.974,"neg":0.006,"neu":0.849,"pos":0.146}},{"date":"2022-06-02T05:33:28+00:00","title":"Toshiba Reveals Buyout Bids as Privatization Odds Increase","content":"(Bloomberg) -- Toshiba Corp. said it received eight offers to buy out the conglomerate and two proposals for capital and business alliances as the Japanese industrial giant moved a step closer to a possible privatization.\n\nMost Read from Bloomberg\n\nElon Musk’s Ultimatum to Tesla Execs: Return to the Office or Get Out One-Third of Americans Making $250,000 Live Paycheck-to-Paycheck, Survey Finds Jamie Dimon Says JPMorgan Is Bracing Itself for Economic ‘Hurricane’ Ready to Buy a House? Just Wait a Few Weeks Fed Starts Experiment of Letting $8.9 Trillion Portfolio Shrink\n\nThe Tokyo-based company outlined the number of non-binding offers received in a statement Thursday, without disclosing the bidders. It will evaluate the proposals and choose one or more of them to pursue, as soon as possible after the annual shareholder meeting scheduled for June 28.\n\nToshiba’s shares rose as much as 1.9% in Tokyo.\n\nToshiba said last month it signed confidentiality agreements with 10 potential investors as part of its process to solicit proposals on privatization and strategic alternatives. The firm has been looking at other options after shareholders voted down a plan put forward by management to split in two.\n\nLast week, Toshiba nominated an M&A veteran to chair its board and picked two executives from its activist shareholders among its slate of director candidates, which will be voted on at the AGM and then decide on the buyout offers. Former Chief Executive Officer Satoshi Tsunakawa, who had opposed going private, will step down from the board.\n\nPrivate equity investors including CVC Capital Partners, Blackstone Inc. and Bain Capital were considering making bids, Bloomberg News has reported. State-backed investment fund Japan Investment Corp. was also mulling an offer, Bloomberg reported last month.\n\nRead more: Japan State-Backed Fund JIC Is Said to Explore Toshiba Bid\n\nToshiba will provide selected bidders with the opportunity to do due diligence in July and after, and ask them to submit legally binding proposals, it said in the statement.\n\nStory continues\n\nToshiba has been locked in a conflict with its shareholders over the future of the conglomerate, whose businesses range from semiconductors and quantum computing to nuclear power plants. Activist investors have been calling for the company to go private, a path that Toshiba management had been resisting before its proposal to split in two was voted down. Analysts have said the nuclear business, which is deemed important to Japan’s national security, is a major obstacle to any privatization.\n\nA buyout of Toshiba, which has a market value of more than $19 billion, could be private equity’s biggest ever deal in the country.\n\nSeparately on Thursday, Toshiba announced its management policy for the group, including a target of net sales of 5 trillion yen ($38.4 billion) and 600 billion yen in operating income in fiscal 2030.\n\n(Updates with details on process, business targets from seventh paragraph)\n\nMost Read from Bloomberg Businessweek\n\nChina Youth Unemployment Crisis Leaves Tens of Millions Jobless Seven Ways to Beat Burnout and Get Your Career Back on Track Crypto Goes Shopping for a Regulator It Can Push Around Tommy Hilfiger Comes Home With a Business Program at His Local College Gun Sellers Push Quick Buy Now, Pay Later Financing\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/toshiba-reveals-buyout-bids-odds-050620026.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["BLOOMBERG","BLOOMBERG NEWS","BUSINESS ALLIANCES","PRIVATE EQUITY INVESTORS","PRIVATIZATION","TOSHIBA"],"sentiment":{"polarity":0.077,"neg":0.029,"neu":0.936,"pos":0.035}},{"date":"2022-06-02T05:17:49+00:00","title":"UPDATE 2-Toshiba receives 10 investment proposals including eight to go private","content":"(Adds profit outlook for FY2030)\n\nTOKYO, June 2 (Reuters) - Toshiba Corp said on Thursday it has received 10 investment proposals including 8 proposals to go private as the troubled Japanese conglomerate explores strategic options.\n\nThe other two proposals were for capital and business alliances in which Toshiba would remain listed.\n\nToshiba, which has been bedevilled by accounting and governance crises since 2015, set up a special committee in April to solicit proposals after shareholders voted down a management-backed restructuring plan.\n\nThe deadline for submitting the non-binding proposals was Monday.\n\nThe company said in a statement it will evaluate financing arrangements, the feasibility of the proposals and select potential investors to be given due diligence opportunities after its shareholders meeting on June 28.\n\nLast month, Toshiba said 10 potential investors had signed confidentiality pledges.\n\nAccording to sources, KKR & Co Inc, Blackstone Inc , Bain Capital and Brookfield Asset Management were considering bids.\n\nJapanese firms including Japan Investment Corp, Japan Industrial Partners and Polaris Capital Group were also looking at participating in bids, sources have also said.\n\nIt was not immediately clear which private equity firms had made actual bids or which firms might join hands with others in their proposals.\n\nIn steps that investors say have increased the odds of Toshiba agreeing to a take-private deal, the conglomerate has nominated an executive from M&A advisory firm Houlihan Lokey as chairperson and activist shareholders as outside directors.\n\nToshiba also said on Thursday it expects its operating profit to nearly quadruple to 600 billion yen ($4.6 billion) in the year through March 2031 from the last financial year.\n\nIt aims to beef up digital-related services, production of power management chips and research on next-generation nuclear power reactors.\n\nThe outlook will be the springboard for discussions with potential investors, it said. ($1 = 130.0400 yen) (Reporting by Makiko Yamazaki; Additional reporting by Scott Murdoch in Hong kong, Sam Nussey and Junko Fujita in Tokyo; Editing by Edwina Gibbs)","link":"https:\/\/finance.yahoo.com\/news\/1-toshiba-receives-10-initial-051749447.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["INVESTMENT PROPOSALS","JAPANESE FIRMS","PRIVATE EQUITY FIRMS","PROFIT OUTLOOK","SHAREHOLDERS MEETING","TOSHIBA CORP"],"sentiment":{"polarity":0.93,"neg":0.014,"neu":0.925,"pos":0.061}},{"date":"2022-06-02T05:06:56+00:00","title":"Toshiba receives 10 investment proposals including eight to go private","content":"TOKYO (Reuters) - Toshiba Corp said on Thursday it has received 10 investment proposals including 8 proposals to go private as the troubled Japanese conglomerate explores strategic options.\n\nThe other two proposals were for capital and business alliances in which Toshiba would remain listed.\n\nToshiba, which has been bedevilled by accounting and governance crises since 2015, set up a special committee in April to solicit proposals after shareholders voted down a management-backed restructuring plan.\n\nThe deadline for submitting the non-binding proposals was Monday.\n\nThe company said in a statement it will evaluate financing arrangements, the feasibility of the proposals and select potential investors to be given due diligence opportunities after its shareholders meeting on June 28.\n\nLast month, Toshiba said 10 potential investors had signed confidentiality pledges.\n\nAccording to sources, KKR & Co Inc, Blackstone Inc, Bain Capital and Brookfield Asset Management were considering bids.\n\nJapanese firms including Japan Investment Corp, Japan Industrial Partners and Polaris Capital Group were also looking at participating in bids, sources have also said.\n\nIt was not immediately clear which private equity firms had made actual bids or which firms might join hands with others in their proposals.\n\nIn steps that investors say have increased the odds of Toshiba agreeing to a take-private deal, the conglomerate has nominated an executive from M&A advisory firm Houlihan Lokey as chairperson and activist shareholders as outside directors.\n\nToshiba also said on Thursday it expects its operating profit to nearly quadruple to 600 billion yen ($4.6 billion) in the year through March 2031 from the last financial year.\n\nIt aims to beef up digital-related services, production of power management chips and research on next-generation nuclear power reactors.\n\nThe outlook will be the springboard for discussions with potential investors, it said.\n\n($1 = 130.0400 yen)\n\n(Reporting by Makiko Yamazaki; Additional reporting by Scott Murdoch in Hong kong, Sam Nussey and Junko Fujita in Tokyo; Editing by Edwina Gibbs)","link":"https:\/\/finance.yahoo.com\/news\/toshiba-receives-10-initial-proposals-050656807.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["INVESTMENT PROPOSALS","JAPANESE FIRMS","PRIVATE EQUITY FIRMS","SHAREHOLDERS MEETING","TOSHIBA CORP"],"sentiment":{"polarity":0.899,"neg":0.014,"neu":0.932,"pos":0.054}},{"date":"2022-05-31T21:44:45+00:00","title":"Small nuclear power projects may have big waste problems -study","content":"By Timothy Gardner\n\nWASHINGTON, May 31 (Reuters) - A planned new generation of small nuclear reactors will create more waste than conventional reactors, while treatments to make some types of waste safe could be exploited by militants trying to obtain fissile materials, a study published on Tuesday said.\n\nThe projects, called small modular reactors (SMR), are designed to be simpler and safer than conventional plants in the case of accident. They are also expected to be built in factories as opposed to today's massive light-water reactors that are built on site and typically run billions of dollars over budget.\n\nSMR backers say they are a safe way to boost generation of virtually emissions-free electricity and will help curb climate change.\n\nBut the reactors would create more radioactive waste, per unit of electricity they generate, than conventional reactors by a factor of up to 30 according to a study https:\/\/www.pnas.org\/doi\/full\/10.1073\/pnas.2111833119 published in the Proceedings of the National Academy of Sciences.\n\nSome of the reactors, with molten salt and sodium-cooled designs, are expected to create waste that needs to go through additional conditioning to make it safe to store in a repository. Those treatments are vulnerable to being converted by militants to make fissile materials for a crude nuclear bomb, it said.\n\nAllison Macfarlane, a co-author of the study and former head of the U.S. Nuclear Regulatory Commission, said SMR designers \"don't pay that much attention in general to the waste ... because the thing that makes money for them is the reactor.\"\n\n\"But it's important to know about the waste products and whether they're going to pose any difficulties in disposing of them and in managing them,\" Macfarlane said.\n\nThe United States has no plan to permanently store long lasting, toxic nuclear waste, after Washington stopped funding the Yucca Mountain waste site in Nevada. Instead, the waste, which the industry calls spent nuclear fuel, mostly sits at nuclear plants in pools and later in dry casks made of steel and concrete.\n\nStory continues\n\n\"Even if we had a robust waste management program, we think there would be a lot of challenges to deal with some of the SMR waste,\" said Lindsay Krall, the study's lead author.\n\nNuScale Power Corp reactors, which could use light water as a coolant, as do conventional nuclear plants, would produce about 1.7 times more waste per energy equivalent than traditional reactors, the study found.\n\nDiane Hughes, a NuScale spokesperson, said the study used outdated design information and incorrect assumptions about the plants.\n\nOther reactors, being planned by Terrestrial Energy and Toshiba Corp that plan to use fuels and coolants different than traditional reactors are also expected to create more waste per unit of energy, the study said. Those reactors would likely require additional procedures known as conditioning which offer pathways to proliferation, it said.\n\nSimon Irish, Terrestrial Energy's chief executive, said its plant would generate less waste per unit of power and the company is developing a conversion process to make waste more geologically stable than waste from current reactors.\n\nToshiba did not immediately respond to a request for comment.\n\n(Reporting by Timothy Gardner; editing by Richard Pullin)","link":"https:\/\/finance.yahoo.com\/news\/small-nuclear-power-projects-may-214445331.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["CONVENTIONAL PLANTS","FISSILE MATERIALS","NUCLEAR BOMB","NUCLEAR PLANTS","NUCLEAR REACTORS","RADIOACTIVE WASTE","SMALL MODULAR REACTORS","SMR","WASTE PRODUCTS"],"sentiment":{"polarity":-0.973,"neg":0.112,"neu":0.812,"pos":0.076}},{"date":"2022-05-27T10:53:01+00:00","title":"Exclusive-Japanese buyout firms JIP, Polaris considering bids for Toshiba - sources","content":"By Makiko Yamazaki and Scott Murdoch\n\nTOKYO\/HONG KONG (Reuters) - Japanese buyout firms Japan Industrial Partners (JIP) and Polaris Capital Group are each considering participating in bids for Toshiba Corp, two people familiar with the matter said on Friday.\n\nToshiba, which has been bedevilled by accounting and governance crises since 2015, set up a special committee last month to explore strategic options, including potential deals to go private, after shareholders voted down a management-backed restructuring plan.\n\nBoth funds, far smaller than some global private equity firms, would need to team up with others, the sources said. The participation of local funds is seen as critical as some of Toshiba's assets - including defence equipment and nuclear power - are seen as strategically important in Japan.\n\nThe sources declined to be identified as the matter is private.\n\nIt was not immediately clear if JIP and Polaris were already collaborating with other funds.\n\nAlthough not well known overseas, the pair have been involved in corporate carve outs and spin offs from Japanese conglomerates.\n\nJIP, for example, bought Olympus' camera business last year and Sony Group's laptop computer business in 2014. Polaris acquired Fujitsu's mobile phone business in 2018.\n\nJIP could not be reached immediately for comment. A representative for Polaris said it is true that the firm is considering the opportunity, but declined to comment further.\n\nToshiba said 10 potential investors had signed confidentiality pledges, without identifying them. The deadline for initial proposals is Monday.\n\nA spokesperson for Toshiba said the company \"intends to provide transparent updates on the process to our shareholders, and will publicly announce the number of non-binding proposals received from potential partners and the overview of proposed deal structures before the annual shareholders' meeting in June\".\n\nThe Japanese government will not block foreign investors from buying industrial giants such as Toshiba provided they comply with rules that govern the handling of sensitive technology, Takayuki Kobayashi, Japan's economic security minister, told Reuters recently.\n\n(Reporting by Makiko Yamazaki and Scott Murdoch; Editing by Kirsten Donovan)","link":"https:\/\/ca.finance.yahoo.com\/news\/exclusive-japanese-buyout-firms-jip-105301425.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["JAPAN","JAPANESE CONGLOMERATES","JIP","POLARIS","PRIVATE EQUITY FIRMS","TOSHIBA CORP"],"sentiment":{"polarity":0.839,"neg":0.015,"neu":0.931,"pos":0.054}},{"date":"2022-05-26T07:16:38+00:00","title":"UPDATE 1-Japan's Toshiba brings in M&amp;A adviser and activists in board overhaul","content":"(Adds nomination committee chair comment, context)\n\nBy Makiko Yamazaki\n\nTOKYO, May 26 (Reuters) - Toshiba Corp nominated an executive from M&A advisory firm Houlihan Lokey as chairperson and activist shareholders as outside directors on Thursday, in a board overhaul that could intensify pressure to take the conglomerate private.\n\nAhead of its annual shareholders' meeting on June 28, Toshiba nominated Akihiro Watanabe, the founder of Japanese M&A advisory firm GCA Corp, which was recently acquired by U.S. investment bank Houlihan Lokey.\n\nIt also proposed Nabeel Bhanji, a portfolio manager at Elliott Management, and Eijiro Imai, managing director at Farallon Capital Management, would be given board seats, a potential turning point in a long battle between Toshiba and its activist shareholders.\n\nFarallon, Toshiba's third-largest shareholder with a stake of more than 6%, has said it believes taking Toshiba private would maximise value for shareholders. Elliott owns just under 5% of Toshiba, according to sources.\n\nToshiba, which has since 2015 been bedevilled by accounting and governance crises, has been exploring strategic options, including potential deals to go private, since shareholders voted down a management-backed restructuring plan.\n\nRaymond Zage, the head of the nomination committee, said at a briefing that given the importance of the discussions on potential privatization proposals, the committee felt that it \"would be helpful to all shareholders to have two out of the 13 representatives on the board\" from large shareholders.\n\nCurrent board Chair Satoshi Tsunakawa, who has been serving in the post on an interim basis since the re-election of the then chairperson was rejected last year, will step down to become executive advisor.\n\nBoard director nominations were delayed for about two weeks as Toshiba took extra time to ascertain whether there were any conflict-of-interest issues for some candidates.\n\nToshiba also nominated Taro Shimada and Goro Yanase as chief executive officer and chief operating officer, respectively. The two also have been serving in the posts on an interim basis since the sudden resignation of Tsunakawa as CEO in March.\n\n(Reporting by Makiko Yamazaki; editing by Jacqueline Wong, Jason Neely and Kim Coghill)","link":"https:\/\/finance.yahoo.com\/news\/1-japans-toshiba-brings-m-071638181.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST SHAREHOLDERS","ELLIOTT MANAGEMENT","FARALLON CAPITAL MANAGEMENT","HOULIHAN LOKEY","SHAREHOLDERS","TOSHIBA CORP"],"sentiment":{"polarity":-0.273,"neg":0.035,"neu":0.936,"pos":0.029}},{"date":"2022-05-26T06:54:39+00:00","title":"Japan's Toshiba brings in M&amp;A adviser and activists in board overhaul","content":"By Makiko Yamazaki\n\nTOKYO (Reuters) - Toshiba Corp nominated an executive from M&A advisory firm Houlihan Lokey as chairperson and activist shareholders as outside directors on Thursday, in a board overhaul that could intensify pressure to take the conglomerate private.\n\nAhead of its annual shareholders' meeting on June 28, Toshiba nominated Akihiro Watanabe, the founder of Japanese M&A advisory firm GCA Corp, which was recently acquired by U.S. investment bank Houlihan Lokey.\n\nIt also proposed Nabeel Bhanji, a portfolio manager at Elliott Management, and Eijiro Imai, managing director at Farallon Capital Management, would be given board seats, a potential turning point in a long battle between Toshiba and its activist shareholders.\n\nFarallon, Toshiba's third-largest shareholder with a stake of more than 6%, has said it believes taking Toshiba private would maximise value for shareholders. Elliott owns just under 5% of Toshiba, according to sources.\n\nToshiba, which has since 2015 been bedevilled by accounting and governance crises, has been exploring strategic options, including potential deals to go private, since shareholders voted down a management-backed restructuring plan.\n\nRaymond Zage, the head of the nomination committee, said at a briefing that given the importance of the discussions on potential privatization proposals, the committee felt that it \"would be helpful to all shareholders to have two out of the 13 representatives on the board\" from large shareholders.\n\nCurrent board Chair Satoshi Tsunakawa, who has been serving in the post on an interim basis since the re-election of the then chairperson was rejected last year, will step down to become executive advisor.\n\nBoard director nominations were delayed for about two weeks as Toshiba took extra time to ascertain whether there were any conflict-of-interest issues for some candidates.\n\nToshiba also nominated Taro Shimada and Goro Yanase as chief executive officer and chief operating officer, respectively. The two also have been serving in the posts on an interim basis since the sudden resignation of Tsunakawa as CEO in March.\n\n(Reporting by Makiko Yamazaki; editing by Jacqueline Wong, Jason Neely and Kim Coghill)","link":"https:\/\/finance.yahoo.com\/news\/toshiba-nominates-houlihan-exec-chair-065439467.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ACTIVIST SHAREHOLDERS","ELLIOTT MANAGEMENT","FARALLON CAPITAL MANAGEMENT","HOULIHAN LOKEY","SHAREHOLDERS","TOSHIBA CORP"],"sentiment":{"polarity":-0.273,"neg":0.036,"neu":0.934,"pos":0.03}},{"date":"2022-05-26T06:43:11+00:00","title":"Toshiba Taps Activists for Board, Boosting Odds of Buyout","content":"(Bloomberg) -- Toshiba Corp. tapped candidates from its activist shareholders to serve as directors, increasing the likelihood of privatization as a staunch opponent of a buyout will step down from the board.\n\nMost Read from Bloomberg\n\nFed Saw Aggressive Hikes Providing Flexibility Later This Year Biden Demands US ‘Stand Up’ to Gun Makers After Texas Attack Why So Few Big Rats Have Fled Putin’s Ship Stocks Climb in Volatile Session After Fed Minutes: Markets Wrap Plot to Kill George W. Bush in Revenge for Iraq War Was Foiled, FBI Says\n\nThe Tokyo-based firm nominated an executive each from Elliott Management Corp. and Farallon Capital Management, it said in a statement Thursday. Former Chief Executive Officer Satoshi Tsunakawa will leave the board.\n\nIf elected by shareholders at the annual meeting in June, the candidates could help smooth the path for a sale to private equity as the conglomerate seeks offers on privatization and other strategic alternatives.\n\n“Having shareholder representatives join the board strengthens the alignment between shareholders and management,” Raymond Zage, chairperson of the nomination committee, said in the statement.\n\nThe announcement of the director slate was initially delayed earlier this month as the company said it needed more time. Proposed candidates met opposition from some Toshiba executives for being close to activist shareholders, broadcaster TV Tokyo reported at the time.\n\nEijiro Imai, a managing director at Farallon Capital Japan, is one of the proposed director candidates, while Nabeel Bhanji, who hails from Elliott, is another.\n\nAkihiro Watanabe, chairman, managing director and chairman of Asia corporate finance at Houlihan Lokey, was nominated as chairman of the board.\n\nTsunakawa, who is departing, was one of the most vocal opponents of going private within Toshiba. In an interview with Bloomberg News in February, the 66-year-old company veteran said Toshiba would lose orders from public entities and would be forced to sell sensitive technology operations if it did so. Tsunakawa’s alternative vision for the firm, to split in two, was voted down by stock owners in March.\n\nStory continues\n\nToshiba, which is now exploring other strategic options, has set a deadline of May 30 for receiving non-binding proposals from investors, including bids to go private.\n\nJapan Investment Corp., a government-backed fund, is considering is considering making an offer, Bloomberg News reported this week, citing people familiar with the matter. Bain Capital, Blackstone Inc., CVC Capital Partners and KKR & Co. are among the buyout firms that are also weighing bids, Bloomberg has reported.\n\nRead more: Japan State-Backed Fund JIC Is Said to Explore Toshiba Bid\n\nToshiba executives have opposed director candidates from activist shareholders before.\n\nWhen Effissimo Capital Management Pte., the company’s largest stock holder, sought in 2020 to put one of its co-founders on Toshiba’s board, shareholders rejected it. Suspicious about how the vote was conducted, Effissimo called for independent investigators be appointed to look into it, winning a landmark shareholder vote last year. The subsequent report from the probe alleged that Toshiba management worked hand in hand with government allies to sway the outcome, findings that four Toshiba board members described as “deeply disturbing.”\n\n(Updates with board chairman in seventh paragraph)\n\nMost Read from Bloomberg Businessweek\n\nMark Zuckerberg Is Blowing Up Instagram to Try and Catch TikTok Elon Musk’s 420-Degree Edgelord Pivot Is Getting Stale Deadly Heat in India Is a Warning of Global Catastrophes to Come The Tech Rout Isn’t Just Cyclical—It’s Well-Earned, and Overdue Open With Care: That Next Power Bill Could Shock You\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/toshiba-taps-activists-board-boosting-064311662.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["BLOOMBERG","BLOOMBERG NEWS","DIRECTOR CANDIDATES","FARALLON CAPITAL MANAGEMENT","SATOSHI TSUNAKAWA","SHAREHOLDERS","TOSHIBA"],"sentiment":{"polarity":-0.894,"neg":0.064,"neu":0.89,"pos":0.046}},{"date":"2022-05-26T06:43:11+00:00","title":"Toshiba Taps Activists for Board, Boosting Odds of Buyout","content":"(Bloomberg) -- Toshiba Corp. tapped candidates from its activist shareholders to serve as directors, increasing the likelihood of privatization as a staunch opponent of a buyout will step down from the board.\n\nMost Read from Bloomberg\n\nFed Saw Aggressive Hikes Providing Flexibility Later This Year Biden Demands US ‘Stand Up’ to Gun Makers After Texas Attack Why So Few Big Rats Have Fled Putin’s Ship Stocks Climb in Volatile Session After Fed Minutes: Markets Wrap Plot to Kill George W. Bush in Revenge for Iraq War Was Foiled, FBI Says\n\nThe Tokyo-based firm nominated an executive each from Elliott Management Corp. and Farallon Capital Management, it said in a statement Thursday. Former Chief Executive Officer Satoshi Tsunakawa will leave the board.\n\nIf elected by shareholders at the annual meeting in June, the candidates could help smooth the path for a sale to private equity as the conglomerate seeks offers on privatization and other strategic alternatives.\n\n“Having shareholder representatives join the board strengthens the alignment between shareholders and management,” Raymond Zage, chairperson of the nomination committee, said in the statement.\n\nThe announcement of the director slate was initially delayed earlier this month as the company said it needed more time. Proposed candidates met opposition from some Toshiba executives for being close to activist shareholders, broadcaster TV Tokyo reported at the time.\n\nEijiro Imai, a managing director at Farallon Capital Japan, is one of the proposed director candidates, while Nabeel Bhanji, who hails from Elliott, is another.\n\nAkihiro Watanabe, chairman, managing director and chairman of Asia corporate finance at Houlihan Lokey, was nominated as chairman of the board.\n\nTsunakawa, who is departing, was one of the most vocal opponents of going private within Toshiba. In an interview with Bloomberg News in February, the 66-year-old company veteran said Toshiba would lose orders from public entities and would be forced to sell sensitive technology operations if it did so. Tsunakawa’s alternative vision for the firm, to split in two, was voted down by stock owners in March.\n\nStory continues\n\nToshiba, which is now exploring other strategic options, has set a deadline of May 30 for receiving non-binding proposals from investors, including bids to go private.\n\nJapan Investment Corp., a government-backed fund, is considering is considering making an offer, Bloomberg News reported this week, citing people familiar with the matter. Bain Capital, Blackstone Inc., CVC Capital Partners and KKR & Co. are among the buyout firms that are also weighing bids, Bloomberg has reported.\n\nRead more: Japan State-Backed Fund JIC Is Said to Explore Toshiba Bid\n\nToshiba executives have opposed director candidates from activist shareholders before.\n\nWhen Effissimo Capital Management Pte., the company’s largest stock holder, sought in 2020 to put one of its co-founders on Toshiba’s board, shareholders rejected it. Suspicious about how the vote was conducted, Effissimo called for independent investigators be appointed to look into it, winning a landmark shareholder vote last year. The subsequent report from the probe alleged that Toshiba management worked hand in hand with government allies to sway the outcome, findings that four Toshiba board members described as “deeply disturbing.”\n\n(Updates with board chairman in seventh paragraph)\n\nMost Read from Bloomberg Businessweek\n\nMark Zuckerberg Is Blowing Up Instagram to Try and Catch TikTok Elon Musk’s 420-Degree Edgelord Pivot Is Getting Stale Deadly Heat in India Is a Warning of Global Catastrophes to Come Open With Care: That Next Power Bill Could Shock You The Tech Rout Isn’t Just Cyclical—It’s Well-Earned, and Overdue\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/toshiba-taps-activists-board-boosting-064311213.html","symbols":["BBN1.F","BX.US","KKR-PC.US","KKR.US","KR51.F","TOSBF.US","TOSYY.US"],"tags":["BLOOMBERG","BLOOMBERG NEWS","DIRECTOR CANDIDATES","FARALLON CAPITAL MANAGEMENT","SATOSHI TSUNAKAWA","SHAREHOLDERS","TOSHIBA"],"sentiment":{"polarity":-0.894,"neg":0.064,"neu":0.89,"pos":0.046}},{"date":"2022-05-25T03:48:27+00:00","title":"State-Backed Fund JIC Is Said to Explore Offer for Toshiba","content":"(Bloomberg) -- State-backed investment fund Japan Investment Corp. is considering a bid for Toshiba Corp., according to people with knowledge of the matter.\n\nMost Read from Bloomberg\n\nPlot to Kill George W. Bush in Revenge for Iraq War Was Foiled, FBI Says Biden Demands US ‘Stand Up’ to Gun Makers After Texas Attack Texas Shooter Kills 18 Elementary School Children, One Teacher Why So Few Big Rats Have Fled Putin’s Ship\n\nJIC has signed a confidential agreement with the Japanese conglomerate for access to detailed finances as it weighs an offer, said the people, who asked not to be identified as the information is private. The state-backed fund is likely to team up with other suitors and has been approached by private equity funds pitching a joint bid, two of the people said.\n\nDeliberations are ongoing and JIC could decide against proceeding with an offer, the people said.\n\nShares of Toshiba extended gains to as much as 3.3% and touched their highest level since 2008 on Wednesday after the Bloomberg News report. The stock was 2.4% higher at the close.\n\nA representative for JIC declined to comment. A representative for Toshiba declined to comment on JIC’s interest and reiterated that several partners have signed confidentiality pledges. Toshiba will provide updates and announce the number of non-binding bids received before its annual shareholders meeting, the representative said.\n\nToshiba is fielding take-private proposals after its shareholders rejected a plan put forward by management to split the company. The conglomerate said this month that 10 potential investors and sponsors have signed confidentiality pacts and non-binding offers are due by May 30.\n\nThe company added JPMorgan Chase & Co. and Mizuho Financial Group Inc. to help evaluate the submissions. It had already hired Nomura Holdings Inc. as an adviser. Bain Capital, Blackstone Inc., CVC Capital Partners and KKR & Co. are among buyout firms that are weighing bids for Toshiba, Bloomberg News has reported.\n\nStory continues\n\nJIC, founded in 2018, aims to enhance Japan’s competitiveness through supporting the growth of next-generation industries and stimulating private sector investment, according to its website. The Japanese government is JIC’s majority shareholder with an investment of about 367 billion yen ($2.9 billion), while 25 investors including Asahi Kasei Corp. and Canon Inc. have contributed 13.5 billion yen in total.\n\nA buyout of Toshiba, which has a market value of about $19.6 billion, could be private equity’s biggest ever deal in the country. The potential deal would add to the $105 billion worth of transactions targeting Japanese companies announced over the past year, according to data compiled by Bloomberg.\n\nRead more: Private Equity Firms Eyeing Toshiba Buyout Face Nuclear Dilemma\n\n(Updates Toshiba’s shares in fourth paragraph.)\n\nMost Read from Bloomberg Businessweek\n\nMark Zuckerberg Is Blowing Up Instagram to Try and Catch TikTok Deadly Heat in India Is a Warning of Global Catastrophes to Come The Thrill of Better Office Wi-Fi Elon Musk’s 420-Degree Edgelord Pivot Is Getting Stale Open With Care: That Next Power Bill Could Shock You\n\n©2022 Bloomberg L.P.","link":"https:\/\/finance.yahoo.com\/news\/state-backed-fund-jic-said-034827947.html","symbols":["AHKSF.US","AHKSY.US","ASAA.F","BBN1.F","BX.US","CAJ.US","CAJFF.US","CMC.F","CMC.XETRA","CNN1.F","CNNA.F","JPM-PC.US","JPM-PD.US","JPM-PK.US","JPM-PL.US"],"tags":["BLOOMBERG","BLOOMBERG NEWS","JIC","PRIVATE EQUITY FUNDS","TOSHIBA"],"sentiment":{"polarity":0.527,"neg":0.058,"neu":0.869,"pos":0.074}},{"date":"2022-05-23T12:37:39+00:00","title":"Exclusive-Toshiba to propose Elliott, Farallon executives join its board, sources says","content":"By Makiko Yamazaki\n\nTOKYO (Reuters) -Toshiba Corp plans to propose giving two of its major hedge fund shareholders seats on its board, people familiar with the matter said, a move that could give foreign investors more influence over the troubled Japanese conglomerate.\n\nToshiba plans to nominate executives from Elliott Management and Farallon Capital Management for board seats ahead of its annual shareholder meeting in June, said the people, who declined to be identified because the matter has not been made public.\n\nThree of the people said Toshiba would propose an Elliott executive, and two of them said it would also propose one from Farallon.\n\nThe move could mark a turning point in a long battle between Toshiba's management and its activist shareholders.\n\nA Toshiba spokesperson said the company hadn't finalised its board director nominees, adding it would disclose its decisions promptly once they had been made.\n\nFarallon, Toshiba's third-largest shareholder with a stake of more than 6%, and Elliott, which sources say owns just under 5% of Toshiba, didn't immediately respond to requests for comment.\n\nToshiba has delayed board director nominations, saying it is trying to ascertain whether there are any conflicts of interest for some candidates.\n\nBringing activist shareholders onto a board is relatively rare in Japan.\n\nBut this is slowly changing. In 2019, Olympus Corp brought a ValueAct Capital partner onto its board as the medical equipment firm saw the San Francisco-based fund as a potential catalyst for change at the firm, which was reeling from an accounting scandal.\n\nGreater influence for hedge fund shareholders could also raise the chance of a deal to take Toshiba private.\n\nFarallon said in March it believed taking Toshiba private would maximise value for shareholders and was the only solution for Toshiba to fix its governance, capital allocation issues, and the deep mistrust among its shareholders.\n\nToshiba, which has since 2015 been bedevilled by accounting and governance crises, set up a special committee last month to explore strategic options, including potential deals to go private, after shareholders voted down a management-backed restructuring plan.\n\nIt said 10 potential investors had signed confidentiality pledges, without identifying them.\n\n(Reporting by Makiko Yamazaki Editing by David Dolan and Mark Potter)","link":"https:\/\/finance.yahoo.com\/news\/exclusive-toshiba-nominate-elliott-farallon-123739025.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["BOARD DIRECTOR","BOARD SEATS","ELLIOTT MANAGEMENT","FARALLON CAPITAL MANAGEMENT","SHAREHOLDERS","TOSHIBA CORP"],"sentiment":{"polarity":0.542,"neg":0.035,"neu":0.913,"pos":0.052}},{"date":"2022-05-18T12:03:23+00:00","title":"Japan set to allow foreign Toshiba bids if they comply with security rules","content":"By Tim Kelly and Kaori Kaneko\n\nTOKYO (Reuters) - Japan will not block foreign investors from buying industrial giants such as Toshiba Corp provided they comply with rules that govern the handling of sensitive infrastructure and technology, Japan's economic security minister said.\n\n\"Economic activity is free,\" Takayuki Kobayashi said in an interview when asked whether officials would intervene in any foreign bid for Toshiba. \"In cases when there are security concerns, we respond appropriately in accordance with Japanese laws and regulations.\"\n\nForeign private equity firms are vying for control of Toshiba in what will be a test of Japan's willingness to allow one of its established corporations to fall under foreign ownership.\n\nAt the same time, Japan is increasing oversight of sensitive technologies as tensions grow with neighbouring China.\n\nJapan wants to attract overseas investment, Kobayashi said, citing a speech Prime Minister Fumio Kishida made this month to bankers and investors in London, when he set out a plan to grow the world's third-largest economy by attracting private-sector investment and redistributing wealth.\n\nToshiba, whose businesses include nuclear energy, military radar, infrastructure and semiconductors, on May 13 said it had received interest from 10 investors for a potential buyout. It did not name them, although U.S. private equity firms Bain, Blackstone and KKR are among those considering bids, sources have said.\n\nToshiba, which has been rocked by accounting scandals and a governance crisis, has established a committee to look at deals that could take it into private hands as well as other options. Shareholders earlier rejected a management-backed restructuring plan.\n\nA shareholder-commissioned investigation published a year ago said Toshiba's managers colluded with Japan's Ministry of Economy Trade (METI) and Industry to block the influence of foreign stockholders. METI minister, Koichi Hagiuda declined to order an investigation of that allegation.\n\n(Reporting by Tim Kelly and Kaori Kaneko; editing by Barbara Lewis)","link":"https:\/\/finance.yahoo.com\/news\/japan-set-allow-foreign-toshiba-120323129.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ECONOMIC SECURITY","FOREIGN INVESTORS","FOREIGN OWNERSHIP","JAPAN","PRIVATE EQUITY FIRMS","SENSITIVE TECHNOLOGIES","TAKAYUKI KOBAYASHI","TOSHIBA CORP"],"sentiment":{"polarity":0.732,"neg":0.05,"neu":0.869,"pos":0.081}},{"date":"2022-05-13T03:58:11+00:00","title":"UPDATE 2-Toshiba delays board nominations for June meeting","content":"(Adds reason for delay)\n\nTOKYO, May 13 (Reuters) - Toshiba Corp said on Friday it had delayed board director nominations ahead of the annual shareholders meeting in June as it needed more time to finalise the candidates.\n\nThe Japanese industrial conglomerate is in the process of ascertaining whether there were any conflict-of-interest issues for some candidates, causing the delay, a source familiar with the matter said.\n\nToshiba has been locked in a years long battle with some of its major shareholders over its direction, and it set up a special committee last month to solicit potential buyout offers after shareholders voted down a management-backed restructuring plan.\n\nInvestors are waiting for the company to reveal its nominee for the board's new chair to replace interim chairman Satoshi Tsunakawa.\n\nTsunakawa has been holding the position since shareholders last year rejected the re-election of the then chairman, after the company's management was found to have colluded with the Japanese government to put pressure on foreign investors. (Reporting by Makiko Yamazaki and Sam Nussey; Editing by Himani Sarkar, Uttaresh.V and Vinay Dwivedi)","link":"https:\/\/finance.yahoo.com\/news\/1-toshiba-delays-unveiling-board-035811091.html","symbols":["TOSBF.US","TOSYY.US","TSE1.F"],"tags":["ANNUAL SHAREHOLDERS MEETING","BOARD DIRECTOR","TOSHIBA CORP"],"sentiment":{"polarity":-0.818,"neg":0.068,"neu":0.912,"pos":0.021}}]